package acmp;

/* acmp.ru   |   Задание №784
		Эволюция
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |3                   |
|1 |15                  |                    |
|  |12                  |                    |
|--|--------------------|--------------------|
|  |18                  |14563               |
|2 |233016              |                    |
|  |233008              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_784 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}