package acmp;

/* acmp.ru   |   Задание №742
		Постройка дорог
(Время: 1 сек. Память: 16 Мб Сложность: 33%)
В известном городе Кызылорда, где находятся N центров, живет некий граф - Азамат. Он желает узнать количество различных построек дорог между ними, если известно, что два центра могут быть связаны в одном из двух направлений или не связаны вообще. Например, при N=2 все получается 3 варианта:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |3                   |
|2 |4                   |729                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_742 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}