package acmp;

/* acmp.ru   |   Задание №143
		A-B
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
Требуется найти разность между неотрицательными числами А и В.

Входные данные
Во входном файле INPUT.TXT в двух строках записаны два неотрицательных целых числа A и B, не превышающие 10^1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите значение A-B.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |7                   |2                   |
|1 |5                   |                    |
|--|--------------------|--------------------|
|  |5                   |-12                 |
|2 |17                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_143 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}