package acmp;

/* acmp.ru   |   Задание №635
		Интернет-олимпиады
(Время: 1 сек. Память: 16 Мб Сложность: 33%)
Многим известно о проекте «Интернет-олимпиады по информатике», расположенном в сети Интернет по адресу <a href="http://neerc.ifmo.ru/school/io/" target="_blank">http://neerc.ifmo.ru/school/io/</a>, где проводятся онлайн-олимпиады для школьников в двух номинациях: базовой и усложненной. Ваша задача состоит в том, чтобы написать программу, обрабатывающую результаты Интернет-олимпиады, то есть определяющую: какие команды в какой номинации будут участвовать в следующей олимпиаде.

Правила перехода команд из одной номинации в другую таковы. Задачи усложненной номинации решают следующие команды:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |6 3                 |4                   |
|  | 1 1 45             |3 4 1999 2000       |
|  | 2 4 678            |                    |
|  | 3 5 1000           |                    |
|  | 4 5 894            |                    |
|1 | 5 2 343            |                    |
|  | 6 3 555            |                    |
|  | 1998 0 0           |                    |
|  | 1999 1 34          |                    |
|  | 2000 3 366         |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_635 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}