package acmp;

/* acmp.ru   |   Задание №831
		Снова про простые числа
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Найдите простое число из отрезка [a, b] с максимальной суммой цифр. Если таких чисел несколько, выберите из них максимальное.

Напомним, что <i>простым</i> называется натуральное число, большее единицы и делящееся только на единицу и на само себя.

Входные данные
Входной файл INPUT.TXT содержит два целых числа: a и b (1 ≤ a ≤ b ≤ 10^8, b&#x2212;a ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу. Если указанный отрезок не содержит простых чисел, выведите в выходной файл -1.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 13                |7                   |
|2 |900 1000            |997                 |
|3 |8 10                |-1                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_831 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}