package acmp;

/* acmp.ru   |   Задание №719
		Фотограф-псих
(Время: 1 сек. Память: 16 Мб Сложность: 43%)
Пришел как-то раз в гости к фотографу-зануде его двоюродный брат, и начали они спорить о том, кто сколько человек сфотографировал и кто больше фотографий сделал. После долгого подсчета выяснилось, что фотограф-зануда выиграл. Брату это, естественно, не понравилось, поэтому он пошел к себе ставить новый рекорд.

Для этого он пригласил к себе N человек и фотографировал их, располагая всеми различными способами вдоль одной линии. Всего получилось F фотографий.

Разумеется, сделать их за один день он не смог, так как в ближайших магазинах попросту не хватало фотопленки. Когда же он закончил работу, он приступил к рассылке извещений всем своим клиентам. Каждое извещение помещается в отдельный конверт и отправляется по адресу прописки клиента.

Помогите фотографу определить число конвертов, которое необходимо закупить, если известно число фотографий F. Известно также, что число клиентов положительное и не превышает 10^5.

Входные данные
В единственной строке входного файла INPUT.TXT содержится натуральное число F, не превосходящее 10^500000.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно натуральное число — количество конвертов для закупки.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |2                   |
|2 |6227020800          |13                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_719 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}