package acmp;

/* acmp.ru   |   Задание №464
		Число в последовательности
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
Последовательность 011212201220200112… строится следующим образом: сначала пишется 0, затем повторяется следующее действие: уже написанную часть приписывают справа с заменой 0 на 1, 1 на 2, 2 на 0, и т.д.

Требуется написать программу, которая по заданному натуральному числу N определяет, какое число стоит на N-ом месте.

Входные данные
Входной файл INPUT.TXT содержит число N (1 ≤ N ≤ 2147483647).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно искомое число.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |0                   |
|2 |10                  |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_464 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}