package acmp;

/* acmp.ru   |   Задание №841
		Окружности
(Время: 1 сек. Память: 16 Мб Сложность: 25%)
На какое максимальное число областей можно разбить плоскость при помощи N окружностей одинакового радиуса?

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |0                   |1                   |
|2 |3                   |8                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_841 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}