package acmp;

/* acmp.ru   |   Задание №787
		Игра с пешкой
(Время: 1 сек. Память: 16 Мб Сложность: 31%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |8                   |5                   |
|1 |3 1 4 1 5 9 2 6     |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_787 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}