package acmp;

/* acmp.ru   |   Задание №267
		Ксерокопии
(Время: 0,2 сек. Память: 16 Мб Сложность: 38%)
Секретарша Ирочка сегодня опоздала на работу и ей срочно нужно успеть к обеду сделать N копий одного документа. В ее распоряжении имеются два ксерокса, один из которых копирует лист за х секунд, а другой – за y секунд. (Разрешается использовать как один ксерокс, так и оба одновременно. Можно копировать не только с оригинала, но и с копии.) Помогите ей выяснить, какое минимальное время для этого потребуется.

Входные данные
Во входном файле INPUT.TXT записаны три натуральных числа N, x и y, разделенные пробелом (1 ≤ N ≤ 2&#x2219;10^8, 1 ≤ x, y ≤ 10).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число – минимальное время в секундах, необходимое для получения N копий.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 1 1               |3                   |
|2 |5 1 2               |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_267 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}