package acmp;

/* acmp.ru   |   Задание №161
		Восстановление перестановки
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
<i>Перестановкой</i> из N элементов называется упорядоченный набор из N различных чисел от 1 до N.

Пусть дана перестановка &#x3c0;. Обозначим &#x3c6;[i] - количество таких j, что &#x3c0;[j] &gt; &#x3c0;[i], а j &lt; i. &#x3c6; называется <i>таблицей инверсий</i> перестановки &#x3c0;.

Требуется по данной таблице инверсий восстановить перестановку.

Входные данные
В первой строке входного файла INPUT.TXT записано число 0 &lt; N ≤ 2000 - порядок перестановки. Во второй строке записана таблица инверсий.

Выходные данные
В выходной файл OUTPUT.TXT выведите искомую перестановку.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |2 3 1               |
|1 |0 0 2               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_161 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}