package acmp;

/* acmp.ru   |   Задание №251
		Калах
(Время: 1 сек. Память: 16 Мб Сложность: 57%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4 1                 |7 0 0 0             |
|1 | 1 2 2 2            |                    |
|  | 4                  |                    |
|--|--------------------|--------------------|
|  |2 2                 |1 1                 |
|  | 1                  |                    |
|2 | 1                  |                    |
|  | 2                  |                    |
|  | 2                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_251 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}