package acmp;

/* acmp.ru   |   Задание №725
		Громоотвод
(Время: 1 сек. Память: 16 Мб Сложность: 72%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2 30                |4.898979485794484   |
|1 | 0 0 3 3 1          |                    |
|  | 3 3 4 4 1          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_725 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}