package acmp;

/* acmp.ru   |   Задание №339
		Мероприятие
(Время: 1 сек. Память: 16 Мб Сложность: 31%)
Мише поручили решить следующую задачу: имеется дата начала и конца некоторого мероприятия; требуется определить его длительность. Он написал программу и попросил Машу её проверить.

Через некоторое время пришла Маша и расстроила Мишу: «Твоя программа работает неправильно. По-моему, ты забыл, что года бывают високосными».

У Миши очень мало свободного времени и он не успевает исправить свою программу. Помогите ему.

Год является високосным, тогда и только тогда, когда выполнено одно из следующих условий:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |01.09.2005          |36                  |
|1 |06.10.2005          |                    |
|--|--------------------|--------------------|
|  |01.09.0005          |366                 |
|2 |01.09.0006          |                    |
|--|--------------------|--------------------|
|  |01.02.2004          |30                  |
|3 |01.03.2004          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_339 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}