package acmp;

/* acmp.ru   |   Задание №358
		Забор в парке
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
В бесконечном парке деревья образуют квадратную решетку с шагом один метр. Часть парка было решено оградить забором, который представляет собой треугольник с заданными координатами вершин. Деревья, которые в точности попадают на вершины или стороны треугольника, придется срубить.

Требуется написать программу, которая найдет количество таких деревьев.

Входные данные
Входной файл INPUT.TXT содержит шесть целых чисел – координаты вершин треугольника (абсцисса, ордината). Все числа по абсолютной величине не превышают 10^9 и разделены пробелами.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно число – количество деревьев.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |0 0 2 0 0 2         |6                   |
|2 |0 0 -1 -1 -1 0      |3                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_358 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}