package acmp;

/* acmp.ru   |   Задание №572
		Технология программирования
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
Толик придумал новую технологию программирования. Он хочет уговорить друзей использовать ее. Однако все не так просто. i-й друг согласится использовать технологию Толика, если его авторитет будет не меньше ai (авторитет выражается целым числом). Как только он начнет ее использовать, к авторитету Толика прибавится число bi (попадаются люди, у которых bi &lt; 0). Помогите Толику наставить на путь истинный как можно больше своих друзей.

Входные данные
На первой строке входного файла INPUT.TXT содержатся два числа: n (1 ≤ n ≤ 1000) – количество друзей у Толика, и первоначальный авторитет Толика . Следующие n строк содержат пары чисел ai и bi. Все числа целые, по модулю не больше 10^6.

Выходные данные
В выходной файл OUTPUT.TXT выведите число m - максимальное число друзей, которых может увлечь Толик, и затем m чисел - номера друзей в том порядке, в котором их нужно агитировать.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5 1                 |4                   |
|  | 1 3                | 1 4 3 5            |
|  | 6 -5               |                    |
|1 | 6 -4               |                    |
|  | 2 2                |                    |
|  | 2 -1               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_572 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}