package acmp;

/* acmp.ru   |   Задание №962
		Развлечение с квадратиками
(Время: 3 сек. Память: 64 Мб Сложность: 75%)
У Димы есть N квадратиков, стороны которых параллельны осям координат. Для двух квадратов A и B обозначим фигуру, которая состоит из точек A, не принадлежащих B, как A-B.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |6                   |
|  | 0 0 3              |                    |
|1 | 1 1 1              |                    |
|  | 2 2 1              |                    |
|  | 1 1 3              |                    |
|--|--------------------|--------------------|
|  |4                   |0                   |
|  | 0 0 3              |                    |
|2 | 1 1 3              |                    |
|  | 2 2 3              |                    |
|  | 4 4 3              |                    |
|--|--------------------|--------------------|
----------------------------------------------

Пояснение
В первом примере подходят следующие наборы: {0, 1, 3, 2}, {1, 0, 2, 3}, {1, 3, 2, 0}, {2, 0, 1, 3}, {2, 3, 1, 0} и {3, 2, 0, 1}.



Решение.

*/


import java.util.Scanner;

public class acmp_962 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}