package acmp;

/* acmp.ru   |   Задание №839
		Всем известно
(Время: 1 сек. Память: 16 Мб Сложность: 14%)
Всем известно, что многие олимпиадные задачи начинаются со слов «Всем известно». Но мало кто знает, что начинающему программисту Паше такие задачи меньше всего нравятся. Потому что обычно после слов «всем известно» описывается такой факт, о котором он даже не догадывался. После очередной подобной задачи Паша решил проверить, а действительно ли всем известно, что сумма первых N нечетных чисел равняется N^2:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |11111101010011      |NO                  |
|2 |11                  |YES                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_839 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}