package acmp;

/* acmp.ru   |   Задание №975
		Числа - 4
(Время: 1 сек. Память: 16 Мб Сложность: 71%)
Среди натуральных чисел от 1 до N требуется найти минимальное в лексикографическом порядке число, которое делится на K.

Входные данные
Входной файл INPUT.TXT содержит несколько тестовых примеров (не более 2000). Каждый тестовый пример расположен на одной строке и состоит из двух целых чисел N и K (1 ≤ N ≤ 10^18, 1 ≤ K ≤ N). Последняя строка содержит два нуля, их обрабатывать не требуется.

Выходные данные
В выходной файл OUTPUT.TXT для каждого тестового примера выведите одно целое число – наименьшее в лексикографическом порядке число, не превышающее N, которое делится на K.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2000 17             |1003                |
|  | 2000 20            | 100                |
|1 | 2000 22            | 1012               |
|  | 0 0                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_975 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}