package acmp;

/* acmp.ru   |   Задание №273
		Вычеркивание
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Задано натуральное число N. Требуется написать программу, вычисляющую количество различных трехзначных чисел получающихся из N вычеркиванием цифр из его десятичной записи.

Входные данные
Входной текстовый файл INPUT.TXT содержит одно натуральное число N (1 ≤ N ≤ 10^100).

Выходные данные
Выходной текстовый файл OUTPUT.TXT должен содержать одно целое число - найденное количество трехзначных чисел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |12                  |0                   |
|2 |111111111110011111111|4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_273 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}