package acmp;

/* acmp.ru   |   Задание №327
		В одном шаге от счастья
(Время: 1 сек. Память: 16 Мб Сложность: 16%)
Вова купил билет в трамвае 13-го маршрута и сразу посчитал суммы первых трёх цифр и последних трёх цифр номера билета (номер у билета шестизначный). Оказалось, что суммы отличаются ровно на единицу. «Я в одном шаге от счастья», — подумал Вова, — «или предыдущий или следующий билет точно счастливый». Прав ли он?

Входные данные
Входной файл INPUT.TXT содержит в первой строке число K – количество тестов. В следующих K строках записаны номера билетов. Количество тестов не больше 10. Номер состоит ровно из шести цифр, среди которых могут быть и нули. Гарантируется, что Вова умеет считать, то есть суммы первых трех цифр и последних трех цифр отличаются ровно на единицу.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать K строк, в каждой из которых для соответствующего теста следует указать "Yes", если Вова прав, и "No", если нет.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |Yes                 |
|  |715068              | No                 |
|1 | 445219             | Yes                |
|  | 012200             |                    |
|--|--------------------|--------------------|
----------------------------------------------

Примечание
Трамвайный билет называется счастливым, если сумма его первых трёх цифр равна сумме его последних трёх цифр.



Решение.

*/


import java.util.Scanner;

public class acmp_327 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}