package acmp;

/* acmp.ru   |   Задание №296
		Лиса Алиса и кот Базилио
(Время: 1 сек. Память: 16 Мб Сложность: 22%)
Лиса Алиса и кот Базилио вырастили денежное дерево. И выросли на нем трехрублевые и пятирублевые золотые монеты. Лиса Алиса себе взяла трехрублевые монеты, а коту Базилио отдала пятирублевые монеты. Посетовав на свою скромность, она предложила впредь рассчитываться за покупки вместе, деньги давать без сдачи и минимальным числом монет. Известно, что они сделали покупку стоимостью N рублей, при этом они рассчитались без сдачи.

Вам следует написать программу, которая определяет: сколько монет внес кот Базилио, и сколько монет внесла лиса Алиса.

Входные данные
Во входном файле INPUT.TXT записано одно натуральное число N – стоимость покупки в рублях (7 &lt; N &lt; 1000).

Выходные данные
В выходной OUTPUT.TXT выведите два целых числа через пробел: число монет, которые отдал кот Базилио и число монет, которые отдала лиса Алиса.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |8                   |1 1                 |
|2 |11                  |1 2                 |
|3 |15                  |3 0                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_296 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}