package acmp;

/* acmp.ru   |   Задание №140
		Цикл отрицательного веса
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
Дан взвешенный граф. Определить, есть ли в нем цикл отрицательного веса.

Входные данные
Во входном файле INPUT.TXT в первой строке записано число N (1 ≤ N ≤ 100) - количество вершин графа. В следующих N строках находится по N чисел - матрица смежности графа. Веса ребер не превышают по модулю 10000. Если ребра нет, соответствующее значение равно 100000.

Выходные данные
В выходной файл OUTPUT.TXT выведите "YES", если цикл существует, или "NO" в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |YES                 |
|1 | 0 -1               |                    |
|  | -1 0               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_140 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}