package acmp;

/* acmp.ru   |   Задание №895
		Крестики-нолики
(Время: 1 сек. Память: 16 Мб Сложность: 19%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |.OX                 |Win                 |
|1 | .XO                |                    |
|  | XXO                |                    |
|--|--------------------|--------------------|
|  |OXO                 |Lose                |
|2 | .OX                |                    |
|  | OXX                |                    |
|--|--------------------|--------------------|
|  |XOX                 |Draw                |
|3 | XOX                |                    |
|  | OXO                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_895 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}