package acmp;

/* acmp.ru   |   Задание №422
		Упорядоченные дроби
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
Требуется вывести в порядке возрастания все несократимые дроби, заключённые между 0 и 1, знаменатели которых не превышают N.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N. (2 ≤ N ≤ 255)

Выходные данные
В выходной файл OUTPUT.TXT выведите в каждой строке по дроби – элементу искомой последовательности в таком же формате, как в примерах.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |1/3                 |
|1 |                    |1/2                 |
|  |                    |2/3                 |
|--|--------------------|--------------------|
|  |5                   |1/5                 |
|  |                    |1/4                 |
|  |                    |1/3                 |
|  |                    |2/5                 |
|2 |                    |1/2                 |
|  |                    |3/5                 |
|  |                    |2/3                 |
|  |                    |3/4                 |
|  |                    |4/5                 |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_422 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}