package acmp;

/* acmp.ru   |   Задание №397
		Качество строки
(Время: 1 сек. Память: 16 Мб Сложность: 52%)
Назовем <i>качеством строки</i> разность между максимальным и минимальным номерами в алфавите букв, входящих в строку. Например, качество строки ab равно 2 - 1 = 1, а строки abcz равно 26 - 1 = 25.

Дана строка S. Необходимо найти непустую подстроку этой строки, обладающую максимальным качеством, а из всех таких – минимальную по длине.

Входные данные
Входной файл INPUT.TXT содержит непустую строку S, состоящую из строчных букв английского алфавита. Ее длина не превосходит 2&#x2219;10^5 символов.

Выходные данные
В выходной файл OUTPUT.TXT выведите искомую подстроку. Если вариантов ответа несколько, выведите любой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |aba                 |ab                  |
|2 |zzz                 |z                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_397 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}