package acmp;

/* acmp.ru   |   Задание №575
		Строительство
(Время: 1 сек. Память: 16 Мб Сложность: 41%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 4                 |4.56                |
|  | 1 1 3 3            |                    |
|1 | 1 2 2 3            |                    |
|  | 2 2 3 3            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_575 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}