package acmp;

/* acmp.ru   |   Задание №519
		Наименьшее и наибольшее числа из тех же цифр
(Время: 1 сек. Память: 16 Мб Сложность: 23%)
Требуется написать программу, которая найдет наименьшее и наибольшее числа, состоящие из тех же цифр, что и заданное натуральное число N.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (N ≤ 2&times;10^9).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать в одной строке наименьшее, а через пробел – наибольшее числа.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |7051                |1057 7510           |
|2 |851                 |158 851             |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_519 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}