package acmp;

/* acmp.ru   |   Задание №915
		Кубик - 2
(Время: 1 сек. Память: 16 Мб Сложность: 54%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 3                 |78                  |
|  | 1 -2 3             |                    |
|1 | -4 5 -6            |                    |
|  | 7 -8 9             |                    |
|--|--------------------|--------------------|
----------------------------------------------

Пояснение к примеру
Первоначально кубик следует установить на 6, далее вниз на 2, потом вниз на 6, вправо на 2 вправо на 6. Итого 6*1 + 2*(-4) + 6*7 + 2*(-8) + 6*9 = 78



Решение.

*/


import java.util.Scanner;

public class acmp_915 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}