package acmp;

/* acmp.ru   |   Задание №862
		Домашняя работа
(Время: 1 сек. Память: 16 Мб Сложность: 51%)
Витя наконец-то прошёл последний уровень своей любимой игры "Прострели мне колено". На часах было уже полдвенадцатого, а он до сих пор не сделал домашнюю работу по математике. Прочитав задание, Витя сказал: "О, какое же оно скучное, посчитать сумму прогрессии... Вот посчитать сумму остатков - это весело!". Витя написал в тетрадке

<img src="/asp/article/image.asp?id=454">

и... задание было настолько весёлым, что он уснул через 5 минут прямо на столе. Завтра ему с утра нужно опять в школу, и опять он пойдёт с не сделанной домашней работой. Пока он спит, посчитайте для него ответ, на записанную им сумму, чтобы с утра у него было хорошее настроение.

Входные данные
В единственной строке входного файла INPUT.TXT содержаться два числа n и m - числа, записанные Витей. Оба числа натуральные и не превосходят миллиарда.

Выходные данные
В выходной файл OUTPUT.TXT выведете единственное число - ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5 5                 |14                  |
|2 |10 1                |9                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_862 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}