package acmp;

/* acmp.ru   |   Задание №423
		Сообщение
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
В сообщении, состоящем из заглавных русских букв и пробелов, каждую букву заменили её порядковым номером в русском алфавите (А - 1, Б - 2, ..., Я - 33), а пробел - нулем.

Требуется по заданной последовательности цифр найти количество исходных сообщений, из которых она могла получиться.

Входные данные
Входной файл INPUT.TXT содержит последовательность цифр, состоящую не более чем из 100 цифр.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1025                |4                   |
|2 |21705               |3                   |
|3 |33222               |8                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_423 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}