package acmp;

/* acmp.ru   |   Задание №320
		Коридор
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
Прямоугольный коридор длиной N метров и шириной M метров решили застелить N прямоугольными плитками шириной 1 метр и длиной M метров, таким образом, чтобы не было не застеленной поверхности.

Требуется написать программу, которая найдет количество способов это сделать. Например, для коридора с размерами 6 на 4 существует четыре способа застелить плитками 1 на 4.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 6                 |4                   |
|2 |2 2                 |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_320 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}