package acmp;

/* acmp.ru   |   Задание №26
		Две окружности
(Время: 1 сек. Память: 16 Мб Сложность: 17%)
На плоскости даны две окружности. Требуется проверить, имеют ли они хотя бы одну общую точку.

Входные данные
Входной файл INPUT.TXT состоит из двух строк. На каждой строке записана информация об одной окружности – координаты ее
центра x и y (целые числа, по модулю не превосходящие 5000) и радиус (целое число 1 ≤ r ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите «YES», если окружности имеют хотя бы одну общую точку, и «NO» в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |0 0 2               |YES                 |
|1 |0 3 2               |                    |
|--|--------------------|--------------------|
|  |1 1 1               |NO                  |
|2 |4 4 1               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.
координаты первого круга - (x1, y1)
радиус первого круга - r1
координаты второго круга - (x2, y2)
радиус второго круга - r2

r1+x1
*/


import java.util.Scanner;

public class acmp_026 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}