package acmp;

/* acmp.ru   |   Задание №148
		НОД
(Время: 1 сек. Память: 16 Мб Сложность: 15%)
Даны два натуральных числа A и B. Требуется найти их наибольший общий делитель (НОД).

Входные данные
Во входном файле INPUT.TXT в единственной строке записаны натуральные числа A и B через пробел (A, B ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите НОД чисел А и В.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |12 42               |6                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_148 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}