package acmp;

/* acmp.ru   |   Задание №66
		Клавиатура
(Время: 1 сек. Память: 16 Мб Сложность: 11%)
Для данной буквы английского алфавита нужно вывести справа стоящую букву на стандартной клавиатуре. При этом клавиатура замкнута, т.е. справа от буквы «p» стоит буква «a», от буквы «l» стоит буква «z», а от буквы «m» — буква «q».

Входные данные
Первая строка входного файла INPUT.TXT содержит один символ — маленькую букву английского алфавита.

Выходные данные
В выходной файл OUTPUT.TXT следует вывести букву стоящую справа от заданной буквы, с учетом замкнутости клавиатуры.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |q                   |w                   |
|2 |t                   |y                   |
|3 |p                   |a                   |
|4 |l                   |z                   |
|5 |m                   |q                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_66 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}