package acmp;

/* acmp.ru   |   Задание №629
		Сочетания
(Время: 1 сек. Память: 16 Мб Сложность: 55%)
Петя выписал все сочетания из N первых английских букв по K букв. В каждом сочетании он выписывал буквы в лексикографическом порядке. Сочетания он выписывал в лексикографическом порядке по одному в строке. Теперь он хочет узнать: какое слово записано в M-ой строке.

Входные данные
Во входном файле INPUT.TXT записаны целые числа N, K, M (1 ≤ N ≤ 26, 1 ≤ K ≤ N). Гарантируется, что M не превосходит количества всех выписанных сочетаний.

Выходные данные
В выходной файл OUTPUT.TXT выведите M-ое выписанное сочетание.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 2 3               |ad                  |
----------------------------------------------

Пояснение
Все сочетания в порядке их записи: ab, ac, ad, bc, bd, cd. Здесь 3м по счету сочетанием является ad.



Решение.

*/


import java.util.Scanner;

public class acmp_629 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}