package acmp;

/* acmp.ru   |   Задание №111
		Игра «Пуговицы»
(Время: 0,25 сек. Память: 16 Мб Сложность: 48%)
Правила игры очень просты. Перед двумя играющими находится кучка из K пуговиц. Играющие по очереди берут пуговицы из кучки, причем за один ход каждый из них может взять от 1 до L пуговиц. Выигрывает тот из спортсменов, которому удастся взять последнюю пуговицу.

Тот из игроков, которому по жребию выпадает делать первый ход, получает возможность собственноручно назначить число K. Тот из игроков, который будет ходить вторым, выбирает, в свою очередь, число L.

Вам необходимо определить наилучшую стратегию для участника, который ходит вторым.

Входные данные
Во входном файле INPUT.TXT записано одно натуральное число K (1 ≤ K ≤ 10^8) – общее количество пуговиц.

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести целое число L (2 ≤ L &lt; K) — максимальное количество пуговиц, которое можно взять за один ход, обеспечивающее победу второму игроку. Если таких чисел несколько, то следует вывести наименьшее из них. Если таких чисел нет, то следует вывести число 0.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |2                   |
|2 |26                  |12                  |
|3 |31                  |30                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_111 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}