package acmp;

/* acmp.ru   |   Задание №357
		Делимость на 11
(Время: 1 сек. Память: 16 Мб Сложность: 22%)
Для делимости числа на 11 необходимо, чтобы разность между суммой цифр, стоящих на четных местах, и суммой цифр, стоящих на нечетных местах, делилась на 11.

Требуется написать программу, которая проверит делимость заданного числа на 11.

Входные данные
Входной файл INPUT.TXT содержит одно натуральное число N, делимость которого надо проверить (1 ≤ N ≤ 10^10000).

Выходные данные
В выходной файл OUTPUT.TXT выведите “YES”, если число делится на 11, или “NO” иначе.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |121                 |YES                 |
|2 |1211                |NO                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_357 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}