package acmp;

/* acmp.ru   |   Задание №210
		Степень
(Время: 1 сек. Память: 16 Мб Сложность: 59%)
Для того чтобы проверить, как её ученики умеют считать, Мария Ивановна каждый год задаёт им на дом одну и ту же задачу – для заданного натурального A найти минимальное натуральное N такое, что N в степени N (N, умноженное на себя N раз) делится на A. От года к году меняется только число A.

Вы решили помочь будущим поколениям. Для этого вам необходимо написать программу, решающую эту задачу.

Входные данные
Во входном файле INPUT.TXT содержится единственное число A (1 ≤ A ≤ 10^9 – на всякий случай, вдруг Мария Ивановна задаст большое число, чтобы «завалить» кого-нибудь…).

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести единственное число N.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |8                   |4                   |
|2 |13                  |13                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_210 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}