package acmp;

/* acmp.ru   |   Задание №617
		Ладьи
(Время: 2 сек. Память: 16 Мб Сложность: 80%)
Напомним, что ладья - это шахматная фигура, которая ходит по вертикалям и горизонталям.

Будем называть расстановку w белых и b черных ладей на доске размера m&times;n мирной, если ни одна ладья не угрожает ладье другого цвета.

Для заданных m, n, w и b найдите количество мирных расстановок ладей на доске.

Входные данные
Входной файл INPUT.TXT содержит четыре целых числа: m, n, w и b (2 ≤ m, n ≤ 10, 1 ≤ w, 1 ≤ b, w+b ≤ m•n).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число - количество мирных расстановок w белых и b черных ладей на доске размера m&times;n.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 3 2 2             |18                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_617 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}