package acmp;

/* acmp.ru   |   Задание №858
		Площадь треугольника - 2
(Время: 1 сек. Память: 16 Мб Сложность: 41%)
Три попарно непараллельные прямые заданы коэффициентами ai, bi, ci соответствующего уравнения aix + biy = ci. Коэффициенты ai и bi не могут быть одновременно равны нулю.

Требуется написать программу, определяющую площадь треугольника, образованного этими прямыми.

Входные данные
Входной файл INPUT.TXT содержит 3 строки, в каждой из которых записаны коэффициенты ai, bi, ci, разделенные пробелом. Все коэффициенты – целые числа, не превосходящие 10000 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT выведите значение площади треугольника с точностью не меньшей, чем три знака после запятой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |0 1 1               |6.000               |
|1 | 1 0 1              |                    |
|  | 4 3 19             |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_858 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}