package acmp;

/* acmp.ru   |   Задание №424
		Игра умножения
(Время: 1 сек. Память: 16 Мб Сложность: 52%)
Слава и Оля играют в игру умножения: умножают целое число P на одно из чисел от 2 до 9. Слава всегда начинает с P = 1, делает умножение, затем число умножает Оля, затем Слава и т.д. Перед началом игры им задают случайное число N, и победителем считается тот, кто первым получит P ≥ N.

Требуется определить, кто выиграет при заданном числе N, если известно, что Слава и Оля играют наилучшим образом.

Входные данные
Входной файл INPUT.TXT содержит целое N. (2 ≤ N ≤ 4 294 967 295)

Выходные данные
В выходной файл OUTPUT.TXT выведите «Stan wins.», если победит Слава, или «Ollie wins.», если победит Оля.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |162                 |Stan wins.          |
|2 |17                  |Ollie wins.         |
|3 |34012226            |Stan wins.          |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_424 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}