package acmp;

/* acmp.ru   |   Задание №338
		Лоскутки
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
Вася Пупкин взял листочек в клетку и начал его резать по определённым линиям. На запасном листке такого же размера он закрасил клетки, по которым проходили линии. Василий Васильевич так увлёкся этим занятием, что запутался, сколько частей от листа у него осталось. Ваша задача найти это число.

Входные данные
Во входном файле INPUT.TXT в первой строке записаны N и M (0 &lt; N, M ≤ 100) – размерность матрицы. Далее записана матрица из N строк, каждая из которых содержит M нулей и единиц. 0 обозначает не закрашенную клетку и 1 – закрашенную (линию разреза).

Выходные данные
В выходной файл OUTPUT.TXT следует вывести количество оставшихся частей листа.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4 4                 |2                   |
|  | 0 0 1 0            |                    |
|1 | 0 0 1 0            |                    |
|  | 0 1 0 0            |                    |
|  | 1 0 0 1            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_338 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}