package acmp;

/* acmp.ru   |   Задание №786
		Игра с камешками
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
В начале игры имеем N камешков. Играют двое. За один ход нужно разделить кучку на две неравные и забрать себе меньшую. Проиграл тот, кто не смог этого сделать.

Сколько камешков взяли бы Вы первым ходом, если рассчитываете на победу и ходите первым?

Входные данные
В единственной строке входного файла INPUT.TXT записано одно число - число камушков в кучке N (1 ≤ N ≤ 10^6).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число - количество взятых Вами первым ходом камушков, либо 0, если выигрышного хода нет.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |7                   |3                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_786 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}