package acmp;

/* acmp.ru   |   Задание №312
		Арифметическая прогрессия
(Время: 1 сек. Память: 16 Мб Сложность: 15%)
Заданы первый и второй элементы арифметической прогрессии. Требуется написать программу, которая вычислит элемент прогрессии по ее номеру.

Входные данные
Первая строка входного файла INPUT.TXT содержит три целых числа, разделенных пробелами – первый элемент прогрессии A1 (1 ≤ A1 ≤ 1000), второй элемент прогрессии A2 (1 ≤ A2 ≤ 1000), и номер требуемого элемента N (1 ≤ N ≤ 1000).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно целое число - N-й элемент арифметической прогрессии.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 5 3               |9                   |
----------------------------------------------

Пояснение к примеру
Здесь речь идет о следующей последовательности чисел:</p> 1, 5, 9, 13, 17, 21, … <p class="text">В данной последовательности D=4, поэтому A1=1, A2=A1+D=5, A3=A1+2*D=9, и т.д. Поскольку нам нужно было найти 3й элемент прогрессии, то ответом на задачу является число 9.



Решение.

*/


import java.util.Scanner;

public class acmp_312 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}