package acmp;

/* acmp.ru   |   Задание №783
		Укладка плитки
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Бригаде строителей поручили уложить квадратной плиткой пол на кухне в виде шахматного узора. Но строители работали не очень слаженно, и когда весь пол уже был уложен, оказалось, что в некоторых местах плитки одинакового цвета граничат друг с другом.

По заданному замощению определите, какое минимальное число строителей могло укладывать плитку.

Входные данные
Входной файл INPUT.TXT содержит восемь строк, состоящих из восьми символов W и B – полученное замощение. Символ W обозначает плитку белого цвета, а символ B – чёрную.

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести одно число - искомое число строителей.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |WBWBWBBW            |4                   |
|  | BWBBWBWB           |                    |
|  | WBWWBWBW           |                    |
|  | WBWWBWWB           |                    |
|1 | BWBBWBWB           |                    |
|  | WBWBWWBW           |                    |
|  | BWBWBBWB           |                    |
|  | WBWBWWBW           |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_783 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}