package acmp;

/* acmp.ru   |   Задание №837
		Точки и линии
(Время: 1 сек. Память: 16 Мб Сложность: 33%)
Вася и Петя играют в следующую игру. Вася рисует в трехмерном пространстве N точек и говорит число M. Петя должен ответить, можно ли соединить эти N точек с помощью M непересекающихся линий, так, чтобы выполнялись следующие условия:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |Yes                 |
|1 | 2 0                |No                  |
|  |2 2                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_837 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}