package acmp;

/* acmp.ru   |   Задание №146
		Длинный корень
(Время: 1 сек. Память: 16 Мб Сложность: 67%)
По заданному натуральному числу А требуется найти наибольшее число В такое, что B^2 ≤ A.

Входные данные
Во входном файле INPUT.TXT записано натуральное число A (A ≤ 10^3000).

Выходные данные
В выходной файл OUTPUT.TXT выведите максимальное натуральное число B, квадрат которого не превосходит A. Число B следует выводить без лидирующих нулей.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |17                  |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_146 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}