package acmp;

/* acmp.ru   |   Задание №566
		Халява
(Время: 1 сек. Память: 16 Мб Сложность: 61%)
Гриша очень любит газировку PupsiCola. Однажды он узнал, что, собрав несколько крышек со звездочками, можно получить футболку. Гриша нашел A крышек с одной звездочкой, B крышек с двумя звездочками и C крышек с тремя звездочками. На футболку можно обменять набор крышек, общее количество звездочек на которых не меньше K.

Помогите Грише узнать, сколько футболок он может получить.

Входные данные
Входной файл INPUT.TXT содержит целые числа A, B, C и K (0 ≤ A, B, C ≤ 100, 1 ≤ K ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите максимальное количество футболок, которые может получить Гриша.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 2 2 4             |3                   |
|2 |0 0 4 4             |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_566 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}