package acmp;

/* acmp.ru   |   Задание №170
		Разложение числа
(Время: 0,5 сек. Память: 16 Мб Сложность: 35%)
Любое натуральное число можно представить в виде суммы нескольких последовательных натуральных чисел. Например, число 25 можно представить в виде суммы из одного (25), двух (12+13) или пяти (3+4+5+6+7) чисел.

Требуется написать программу, которая определит максимальное количество чисел в таком разложении.

Входные данные
Входной файл INPUT.TXT содержит одно натуральное число N (1 ≤ N ≤ 10^9).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно натуральное число – максимальное количество чисел в разложении числа N на сумму последовательных натуральных чисел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |1                   |
|2 |5                   |2                   |
|3 |25                  |5                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_170 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}