package acmp;

/* acmp.ru   |   Задание №720
		Клетки в кругу
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
Дан действительный радиус круга R и размер клетки L на клеточной бумаге. Известно, что центр круга находится на пересечении линий. Требуется найти число целых клеток, лежащих внутри круга. 0 ≤ R ≤ 25000, 1 &lt; L &lt; 100.

Входные данные
В единственной строке входного файла INPUT.TXT находятся действительное число R, заданное не более чем с 9 цифрами после десятичной точки, и натуральное число L, разделенные пробелом.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно натуральное число — количество клеток, целиком лежащих в кругу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5 1                 |60                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_720 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}