package acmp;

/* acmp.ru   |   Задание №944
		Размен
(Время: 1 сек. Память: 16 Мб Сложность: 41%)
У вас имеется неограниченное количество монеток N разных достоинств. Определить, можно ли с их помощью разменять заданные К сумм денег.

Входные данные
В первой строке входного файла INPUT.TXT задано число N, далее во второй строке записаны N чисел, задающих достоинства монеток. В третьей строке задано число К – количество сумм. В четвертой строке располагаются К чисел, определяющих размеры сумм. Все числа во входном файле натуральны и не превосходят 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите К чисел через пробел: для каждой суммы следует вывести 0, если ее разменять нельзя, и 1, если можно.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |1 1 0 1 1           |
|  |3 5                 |                    |
|1 |5                   |                    |
|  |3 6 7 11 12         |                    |
|--|--------------------|--------------------|
|  |1                   |0                   |
|  |10                  |                    |
|2 |1                   |                    |
|  |3                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_944 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}