package acmp;

/* acmp.ru   |   Задание №992
		Неприводимые диаграммы Юнга
(Время: 2 сек. Память: 16 Мб Сложность: 52%)
Диаграммы Юнга используются для того, чтобы изобразить разбиение числа на слагаемые. Разбиение числа n на слагаемые представляет собой сумму вида n = m1+ m2+ . . . + mk, где m1≥ m2≥ . . . ≥ mk.

Диаграмма состоит из n квадратиков, организованных в виде k рядов, где k –количество слагаемых в разбиении. Ряд, соответствующий числу mi, содержит mi квадратиков. Все ряды выровнены по левому краю и упорядочены от более длинного к более короткому.

Например, диаграмма Юнга, приведенная на рисунке, соответствует разбиению 9 = 5 + 2 + 2.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |1                   |
|1 |5 2 2               |1 1                 |
|--|--------------------|--------------------|
|  |1                   |1                   |
|2 |2                   |0                   |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_992 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}