package acmp;

/* acmp.ru   |   Задание №907
		Мышка
(Время: 1 сек. Память: 16 Мб Сложность: 9%)
Однажды компьютерная мышка подумала, что стоит взять про запас еще один коврик. Чтобы никто не заметил запасного коврика, мышка решила его спрятать под свой прямоугольный коврик. Пробравшись ночью на склад, мышка обнаружила там только круглые коврики. Удастся ли мышке спрятать круглый коврик под прямоугольным ковриком?

Входные данные
Первая строка входного файла INPUT.TXT содержит три натуральных числа через пробел: W, H и R, где W и H - ширина и высота прямоугольного коврика, а R – радиус запасного коврика. Все числа не превосходят значения 10^9.

Выходные данные
В выходной файл OUTPUT.TXT выведите «YES», если новый коврик можно спрятать под старым, и слово «NO», если этого сделать нельзя.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 7 2               |YES                 |
|2 |4 7 3               |NO                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_907 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}