package acmp;

/* acmp.ru   |   Задание №223
		Анаграммер
(Время: 1 сек. Память: 16 Мб Сложность: 75%)
Анаграммер — специальное устройство для получения из слова его анаграмм (то есть слов, записанных теми же буквами, но в другом порядке). Это устройство умеет выполнять 2 операции:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |TROT                |2                   |
|1 | TORT               |                    |
|--|--------------------|--------------------|
|  |MADAM               |4                   |
|2 | ADAMM              |                    |
|--|--------------------|--------------------|
|  |LONG                |0                   |
|3 | GONG               |                    |
|--|--------------------|--------------------|
|  |AAAAAAAA            |1430                |
|4 | AAAAAAAA           |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_223 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}