package acmp;

/* acmp.ru   |   Задание №940
		Орфография
(Время: 1 сек. Память: 16 Мб Сложность: 13%)
У студента-филолога Васи есть замечательный друг Петя. И Петя никак не может выучить английский язык. Английский текст Петя еще кое-как читает, но пишет с ужасными ошибками, причем чаще всего он вставляет в слова лишние буквы.

Вася решил помочь Пете. Теперь каждый день Вася диктует Пете слова, а Петя их записывает. После семестра занятий Петя стал писать много лучше и теперь делает в словах только по одной ошибке. Чтобы автоматизировать процесс исправления ошибок, Вася просит Вас написать программу, которая удаляет из слова одну лишнюю букву и показывает Пете правильное слово.

Входные данные
Входной файл INPUT.TXT содержит целое число K - номер лишней буквы, а затем через один или несколько пробелов записано слово S, состоящее из английских букв верхнего регистра. Гарантируется, что номер буквы от единицы до длины слова включительно. Длина слова не более 80 символов.

Выходные данные
В выходной файл OUTPUT.TXT выведите исправленное слово.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 MISTSPELL         |MISSPELL            |
|2 |2 &nbsp; &nbsp; &nbsp; ABC|AC                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_940 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}