package acmp;

/* acmp.ru   |   Задание №269
		Тормозной механизм
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
Исследовательская лаборатория одной известной автомобильной компании разработала специальный механизм, позволяющий повысить эффективность тормозов путем равномерной нагрузки деталей, используемых в тормозах.

Одним из основных компонентов механизма являются 2 прокладки, которые в процессе взаимодействия накладываются друг на друга. Каждая прокладка длины n разделена на n разделов, каждый из которых имеет высоту h или 2h. Таким образом, прокладки имеют зубчатую форму без закруглений.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2112112112          |10                  |
|1 | 2212112            |                    |
|--|--------------------|--------------------|
|  |12121212            |8                   |
|2 | 21212121           |                    |
|--|--------------------|--------------------|
|  |2211221122          |15                  |
|3 | 21212              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_269 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}