package acmp;

/* acmp.ru   |   Задание №44
		Стрелки
(Время: 1 сек. Память: 16 Мб Сложность: 20%)
Задана последовательность, состоящая только из символов ‘&gt;’, ‘&lt;’ и ‘-‘. Требуется найти количество стрел, которые спрятаны в этой последовательности. Стрелы – это подстроки вида ‘&gt;&gt;--&gt;’ и ‘&lt;--&lt;&lt;’.

Входные данные
В первой строке входного файла INPUT.TXT записана строка, состоящая из символов ‘&gt;’, ‘&lt;’ и ‘-‘ (без пробелов). Строка состоит не более, чем из 250 символов.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести искомое количество стрелок.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |&lt;&lt;&lt;&lt;&gt;&gt;--&gt;&lt;--&lt;&lt;--&lt;&lt;&gt;&gt;&gt;--&gt;&lt;&lt;&lt;&lt;&lt;|4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_044 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}