package acmp;

/* acmp.ru   |   Задание №752
		2-3 Дерево
(Время: 3 сек. Память: 16 Мб Сложность: 61%)
2-3 дерево — элегантная структура данных, изобретенная Джоном Хопкрофтом. Она предназначена для использования с той же целью, что и двоичное дерево поиска. 2-3 дерево представляет собой дерево с корнем, которое обладает следующими свойствами:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |6 1000000000        |2                   |
|2 |7 1000000000        |3                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_752 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}