package acmp;

/* acmp.ru   |   Задание №321
		Разные цифры
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Требуется написать программу, определяющую, в каких системах счисления с основаниями от 2 до 36 это число не содержит одинаковых цифр.

Входные данные
Входной файл INPUT.TXT содержит одно целое число N (1 ≤ N ≤ 10^9), записанное в десятичной системе счисления.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать основания систем счисления в порядке возрастания, разделенные одним пробелом.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |100                 |11 12 13 14 15 16 17 18 20 21 22 23 25 26 27 28 29 30 31 32 33 34 35 36|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_321 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}