package acmp;

/* acmp.ru   |   Задание №45
		Произведение цифр
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Требуется найти наименьшее натуральное число Q такое, что произведение его цифр равно заданному числу N.

Входные данные
В единственной строке входного файла INPUT.TXT записано одно целое число N (0 ≤ N ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести искомое число Q. В том случае, если такого числа не существует, следует вывести -1.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |10                  |25                  |
|2 |13                  |-1                  |
|3 |8                   |8                   |
|4 |90                  |259                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_045 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}