package acmp;

/* acmp.ru   |   Задание №375
		Системы счисления
(Время: 1 сек. Память: 16 Мб Сложность: 53%)
Дано целое неотрицательное число в I-ричной системе счисления. Требуется вывести это число в J-ричной системе счисления.

Входные данные
Входной файл INPUT.TXT в первой строке содержит два числа I и J (в десятичной системе счисления), во второй строке - число для перевода. Ограничения: 2 ≤ I, J ≤ 36, для представления цифр 10...35 используются прописные английские буквы A...Z соответственно, число разрядов исходного числа не превышает 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое число без лидирующих нулей.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |10 36               |HELLO               |
|1 |29234652            |                    |
|--|--------------------|--------------------|
|  |2 10                |13                  |
|2 |1101                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_375 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}