package acmp;

/* acmp.ru   |   Задание №348
		Пересечение отрезков
(Время: 1 сек. Память: 16 Мб Сложность: 49%)
Два отрезка на плоскости заданы целочисленными координатами своих концов в декартовой системе координат. Требуется определить, существует ли у них общая точка.

Входные данные
Входной файл INPUT.TXT содержит координаты четырех точек, задающих отрезки. В первой строке содержатся координаты первого конца первого отрезка , во второй - второго конца первого отрезка, в третьей и четвёртой - координаты концов второго отрезка. Все координаты – целые числа, не превосходящие 10000 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT следует вывести слово "Yes", если общая точка есть, или слово "No" - в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |0 0                 |Yes                 |
|  | 1 1                |                    |
|1 | 0 1                |                    |
|  | 1 0                |                    |
|--|--------------------|--------------------|
|  |0 0                 |No                  |
|  | 1 0                |                    |
|2 | 0 1                |                    |
|  | 1 1                |                    |
|--|--------------------|--------------------|
|  |0 0                 |Yes                 |
|  | 1 0                |                    |
|3 | 1 0                |                    |
|  | 1 1                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_348 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}