package acmp;

/* acmp.ru   |   Задание №662
		Green Darts
(Время: 1 сек. Память: 16 Мб Сложность: 75%)
В день рождения Вовы родители решили пригласить всех его друзей. После того, как ребята выпили сок и съели яблочный пирог, они решили поиграть в увлекательную игру Green Darts, правила которой достаточно просты:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |3                   |
|  | 1 99 1             |                    |
|1 | 100 100 100        |                    |
|  | 51 49 13           |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_662 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}