package acmp;

/* acmp.ru   |   Задание №802
		Магический квадрат
(Время: 1 сек. Память: 16 Мб Сложность: 70%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|1 |1                   |1                   |
|--|--------------------|--------------------|
|2 |2                   |Impossible          |
|--|--------------------|--------------------|
|  |3                   |4 9 2               |
|3 |                    |3 5 7               |
|  |                    |8 1 6               |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_802 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}