package acmp;

/* acmp.ru   |   Задание №917
		Забор - 3
(Время: 1 сек. Память: 16 Мб Сложность: 72%)
Однажды было принято решение о строительстве очередного небоскреба. Для ограждения территории были привезены прямоугольные бетонные блоки. Все блоки имеют одинаковую ширину, но могут быть различными по длине. Начальник стройки решил, во что бы то ни стало отгородить участок как можно большей площади, используя все имеющиеся в наличии блоки. Блоки должны соприкасаться друг с другом углами.

Входные данные
Первая строка входного файла INPUT.TXT содержит целое число N (3 ≤ N ≤ 100) – количество блоков. Во второй строке определены N целых чисел Li – длины блоков (1 ≤ Li ≤ 100). Гарантируется, что с использованием данных блоков возможно огородить ненулевую площадь.

Выходные данные
В выходной файл OUTPUT.TXT выведите с точностью, не худшей чем 10^-2, максимально возможную площадь территории, которую можно отгородить при помощи данного набора блоков. Шириной блоков можно пренебречь.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |6.00                |
|1 |3 4 5               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_917 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}