package acmp;

/* acmp.ru   |   Задание №845
		Гиганты
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
Астроному Василию по роду службы часто приходится иметь дело с невероятно большими числами. Очень часто такие числа приходится возводить в не менее огромные степени. К счастью, для предварительных расчетов Василию не понадобится весь результат расчетов – вполне хватит последней цифры.

Входные данные
Входной файл INPUT.TXT содержит два натуральных числа X и Y, не превосходящих 10^40.

Выходные данные
В выходной файл OUTPUT.TXT выведите последнюю цифру числа X^Y.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |7 3                 |3                   |
|2 |2 5                 |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_845 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}