package acmp;

/* acmp.ru   |   Задание №803
		Цифры после запятой
(Время: 1 сек. Память: 16 Мб Сложность: 26%)
По заданным натуральным числам A и B найти K-ю цифру после запятой в дроби A/B в десятичной системе счисления.

Входные данные
В единственной строке входного файла INPUT.TXT записано три натуральных числа A, B и K через пробел. А и B – цифры (числа от 1 до 9), число K не превышает 10^6.

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |7 4 2               |5                   |
|2 |1 6 13              |6                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_803 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}