package acmp;

/* acmp.ru   |   Задание №585
		Египетские знаки
(Время: 1 сек. Память: 16 Мб Сложность: 72%)
Прошлым летом школьник Вася побывал в Египте. И лишь сейчас он вспомнил, что во время своей поездки он успел сфотографировать много интересностей. Перебирая эти фотографии, больше всего он заинтересовался видами пирамид в Гизе. Пирамиды, помимо всяких иероглифов, содержали удивительные знаки - 1, 2, 3, 4, 5, 6, 7, 8, 9, 0. Внимательно присмотревшись Вася заметил, что каждая строка таких странных символов является степенью двойки и более того первая строка начинается последовательностью символов 1, вторая - 2, ..., сто двадцатая - 120, и т.д. Но все было бы хорошо, если бы Вася пользовался современными фотоаппаратами, поэтому его старенькая мыльница плохо сфотографировала наиболее освещенные части пирамиды, поэтому все символы разобрать невозможно и определить показатель степени двойки, соответствующий таким строкам, затруднительно.

Вася задумался о восстановлении символов и, наконец, решил попросить кого-нибудь написать программу (Вася учится в 6 классе и не знает языков программирования), которая бы определила показатель степени двойки, которая записана в N-ой строке.

Входные данные
Входной файл INPUT.TXT содержит единственное число N ≤ 10^7.

Выходные данные
В выходной файл OUTPUT.TXT выведите минимальное натуральное число K такое, что 2^K в десятичной записи начинается c числa N, или если Вася что-то напутал и такого числа нет - выведите -1.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |12                  |7                   |
|2 |134                 |27                  |
|3 |82                  |209                 |
----------------------------------------------

Пояснение
Пример №1: 2^7=128</p> <p class="text">Пример №2: 2^27=134217728



Решение.

*/


import java.util.Scanner;

public class acmp_585 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}