package acmp;

/* acmp.ru   |   Задание №218
		Шашки
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |.b.b.b.b            |
|  | c3-d4              | b.b.b.b.           |
|  | f6-e5              | .b.b.w.b           |
|  | d4:f6              | -.-.-.-.           |
|1 |                    | .-.-.-.-           |
|  |                    | w.-.w.w.           |
|  |                    | .w.w.w.w           |
|  |                    | w.w.w.w.           |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_218 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}