package acmp;

/* acmp.ru   |   Задание №107
		Красивые номера
(Время: 1 сек. Память: 16 Мб Сложность: 52%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |8727333             |8727-333            |
|1 |                    |5                   |
|--|--------------------|--------------------|
|  |8827291             |88-272-91           |
|2 |                    |4                   |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_107 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}