package acmp;

/* acmp.ru   |   Задание №147
		Числа Фибоначчи
(Время: 1 сек. Память: 16 Мб Сложность: 16%)
Последовательностью Фибоначчи называется последовательность чисел a0, a1, ..., an, ..., где<br>a0 = 0, a1 = 1, ak = ak-1 + ak-2 (k &gt; 1).

Требуется найти N-е число Фибоначчи.

Входные данные
Во входном файле INPUT.TXT записано целое число N (0 ≤ N ≤ 30).

Выходные данные
В выходной файл OUTPUT.TXT выведите N-е число Фибоначчи.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |7                   |13                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_147 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}