package acmp;

/* acmp.ru   |   Задание №303
		Цифры
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Составить программу, удаляющую одну цифру из N-значного числа, такую, чтобы плюс-минус сумма была наибольшей. Плюс-минус сумма – это сумма с чередованием цифр числа с разными знаками: для числа 764 это +7-6+4. Если удалить цифру 7, то будет +6-4=2, если удалить цифру 6, то будет +7-4=3, если удалить цифру 4, то будет +7-6=1. При этом видно, что максимум достигается при удалении средней цифры 6 и равен 3.

Входные данные
Во входном файле INPUT.TXT записано натуральное N-значное число (2 ≤ N ≤ 50).

Выходные данные
В выходной файл OUTPUT.TXT выведите значение наибольшей суммы.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |764                 |3                   |
|2 |6274861             |14                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_303 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}