package acmp;

/* acmp.ru   |   Задание №453
		Раз-два, раз-два
(Время: 1 сек. Память: 16 Мб Сложность: 49%)
Для заданного натурального числа N требуется найти число, состоящее только из цифр 1 и 2, которое делилось бы на 2^N.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N, не превосходящее 300.

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое число, состоящее не более чем из 10 000 цифр.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |2                   |
|2 |2                   |12                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_453 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}