package acmp;

/* acmp.ru   |   Задание №941
		Unix
(Время: 1 сек. Память: 16 Мб Сложность: 29%)
Наш любимый сисадмин Алексей установил новую ОС семейства Unix. Основные её особенности - это стабильность, надежность, гибкость и масштабируемость и огромное количество идущего в стандартной поставке программного обеспечения. Одна из таких встроенных программ предназначена для сложения чисел, представленных в троичной системе счисления. Вы понимаете то, что Костя - известный тестер, и делом чести для него является найти ошибку в реализации столь сложной задачи. Помогите ему - напишите свою, абсолютно безошибочную версию «троичного калькулятора».

Входные данные
Входной файл INPUT.TXT содержит два, разделенных пробелом, числа N и M (0 ≤ N, M ≤ 2^31-1) в троичной системе счисления.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ – сумму N и M в десятичной системе счисления.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1                 |2                   |
|2 |20 102              |17                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_941 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}