package acmp;

/* acmp.ru   |   Задание №922
		Незнайка
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Незнайка и его друзья собрались в космическое путешествие. Они уже и новый звездолет построили. Хоть он и построен был с учетом новых технологий, был у него один большой недостаток. После T1 часов полета, аккумуляторы требовали обязательной подзарядки от солнечной батареи в течении T2 часов, а конструкция звездолета такова, что его двигатель на время подзарядки останавливается и звездолет начинает двигаться в обратную сторону. Известно, что за T1 часов полета звездолет улетает на S1 км, а за T2 часов разрядки возвращается на S2 км. Движение в обратную сторону возможно только во время подзарядки.

Требуется определить: сколько потребуется времени для полета Незнайки и его друзей на различные планеты, если известно расстояние S до планет.

Входные данные
Входной файл INPUT.TXT содержит пять натуральных чисел, разделенных пробелами: T1, T2, S1, S2, S. Все числа не превышают 10^7.

Выходные данные
В выходной файл OUTPUT.TXT выведите время в часах (с точностью до двух знаков после запятой), за которое звездолет долетит до планеты. Если добраться до планеты не получится, то следует вывести «NO».

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5 3 5 3 4           |4.00                |
|2 |5 3 5 3 6           |12.00               |
|3 |5 1 3 3 6           |NO                  |
|4 |10 1 100 20 500     |65.00               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_922 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}