package acmp;

/* acmp.ru   |   Задание №910
		Последовательность - 4
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Бесконечная числовая последовательность задана с помощью формулы ее k-го члена:</p> <p class="text" style="font-size: 16pt">        Ak = k!*2^k, где k = 1, 2, 3,...

Найти сумму N первых членов этой последовательности. Так как найденная сумма может быть очень большой, выведите ее по модулю M.

Входные данные
Входной файл INPUT.TXT содержит два целых числа N - количество членов последовательности (1 ≤ N ≤ 10^4) и M - модуль (2 ≤ M ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите сумму N первых членов последовательности по модулю M.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5 10                |2                   |
|2 |10000 2             |0                   |
|3 |100 1000000000      |909349562           |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_910 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}