package acmp;

/* acmp.ru   |   Задание №306
		Танец
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
На городском празднике танцуют девушки в красных и синих юбках. Они двигаются цепочкой и выполняют сложный рисунок танца. Из цепочки девушки выделяются по одной. Первая становится на левом краю сцены, вторая уходит в конец исходной цепочки, третья – на левый край сцены (справа от первой), четвертая – в конец исходной цепочки и т.д., пока все девушки не выстроятся на краю сцены.

Помогите постановщику танца определить, каким должно быть исходное расположение девушек, если на краю сцены, они выстроены так, что их юбки чередуются по цвету (слева направо): синяя, красная, синяя, красная и т.д.

Входные данные
Во входном файле INPUT.TXT записано натуральное число N – количество танцующих девушек (N ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите строку, содержащую цепочку из N символов, состоящую из заглавных букв B и R, соответствующих цветам юбок – синему и красному.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |BR                  |
|2 |3                   |BBR                 |
|3 |4                   |BBRR                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_306 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}