package acmp;

/* acmp.ru   |   Задание №856
		Космический кегельбан
(Время: 2 сек. Память: 16 Мб Сложность: 53%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |500 4               |7                   |
|  | 1000               |                    |
|1 | -2 -2              |                    |
|  | 1 1                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_856 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}