package acmp;

/* acmp.ru   |   Задание №507
		Адронный коллайдер
(Время: 1 сек. Память: 16 Мб Сложность: 54%)
Внутри адронного коллайдера образовалось N разновидностей новых частиц в количестве A1, … ,AN единиц каждая. Большая часть новых частиц, однако, успевает прореагировать между собой раньше, чем эти частицы сможет уловить детектор, поэтому физикам очень важно предсказать конечный итог реакции между частицами.

Для простоты будем считать, что в реакции участвуют 2 частицы, с одним из следующих результатов, в зависимости от типа:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |3                   |
|  | 1 1 2              | 0 1 0              |
|1 | 0 0 1              | 0 0 1              |
|  | 1 0 0              | 1 0 0              |
|  | 1 1 1              |                    |
|--|--------------------|--------------------|
|  |1                   |1                   |
|2 | 2                  |2                   |
|  | 0                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_507 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}