package acmp;

/* acmp.ru   |   Задание №489
		Монеты
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
На столе лежат произвольным образом N сказочных монет: M1, M2, …, Mn. Ученик Паша проводит следующий эксперимент. Он K раз выполняет следующие действия: берет некоторую монету, переворачивает ее, кладет ее в произвольное свободное место на столе и записывает номинал этой монеты в протокол.

После этого Паша закрывает одну монету (любую) и предлагает Маше угадать номинал и верхнюю сторону закрытой монеты.

Маше доступны следующие исходные данные:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |8 7                 |1                   |
|  | 10 -5 1 50 1 100 -1 9 |                    |
|1 | -100 -10 -50 1 5 1 9|                    |
|  | 10 10 5 10 50 100 1|                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_489 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}