package acmp;

/* acmp.ru   |   Задание №978
		Последовательность - 5
(Время: 1 сек. Память: 16 Мб Сложность: 79%)
Пусть n – натуральное число. Обозначим как an максимальное натуральное число k, такое что n^k – делитель n!. Например, a12 = 5, так как 12^5 = 248832 делит 12! = 479001600 (479001600/248832 = 1925), а 12^6 = 2985984 – не делит.

Задано число n. Найдите an.

Входные данные
Входной файл INPUT.TXT содержит натуральное число n (2 ≤ n ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите единственное число an.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |12                  |5                   |
|2 |45                  |10                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_978 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}