package acmp;

/* acmp.ru   |   Задание №751
		Money, money, money
(Время: 1 сек. Память: 16 Мб Сложность: 31%)
Правительство Флатландии решило провести реформу денежной системы. Цель реформы – радикально уменьшить число банкнот в обращении, в результате их должно остаться ровно две. Таким образом, после реформы во Флатландии будут циркулировать банкноты достоинством a тугриков и b тугриков, где a и b поручено выбрать министерству финансов.

Одна из проблем заключается в том, что президент Флатландии ненавидит число x. Поэтому министр финансов решил, что выберет такие a и b, что нельзя будет заплатить ровно x тугриков без сдачи. С другой стороны, для любой суммы большей x должна быть возможность заплатить ее без сдачи.

Итак, вам поручено выбрать соответствующие a и b.

Входные данные
Входной файл INPUT.TXT содержит натуральное число x, не превосходящее 10^12.

Выходные данные
В выходной файл OUTPUT.TXT выведите два целых числа a и b такие, что сумму в x тугриков нельзя заплатить банкнотами в a и b тугриков без сдачи, а любую большую сумму – можно. Если решения не существует, выведите в выходной файл два нуля.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |2 5                 |
|2 |4                   |0 0                 |
|3 |5                   |3 4                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_751 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}