package acmp;

/* acmp.ru   |   Задание №943
		Змейка - 3
(Время: 1 сек. Память: 16 Мб Сложность: 16%)
Напишите программу, которая выводит элемент из строки Y и столбца X матрицы размера N&times;M, которая заполнена следующим образом:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 4 2 3             |5                   |
|2 |5 2 3 1             |4                   |
|3 |3 4 3 2             |9                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_943 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}