package acmp;

/* acmp.ru   |   Задание №372
		Скобки - 2
(Время: 1 сек. Память: 16 Мб Сложность: 52%)
Вывести все правильные скобочные выражения длиной N, состоящие из круглых и квадратных скобок.

Входные данные
Входной файл INPUT.TXT содержит единственное четное натуральное число N, не превышающее 14.

Выходные данные
В выходной файл OUTPUT.TXT выведите всевозможные правильные скобочные выражения по одному в каждой строке в произвольном порядке.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |()                  |
|1 |                    | []                 |
|--|--------------------|--------------------|
|  |4                   |(())                |
|  |                    | [[]]               |
|  |                    | [()]               |
|  |                    | ()[]               |
|2 |                    | []()               |
|  |                    | ()()               |
|  |                    | ([])               |
|  |                    | [][]               |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_372 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}