package acmp;

/* acmp.ru   |   Задание №197
		Змейка
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
<img src="/asp/article/image.asp?id=212" alt="Змейка" align="right"> Требуется заполнить змейкой квадратную матрицу так, как показано на рисунке справа: заполнение происходит с единицы из левого верхнего угла и заканчивается в правом нижнем числом N^2, где N – порядок матрицы.

Входные данные
Во входном файле INPUT.TXT задано натуральное число N – размер квадратной матрицы (N ≤ 100).

Выходные данные
В выходной файл OUTPUT.TXT выведите матрицу, заполненную числами от 1 до N^2 змейкой, при этом между числами может быть любое количество пробелов.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |1 &nbsp;3 &nbsp;4 10|
|  |                    | 2 &nbsp;5&nbsp; 9 11|
|1 |                    | 6&nbsp; 8 12 15    |
|  |                    | 7 13 14 16         |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_197 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}