package acmp;

/* acmp.ru   |   Задание №297
		Кругляши
(Время: 1 сек. Память: 16 Мб Сложность: 16%)
Однажды в просторах рунета появился следующий ребус:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |157892              |3                   |
|2 |203516              |2                   |
|3 |409578              |4                   |
|4 |236271              |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_297 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}