package acmp;

/* acmp.ru   |   Задание №781
		Две цифры
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Сколько N-значных чисел можно составить, используя цифры 5 и 9, в которых три одинаковые цифры не стоят рядом?

Входные данные
Во входном файле INPUT.TXT записано число N (1 ≤ N ≤ 30).

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести одно число - количество чисел с указанным свойством.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |6                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_781 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}