package acmp;

/* acmp.ru   |   Задание №849
		Задача про ферзей
(Время: 2 сек. Память: 16 Мб Сложность: 54%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |8                   |7 2                 |
|  |                    | 2 6                |
|  |                    | 3 8                |
|  |                    | 1 3                |
|1 |                    | 4 1                |
|  |                    | 6 7                |
|  |                    | 8 4                |
|  |                    | 5 5                |
|--|--------------------|--------------------|
|2 |2                   |No solution         |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_849 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}