package acmp;

/* acmp.ru   |   Задание №722
		Шоколадки
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
Рома играет сам с собой в очень интересную игру. Для нее нужна коробка конфет, в которой конфеты расположены прямоугольником n&times;m штук. В игре участвуют конфеты из темного и белого шоколада. Сначала коробка заполняется конфетами произвольным образом. Далее Рома повторяет следующие операции. Он находит три конфеты одного цвета, лежащие рядом (в ряд, или в виде буквы «Г»), съедает их и заполняет освободившиеся места новыми конфетами произвольным образом. Если же он не находит трех конфет одного цвета, лежащих рядом, то игра заканчивается.

Посчитайте, сколько различных комбинаций может остаться на доске (то есть, в коробке) после окончания игры. Например, если n = 2, m = 3, то может остаться восемь различных комбинаций:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 3                 |8                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_722 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}