package acmp;

/* acmp.ru   |   Задание №79
		Последняя цифра A^B
(Время: 1 сек. Память: 16 Мб Сложность: 21%)
Требуется написать программу, которая находит цифру, на которую оканчивается число A^B.

Входные данные
Входной файл INPUT.TXT состоит из единственной строки, содержащей два целых числа A и B, разделенных пробелом (1 ≤ A,B ≤ 10000).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести цифру, на которую оканчивается A^B.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 2                 |4                   |
|2 |3 7                 |7                   |
|3 |24 9                |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_79 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}