package acmp;

/* acmp.ru   |   Задание №713
		Булева функция
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
Недавно на уроке информатики ученики одного из классов изучили булевы функции. Напомним, что булева функция f сопоставляет значениям двух булевых аргументов, каждый из которых может быть равен 0 или 1, третье булево значение, называемое результатом. Для учеников, которые выразили желание более подробно изучать эту тему, учительница информатики на дополнительном уроке ввела в рассмотрение понятие цепного вычисления булевой функции f.

Если задана булева функция f и набор из N булевых значений a1, a2, ..., aN , то результат цепного вычисления этой булевой функции определяется следующим образом:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |1011                |
|1 |0110                |                    |
|--|--------------------|--------------------|
|  |5                   |11111               |
|2 |0100                |                    |
|--|--------------------|--------------------|
|  |6                   |No solution         |
|3 |0000                |                    |
|--|--------------------|--------------------|
----------------------------------------------

Пояснение
В первом примере процесс вычисления цепного значения булевой функции f происходит следующим образом: 1011 &#x2192; 111 &#x2192; 01 &#x2192; 1.</p> <p class="text">Во втором примере вычисление цепного значения булевой функции f происходит следующим образом: 11111 &#x2192; 0111 &#x2192; 111 &#x2192; 01 &#x2192; 1.</p> <p class="text">В третьем примере получить цепное значение булевой функции f, равное 1, невозможно.



Решение.

*/


import java.util.Scanner;

public class acmp_713 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}