package acmp;

/* acmp.ru   |   Задание №908
		Число - 3
(Время: 2 сек. Память: 64 Мб Сложность: 35%)
Дано натуральное число N. Над ним можно произвести следующий набор операций:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5                   |3                   |
|2 |1                   |0                   |
|3 |10                  |3                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_908 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}