package acmp;

/* acmp.ru   |   Задание №384
		Числа Фибоначчи - 3
(Время: 1 сек. Память: 16 Мб Сложность: 52%)
Последовательностью Фибоначчи называется последовательность чисел F0 = 0, F1 = 1, … , Fk = Fk-1 + Fk-2 (k &gt; 1).

Требуется найти наибольший общий делитель двух чисел Фибоначчи.

Входные данные
Во входном файле INPUT.TXT записаны два целых числа i и j (1 ≤ i, j ≤ 10^6).

Выходные данные
В выходной файл OUTPUT.TXT выведите остаток от деления НОД чисел Fi и Fj на 10^9.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5 10                |5                   |
|2 |2 4                 |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_384 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}