package acmp;

/* acmp.ru   |   Задание №448
		Простые гири
(Время: 1 сек. Память: 16 Мб Сложность: 54%)
Имеются гири с массами: 1 г, 2 г, …, N г .Требуется написать программу, распределяющую эти гири на максимально возможное количество пар так, чтобы суммарный вес гирь в каждой паре выражался простым числом.

Входные данные
Входной файл INPUT.TXT содержит единственное натуральное число N, не превосходящее 500 000.

Выходные данные
В выходной файл OUTPUT.TXT выведите список найденных пар. Каждая пара выводится в одной строке через пробел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |7                   |1 6                 |
|1 |                    | 7 4                |
|  |                    | 5 2                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_448 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}