package acmp;

/* acmp.ru   |   Задание №277
		Школьная алгебра
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Трёхчлен a + bx + сy от двух переменных x и y однозначно определяется коэффициентами a, b и c. Написать программу, которая по заданным a, b и c выводит соответствующий трёхчлен, записанный с использованием алгебраических соглашений:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |0 2 -1              |2x-y                |
|2 |3 0 -2              |3-2y                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_277 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}