package acmp;

/* acmp.ru   |   Задание №221
		Левый лабиринт
(Время: 1 сек. Память: 16 Мб Сложность: 57%)
В спортзале размером N&times;M метров построили современный аттракцион под названием "Левый лабиринт". Для этого на полу спортзала с интервалом в 1 метр начертили линии, параллельные стенам спортзала. Таким образом, спортзал разбили на N&times;M клеток. Дальше некоторые из этих клеток покрасили в черный цвет. Аттракцион заключается в том, что участника ставят в некоторой клетке спортзала и просят как можно быстрее добежать до некоторой другой клетки. При этом накладываются следующие условия:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1 5 5               |12                  |
|  | 2 0 0 1 1          |                    |
|  | 0 1 0 0 1          |                    |
|1 | 1 1 0 0 1          |                    |
|  | 0 0 0 0 1          |                    |
|  | 3 1 0 0 1          |                    |
|--|--------------------|--------------------|
|  |0 1 3               |-1                  |
|2 | 2 1 3              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_221 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}