package acmp;

/* acmp.ru   |   Задание №544
		Мячик на лестнице
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
На вершине лесенки, содержащей N ступенек, находится мячик, который начинает прыгать по ним вниз, к основанию. Мячик может прыгнуть на следующую ступеньку, на ступеньку через одну или через две. То есть, если мячик лежит на 8-ой ступеньке, то он может переместиться на 5-ую, 6-ую или 7-ую.

Требуется написать программу, которая определит число всевозможных "маршрутов" мячика с вершины на землю.

Входные данные
Входной файл INPUT.TXT содержит число N (0 &lt; N ≤ 70).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать искомое число.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |4                   |7                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_544 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}