package acmp;

/* acmp.ru   |   Задание №85
		Единичный НОД
(Время: 1 сек. Память: 16 Мб Сложность: 23%)
Заданы два натуральных числа в десятичной системе счисления, состоящие из единиц. В первом числе ровно N единиц, а во втором их ровно M. Требуется найти НОД этих чисел.

Напомним, что НОД (наибольший общий делитель) двух чисел a и b — это такое максимальное число c, что b делится на c и a делится на c.

Входные данные
В единственной строке входного файла INPUT.TXT записаны два целых числа N и M (1 ≤ N, M ≤ 2000).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ без ведущих нулей.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1                 |1                   |
|2 |1 2                 |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_85 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}