package acmp;

/* acmp.ru   |   Задание №584
		Спираль - 2
(Время: 1 сек. Память: 16 Мб Сложность: 59%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |6 7                 |31                  |
|  |                    | f 6                |
|  |                    | r                  |
|  |                    | f 7                |
|  |                    | r                  |
|  |                    | f 6                |
|  |                    | r                  |
|  |                    | f 5                |
|  |                    | r                  |
|  |                    | f 4                |
|  |                    | r                  |
|  |                    | f 3                |
|  |                    | r                  |
|  |                    | f 2                |
|  |                    | r                  |
|  |                    | f 1                |
|1 |                    | r                  |
|  |                    | f 1                |
|  |                    | l                  |
|  |                    | f 1                |
|  |                    | l                  |
|  |                    | f 2                |
|  |                    | l                  |
|  |                    | f 3                |
|  |                    | l                  |
|  |                    | f 4                |
|  |                    | l                  |
|  |                    | f 5                |
|  |                    | l                  |
|  |                    | f 5                |
|  |                    | r                  |
|  |                    | f 1                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_584 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}