package acmp;

/* acmp.ru   |   Задание №351
		Прыжки по буквам
(Время: 1 сек. Память: 16 Мб Сложность: 56%)
Дана цепочка из N символов, состоящая из прописных английских букв. Необходимо пройти с первого символа цепочки до последнего символа, прыгая не более чем на K символов. Стоимость прыжка, при котором символ не меняется, равна 0, а стоимость прыжка на другой символ равна 1.

Требуется написать программу, которая вычислит наименьшую стоимость перехода с первого на последний символ.

Входные данные
Входной файл INPUT.TXT содержит в первой строке два целых числа: длина цепочки N (2 ≤ N ≤ 10^5) и максимальная длина прыжка K (1 ≤ K &lt; N). Во второй строке содержится цепочка из N английских букв.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно число – минимальную стоимость перехода.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |10 2                |2                   |
|1 |ABABBCACBC          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_351 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}