package acmp;

/* acmp.ru   |   Задание №974
		Странный ним
(Время: 1 сек. Память: 16 Мб Сложность: 65%)
Алиса и Боб играют в игру, которую они называют «странный ним». На столе расположены три кучки камней, содержащие a, b и c камней, соответственно. Алиса ходит первой.

Тот игрок, который делает ход, выбирает одну из кучек и берет из нее несколько камней. При этом должно выполняться следующее условие: после хода каждого игрока на столе не должно быть двух кучек, содержащих равное количество камней. Забирать все камни из кучки разрешается. Тот, кто берет последний камень, выигрывает.

Пусть, например, кучки содержат 1, 3 и 5 камней, тогда разрешены следующие ходы:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1 2 3               |Alice wins the game.|
|1 |1 3 5               |Bob wins the game.  |
|  |0 0 0               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_974 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}