package acmp;

/* acmp.ru   |   Задание №191
		Гладкие числа
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
Назовем число <i>гладким</i>, если его цифры, начиная со старшего разряда, образуют неубывающую последовательность. Упорядочим все такие числа в возрастающем порядке и присвоим каждому номер.

Вам требуется по номеру N вывести N-ое гладкое число.

Входные данные
Во входном файле INPUT.TXT содержится номер N (1 ≤ N ≤ 2147483647).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать искомое N-е гладкое число.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |11                  |12                  |
|3 |239                 |1135                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_191 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}