package acmp;

/* acmp.ru   |   Задание №677
		Количество участников олимпиады
(Время: 1 сек. Память: 16 Мб Сложность: 29%)
Как известно, на вопрос о том, сколько у него учеников, древнегреческий учёный Пифагор отвечал так: "Половина моих учеников изучает математику, четвертая часть изучает природу, седьмая часть проводит время в молчаливом размышлении, остальную часть составляют 3 девы".

Секретарь олимпиады на вопрос: "Сколько участников на олимпиаде по информатике?", отвечал подобно Пифагору: "K-тая часть участников начала решать первую задачу, M-тая часть – вторую, а N-тая – третью. В то же время D участников решают проблему: "С чего начать?". Ваша задача определить количество участников олимпиады или вывести -1, если секретарь ошибся.

Входные данные
В единственной строке входного файла INPUT.TXT записаны числа K, N, M, D (1 ≤ K, N, M, D ≤ 100).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно число - количество участников олимпиады или вывести -1, если секретарь ошибся.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 4 7 3             |28                  |
|2 |2 2 2 3             |-1                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_677 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}