package acmp;

/* acmp.ru   |   Задание №171
		Количество делителей
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Пусть х — натуральное число. Назовем у его делителем, если 1 ≤ у ≤ х и остаток от деления х на у равен нулю.

Задано число х. Найдите количество его делителей.

Входные данные
Входной файл INPUT.TXT содержит заданное число x (1 ≤ x ≤ 10^18). Все простые делители числа x не превосходят 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |12                  |6                   |
|2 |239                 |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_171 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}