package acmp;

/* acmp.ru   |   Задание №976
		Сумма или произведение
(Время: 1 сек. Память: 16 Мб Сложность: 74%)
Федя недавно начал учиться математике. Он научился складывать и умножать и был немедленно потрясен фактом, что 2 + 2 = 2 x 2. Теперь он хочет найти еще примеры таких соотношений.

Петя называет набор чисел интересным, если произведение чисел из этого набора равно их сумме. Например, наборы {2, 2}, {5}, {1, 2, 3} – интересные, а набор {2, 3} – нет.

По заданному N, Федя хочет найти количество интересных наборов, содержащих N чисел. Помогите ему! сел из этого набора равно их сумме. Например, наборы {2, 2}, {5}, {1, 2, 3} – интересные, а набор {2, 3} – нет.

Входные данные
Первая строка входного файла INPUT.TXT содержит N (2 ≤ N ≤ 500).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число – количество интересных наборов, содержащих N чисел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |1                   |
|2 |5                   |3                   |
----------------------------------------------

Пояснение
Во втором примере интересные наборы следующие: {1, 1, 1, 2, 5}, {1, 1, 1, 3, 3} и {1, 1, 2, 2, 2}.



Решение.

*/


import java.util.Scanner;

public class acmp_976 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}