package acmp;

/* acmp.ru   |   Задание №398
		Сумма - 2
(Время: 1 сек. Память: 16 Мб Сложность: 30%)
Задано натуральное число x. Найдите число способов представить его в виде суммы четырех натуральных чисел: x = a + b + c + d, где a ≤ b ≤ c ≤ d.

Входные данные
Входной файл INPUT.TXT содержит целое число x (1 ≤ x ≤ 1500).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |0                   |
|2 |5                   |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_398 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}