package acmp;

/* acmp.ru   |   Задание №782
		Турнир
(Время: 1 сек. Память: 16 Мб Сложность: 29%)
Турнир проходит по олимпийской системе. В каждом матче участвуют два игрока. Проигравший игрок выбывает из турнира, а победитель проходит в следующий тур. Матчи продолжаются до тех пор, пока в турнире не останется один участник, который становится обладателем золотой медали. Серебро достаётся его оппоненту в финальном матче. Если количество участников больше трёх, то назначается дополнительный матч для определения бронзового победителя. В нём участвуют два игрока, выбывшие из турнира последними, не считая финалистов.

Напишите программу определения минимального количества матчей, которые необходимо сыграть участникам турнира, чтобы определить из них тех, кто получит медали.

Входные данные
Во входном файле INPUT.TXT записано одно целое число N (0 ≤ N ≤ 2147483647) – количество участников турнира.

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести одно число - минимальное количество матчей в этом турнире.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |2                   |
|2 |4                   |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_782 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}