package acmp;

/* acmp.ru   |   Задание №588
		Число
(Время: 1 сек. Память: 16 Мб Сложность: 39%)
Скажем, что число в b-ой системе счисления описывает себя, если оно - b-значное, его первая цифра равна числу единиц в нем, вторая цифра равна числу двоек, и т.д., b-1-ая цифра равна числу цифр b-1, а последняя цифра равна числу нулей. Примером такого числа для b = 5 является 12002.

Задано число b. Требуется найти число в системе счисления по основанию b, которое описывает себя.

Входные данные
Входной файл INPUT.TXT содержит единственное целое число b (2 ≤ b ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите любое описывающее себя число в системе счисления с основанием b, или -1, если такого числа не существует. Каждую цифру числа выводите на отдельной строке в десятичной записи.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |1                   |
|  |                    | 2                  |
|1 |                    | 0                  |
|  |                    | 0                  |
|  |                    | 2                  |
|--|--------------------|--------------------|
|2 |2                   |-1                  |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_588 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}