package acmp;

/* acmp.ru   |   Задание №901
		Бессмыслица
(Время: 1 сек. Память: 16 Мб Сложность: 67%)
Никифор утверждал, что бессмыслица, повторенная много раз, становится истиной. Для доказательства этого он применил следующую процедуру: переставил на клавиатуре своего компьютера клавиши в произвольном порядке и набрал некоторый текст. Получилась, естественно, бессмыслица. Он и эту бессмыслицу набрал на том же компьютере с той же подправленной клавиатурой. Новую бессмыслицу Никифор набрал еще раз и так далее – времени-то у него много.

Требуется написать программу, которая найдет максимальное количество шагов его процедуры, чтобы получился исходный текст.

Входные данные
Входной файл INPUT.TXT содержит одно целое число N (1 &lt; N &lt; 60) – количество клавиш на клавиатуре компьютера Никифора.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – максимальное количество шагов проделанной Никифором процедуры.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4                   |4                   |
|2 |5                   |6                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_901 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}