package acmp;

/* acmp.ru   |   Задание №682
		Сумма n-значных чисел
(Время: 1 сек. Память: 16 Мб Сложность: 30%)
По заданному n найти сумму всех n-значных чисел.



Входные данные
В единственной строке входного файла INPUT.TXT записано одно натуральное число n (1 ≤ n ≤ 100).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести все цифры суммы всех n-значных чисел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |45                  |
|2 |2                   |4905                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_682 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}