package acmp;

/* acmp.ru   |   Задание №906
		Функция - 2
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
Описана рекурсивная функции с тремя параметрами F(a, b, c):

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1 1               |2                   |
|2 |2 2 2               |4                   |
|3 |10 4 6              |523                 |
|4 |50 50 50            |1048576             |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_906 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}