package acmp;

/* acmp.ru   |   Задание №276
		Разбиение на части
(Время: 1 сек. Память: 16 Мб Сложность: 21%)
Необходимо представить целое число N в виде суммы M примерно равных целых чисел. Будем считать, что числа примерно равны, если они отличаются друг от друга не более чем на единицу.

Входные данные
Во входном файле INPUT.TXT записаны два натуральных числа N и M через пробел, каждое из которых не превосходит 30000.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать M примерно равных целых чисел, сумма которых должна быть равна N. Все числа следует вывести в одной строке в порядке неубывания через пробел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |13 4                |3 3 3 4             |
|2 |72 8                |9 9 9 9 9 9 9 9     |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_276 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}