package acmp;

/* acmp.ru   |   Задание №378
		Суммы
(Время: 1 сек. Память: 16 Мб Сложность: 47%)
Дано N целых чисел A1, A2, ..., AN. Требуется найти количество различных значений сумм вида k1A1 + k2A2 + ... + kNAN.

Входные данные
Входной файл INPUT.TXT в первой строке содержит число N, во второй - A1, A2, ..., AN через пробел. Ограничения: все числа целые, 1 ≤ N ≤ 500, 0 ≤ Ai ≤100, 0 ≤ ki ≤ 1.

Выходные данные
В выходной файл OUTPUT.TXT выведите количество различных значений сумм.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |5                   |
|1 |1 1 2               |                    |
|--|--------------------|--------------------|
|  |3                   |7                   |
|2 |1 3 2               |                    |
|--|--------------------|--------------------|
|  |5                   |10                  |
|3 |49 100 98 49 0      |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_378 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}