package acmp;

/* acmp.ru   |   Задание №807
		Игра с графом
(Время: 1 сек. Память: 16 Мб Сложность: 83%)
Петя и Вася играют в очередную интересную игру. У них есть лист бумаги, на котором изображены n кружочков, помеченных числами от 1 до n. Участники по очереди рисуют стрелочки, соединяющие кружочки. При этом стрелочку из кружочка a в кружочек b разрешено проводить, если выполнены два условия:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |25                  |
----------------------------------------------

Примечание
Приведем все 25 возможных позиций для примера из условия:</p> <p class="text"><img src="/asp/article/image.asp?id=398">



Решение.

*/


import java.util.Scanner;

public class acmp_807 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}