package acmp;

/* acmp.ru   |   Задание №522
		Похожие массивы
(Время: 0,5 сек. Память: 16 Мб Сложность: 25%)
Два массива называются похожими, если совпадают множества чисел, встречающихся в этих массивах.

Требуется написать программу, которая определит: похожи ли два заданных массива.

Входные данные
Входной файл INPUT.TXT содержит в первой строке два числа M и N - длины массивов (1 ≤ M, N ≤ 16000). Во второй строке записаны M чисел – элементы первого массива. В третьей строке записаны N чисел – элементы второго массива. Числа в строках разделены пробелами, элементы массивов - целые числа, не превышающие 32000 по абсолютной величине.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать 1, если массивы похожи и 0 иначе.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4 3                 |1                   |
|1 | 1 2 3 2            |                    |
|  | 1 2 3              |                    |
|--|--------------------|--------------------|
|  |2 3                 |0                   |
|2 | 1 2                |                    |
|  | 2 3 1              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_522 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}