package acmp;

/* acmp.ru   |   Задание №607
		Домино в казино
(Время: 1 сек. Память: 16 Мб Сложность: 72%)
Домино известно в качестве игры, в которую люди обычно играют во дворе, чтобы расслабиться после рабочего дня. Но так было лишь до того времени, пока Джон Бигбак не предоставил возможность играть в домино в своем казино «BUMP» (Bring Us Money, Please).

Обычная игра в домино не совсем подходит для казино, поэтому Джон создал свою собственную игру. Партия играется на прямоугольной доске размера m_n. В каждой ее клетке записано некоторое целое число.

У игрока есть k костей домино - прямоугольников 2&times;1. Он кладет их на доску так, чтобы не возникало наложений, и его выигрыш вычисляется как сумма произведений чисел, накрытых каждой из костей домино.

Например, существует два способа положить две кости домино на доску размера 2&times;2. Для доски, приведенной ниже, лучший способ положить домино показан слева - в этом случае сумма составляет 1&times;3 + 4&times;2 = 11. Если игрок выберет способ, показанный справа, то сумма составит 1&times;4 + 3&times;2 = 10, что меньше чем 11.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2 2 2               |11                  |
|1 |1 4                 |                    |
|  |3 2                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_607 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}