package acmp;

/* acmp.ru   |   Задание №517
		Боулинг
(Время: 1 сек. Память: 16 Мб Сложность: 29%)
Цель при игре в боулинг – сбить шаром максимальное количество кеглей. Партия в этой игре состоит из 10 туров. Задача игрока – сбить все 10 кеглей в каждом туре. Для этого игрок может совершить 2 броска шара, за исключением:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |12                  |300                 |
|1 | 10 10 10 10 10 10 10 10 10 10 10 10|                    |
|--|--------------------|--------------------|
|  |20                  |0                   |
|2 | 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0|                    |
|--|--------------------|--------------------|
|  |15                  |173                 |
|3 | 10 10 10 8 2 10 3 4 8 2 4 5 10 4 5|                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_517 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}