package acmp;

/* acmp.ru   |   Задание №383
		Красивые числа - 2
(Время: 1 сек. Память: 16 Мб Сложность: 26%)
Будем называть число красивым, если сумма его цифр в десятичной системе счисления делится на количество цифр в нем (в десятичной системе счисления).

Необходимо найти N-ое в порядке возрастания красивое число.

Входные данные
Входной файл INPUT.TXT содержит целое число N. (1 ≤ N ≤ 100 000)

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |15                  |20                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_383 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}