package acmp;

/* acmp.ru   |   Задание №352
		Дробь
(Время: 1 сек. Память: 16 Мб Сложность: 39%)
Вася учится в третьем классе и сейчас он проходит тему «Простые дроби с натуральными числителем и знаменателем». Оказывается, что дробь называется правильной, если ее числитель меньше знаменателя, и несократимой, если числитель и знаменатель являются взаимно простыми. Вася очень любит математику и поэтому дома он решает много задач. В данный момент Вася ищет наибольшую правильную несократимую дробь, у которой сумма числителя и знаменателя равна N.

Требуется написать программу, которая поможет Васе решить эту задачу.

Входные данные
Входной файл INPUT.TXT содержит одно целое число N (3 ≤ N ≤ 2&#x2219;10^9).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать два числа – числитель и знаменатель найденной дроби, разделенные пробелом.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |1 2                 |
|2 |10                  |3 7                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_352 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}