package acmp;

/* acmp.ru   |   Задание №416
		Шахматный конь
(Время: 1 сек. Память: 16 Мб Сложность: 25%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |e2                  |c1                  |
|  |                    | c3                 |
|  |                    | d4                 |
|1 |                    | f4                 |
|  |                    | g1                 |
|  |                    | g3                 |
|--|--------------------|--------------------|
|  |a1                  |b3                  |
|2 |                    |c2                  |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_416 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}