package acmp;

/* acmp.ru   |   Задание №672
		N-значные числа
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
Найти количество N-значных чисел, у которых сумма цифр равна их произведению. Вывести наименьшее среди таких чисел для заданного N.

Входные данные
В единственной строке входного файла INPUT.TXT записано одно натуральное число N, которое не превышает 10.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести через пробел 2 числа: количество искомых чисел и наименьшее среди них.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |10 0                |
|2 |2                   |1 22                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_672 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}