package acmp;

/* acmp.ru   |   Задание №693
		Перестановка
(Время: 1 сек. Память: 16 Мб Сложность: 24%)
Если Вы читали Гарри Поттера, то знаете, что повелитель зла, Лорд Волдеморт создал свое имя путем перестановки букв в своем настоящем имени. Так из имени «Tom Marvolo Riddle» он получил «I am Lord Voldemort».

Напишите программу, которая проверяет, можно ли получить из одного имени другое путем перестановки его букв. При этом регистром букв нужно пренебречь.

Входные данные
В первой строке входного файла INPUT.TXT записаны два слова, разделенные единственным в строке пробелом. Слова содержат только символы английского алфавита. Длина слов больше 0 и не превышает 50 символов.

Выходные данные
В выходной файл OUTPUT.TXT выведите «Yes», если возможно получить из одного имени другое, и «No» в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |TomMarvoloRiddle IamLordVoldemort|Yes                 |
|2 |stop pots           |Yes                 |
|3 |abbc bac            |No                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_693 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}