package acmp;

/* acmp.ru   |   Задание №20
		Пилообразная последовательность
(Время: 2 сек. Память: 128 Мб Сложность: 38%)
Последовательность a1, a2, a3, … , an-1, an называется пилообразной, если она удовлетворяет одному из следующих условий:<br>

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |2                   |
|1 | 1 2 3              |                    |
|--|--------------------|--------------------|
|  |12                  |7                   |
|2 | 5 7 6 3 4 2 7 1 8 9 4 5|                    |
|--|--------------------|--------------------|
|  |5                   |5                   |
|3 | 1 -2 3 -4 5        |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_020 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}