package acmp;

/* acmp.ru   |   Задание №463
		Остаток
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
Дано натуральное число n в k-ичной системе счисления.

Требуется написать программу, которая находит остаток от деления этого числа на заданное натуральное число m.

Входные данные
Входной файл INPUT.TXT содержит в первой строке натуральные числа k и m (2 ≤ k ≤ 36, m ≤ 32767), записанные через пробел. Во второй строке задается натуральное число n в k-ой системе счисления, состоящее не более чем из 10000 цифр. Числа k и m записываются в десятичной системе счисления. Для записи цифр числа в системе счисления с основанием, большим 10, используются английские заглавные буквы (10 – A, 11 – B, …, 35 – Z).

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое число, записанное в десятичной системе счисления.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |10 2                |1                   |
|1 |17                  |                    |
|--|--------------------|--------------------|
|  |16 35               |23                  |
|2 |7DF99               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_463 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}