package acmp;

/* acmp.ru   |   Задание №805
		Атака инопланетян
(Время: 1 сек. Память: 16 Мб Сложность: 36%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |4.500               |
|  | 2 4 6              |                    |
|1 | 4 2 7              |                    |
|  | 3 3 5              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_805 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}