package acmp;

/* acmp.ru   |   Задание №758
		Веревочный мост
(Время: 1 сек. Память: 16 Мб Сложность: 58%)
Однажды N путешественников решили ночью пересечь по веревочному мосту быструю горную речку. Без освещения перейти мост невозможно. К счастью, у одного из них оказался с собой фонарик. Известно, что мост выдерживает только двоих, а скорости людей могут различаться. Если мост пересекают два человека с разной скоростью, то они вынуждены двигаться со скоростью самого медленного из них. Скорость движения каждого из путников известна.

Помогите путешественникам как можно быстрее перебраться через мост. Требуется написать программу, определяющую минимальное время, которое потребуется для такого перехода. Например, если N=4, а время, требуемое для перехода по мосту для каждого, составляет 5, 10, 20 и 25 минут соответственно, то наименьшее время, требуемое для пересечения моста, составит ровно 60 минут.

Входные данные
В первой строке входного файла INPUT.TXT содержится натуральное число N – количество путешественников (N ≤ 10^5). Во второй строке располагаются N натуральных чисел – скорости всех путников, разделенные пробелом и не превосходящие 10^6. Здесь под скоростью человека понимается время в минутах, необходимое для перехода через мост.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – минимально возможное время, необходимое путникам для пересечения моста.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |20                  |
|1 |10 20               |                    |
|--|--------------------|--------------------|
|  |4                   |60                  |
|2 |5 10 20 25          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_758 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}