package acmp;

/* acmp.ru   |   Задание №810
		Число - 2
(Время: 1 сек. Память: 16 Мб Сложность: 58%)
По заданным числам a, b, c и d, найдите наименьшее натуральное число n, большее a&#x2219;c, которое нельзя представить в виде произведения двух натуральных чисел u и v, таких, что a ≤ u ≤ b и c ≤ v ≤ d.



Входные данные
Входной файл INPUT.TXT содержит одну строку, состоящую из натуральных чисел a, b, c, d (1 ≤ a ≤ b ≤ 10^6, 1 ≤ c ≤ d ≤ 10^6).

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое число n.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 2 1 2             |3                   |
|2 |1 2 3 5             |7                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_810 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}