package acmp;

/* acmp.ru   |   Задание №996
		Забавная последовательность
(Время: 1 сек. Память: 16 Мб Сложность: 26%)
Определим последовательность ai следующим образом: a1 = 1, an = an-1+ 3, если число n уже встречалось в последовательности a, и an = an-1 + 2, иначе. Нетрудно видеть, что первые 8 членов этой последовательности таковы: 1, 3, 6, 8, 10, 13, 15, 18.

Ваша задача вычислить an.

Входные данные
Входной файл INPUT.TXT содержит целое число n (1 ≤ n ≤ 10^5).

Выходные данные
В выходной файл OUTPUT.TXT выведите an.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |8                   |18                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_996 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}