package acmp;

/* acmp.ru   |   Задание №914
		Пересечение
(Время: 1 сек. Память: 16 Мб Сложность: 79%)
В трехмерном пространстве заданы два прямоугольных параллелепипеда. Необходимо определить: пересекаются ли они?

Входные данные
Входной файл INPUT.TXT содержит два блока по четыре строки, содержащие описание первого и второго параллелепипеда. В первой строке блока находятся координаты одной из вершин параллелепипеда x, y и z, разделенные пробелом. В остальных трех строках находится описание трех векторов (ребер) v1, v2, v3 параллелепипеда прилегающих к указанной вершине. Все координаты – целые числа, не превышающие 10^4 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT выведите «YES», если параллелепипеды пересекаются и «NO» в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |30 50 0             |YES                 |
|  | 50 50 0            |                    |
|  | -30 30 0           |                    |
|  | 0 0 100            |                    |
|1 | 0 40 70            |                    |
|  | 0 20 20            |                    |
|  | 0 20 -20           |                    |
|  | 1 0 0              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_914 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}