package acmp;

/* acmp.ru   |   Задание №923
		Легион
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
<i>Легион</i> – основная организационная единица в армии Древнего Рима. В разное время легионы имели разную численность и различное построение. Самым простым построением была шеренга. Чтобы из N солдат легиона, выстроенных в шеренгу, отобрать троих в разведку, выполнялись следующие операции: если солдат в шеренге больше трех, то шеренга разбивалась на две, одна из которых состоит из солдат, стоящих на четных позициях, а вторая – из стоящих на нечетных позициях. Для всех полученных шеренг эта процедура повторялась до тех пор, пока в каждой из них не останется не более трех солдат. Если солдат осталось трое, то данную группу можно послать в разведку.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |10                  |2                   |
|2 |4                   |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_923 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}