package acmp;

/* acmp.ru   |   Задание №257
		Кубическое уравнение
(Время: 1 сек. Память: 16 Мб Сложность: 56%)
Напишите программу, которая будет искать все целые X, удовлетворяющие уравнению A*X^3 + B*X^2 + C*X + D = 0, где A, B, C, D – заданные целые коэффициенты.

Входные данные
Во входном файле INPUT.TXT записаны четыре целых числа: A, B, C, D. Все числа по модулю не превышают 2&times;10^9.

Выходные данные
В выходной файл OUTPUT.TXT выведите сначала количество различных корней этого уравнения в целых числах, а затем сами корни в возрастающем порядке. Если уравнение имеет бесконечно много корней, то следует вывести в выходной файл одно число -1 (минус один).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 0 0 -27           |1 3                 |
|2 |0 1 2 3             |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_257 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}