package acmp;

/* acmp.ru   |   Задание №310
		Рамка из клеток
(Время: 1 сек. Память: 16 Мб Сложность: 33%)
Прямоугольник состоит из X&times;Y квадратных клеток одинакового размера. Из него вырезан прямоугольник размером (X-2)&times;(Y-2) так, что осталась рамка шириной в одну клетку. Определить, можно ли покрыть всю рамку плитками размером A&times;1. Запас плиток неограничен, плитки не накладываются одна на другую и за пределы рамки не выходят.

Требуется написать программу, которая решает эту задачу.

Входные данные
Входной текстовый файл INPUT.TXT содержит в первой строке натуральное число K – количество тестов (1 ≤ K ≤ 10). В следующих K строках записаны по три натуральных числа: X, Y - размеры рамки, А – размер плитки (3 ≤ X, Y ≤ 2&times;10^9, 1 ≤ A ≤ 2&times;10^9). Числа разделены пробелами.

Выходные данные
Выходной текстовый файл OUTPUT.TXT должен содержать одну строку из K символов 0 или 1 (1 - если покрытие существует, 0 - иначе).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1                   |1                   |
|1 |3 3 1               |                    |
|--|--------------------|--------------------|
|  |2                   |10                  |
|2 |3 3 2               |                    |
|  |3 3 3               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_310 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}