package acmp;

/* acmp.ru   |   Задание №790
		Развлечения гномов
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Гномы свободно владеют системами счисления с разными основаниями и достигли они этого ежедневными тренировками. Именно поэтому каждое утро у гномов начинается с того, что они текущую календарную дату переводят в другую систему счисления. Ваше задание такое же: перевести заданную дату D/M/Y в систему счисления с основанием D+1.

Для обозначения цифр больших 9 используются большие английские буквы в алфавитном порядке.

Входные данные
Входной файл INPUT.TXT содержит строку, содержащую дату в формате D/M/Y в десятичной системе счисления (1 ≤ D ≤ 31, 1 ≤ M ≤ 12, 1 ≤ Y ≤ 9999).

Выходные данные
В выходной файл OUTPUT.TXT выведите одну строку – дату в формате D/M/Y в системе счисления с основанием D+1.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1/10/2000           |1/1010/11111010000  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_790 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}