package acmp;

/* acmp.ru   |   Задание №467
		Закраска прямой - 2
(Время: 1 сек. Память: 16 Мб Сложность: 61%)
<i>Определение.</i> Интервал прямой с целочисленными координатами [a, b) содержит левую границу – точку a и не содержит правую границу – точку b.

Интервал от 0 до 10^9 выкрасили в белый цвет. Затем было выполнено N операций перекрашивания. При каждой операции цвета в интервале, границы которого задаются, меняются на противоположный (белый на черный, черный на белый).

Требуется написать программу, которая найдет самый длинный интервал белого цвета после заданной последовательности операций перекрашивания.

Входные данные
Входной файл INPUT.TXT содержит в первой строке число N (1 ≤ N ≤ 500) и затем N строк с границами интервалов (числа в диапазоне от 0 до 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число – длину самого большого белого интервала.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |15                  |
|  | 20 50              |                    |
|1 | 10 35              |                    |
|  | 40 90              |                    |
|  | 100 1000000000     |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_467 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}