package acmp;

/* acmp.ru   |   Задание №403
		Обмен валюты
(Время: 1 сек. Память: 16 Мб Сложность: 70%)
Петя работает в обменном пункте во Флатландии. Недавно Петя получил от начальства набор цифр для отображения обменного курса. К сожалению, набор содержит всего по две копии каждой цифры. Теперь Петя хочет узнать, сколько различных обменных курсов он сможет отобразить.

Петя обменивает флатландские доллары на крайландские тугрики. Петя уверен, что курс обмена будет целым числом, которое находится в диапазоне от L до R, включительно.

Входные данные
Входной файл INPUT.TXT содержит два целых числа L и R (1 ≤ L ≤ R ≤ 10^18).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число - количество обменных курсов, которые Петя может отобразить с использованием полученного набора.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1000              |990                 |
|2 |1 100               |100                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_403 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}