package acmp;

/* acmp.ru   |   Задание №400
		Коробка
(Время: 1 сек. Память: 16 Мб Сложность: 37%)
Иван работает на заводе, который производит тяжелую технику. Его работа очень проста – он собирает коробки и упаковывает в них технику для заказчиков. Каждая такая коробка представляет собой параллелепипед. Для сборки коробки Иван использует шесть прямоугольных деревянных плиток. Каждая плита представляет собой одну из сторон коробки.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1345 2584           |POSSIBLE            |
|  | 2584 683           |                    |
|  | 2584 1345          |                    |
|1 | 683 1345           |                    |
|  | 683 1345           |                    |
|  | 2584 683           |                    |
|--|--------------------|--------------------|
|  |1234 4567           |IMPOSSIBLE          |
|  | 1234 4567          |                    |
|  | 4567 4321          |                    |
|2 | 4322 4567          |                    |
|  | 4321 1234          |                    |
|  | 4321 1234          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_400 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}