package acmp;

/* acmp.ru   |   Задание №117
		Опасная зона
(Время: 1 сек. Память: 16 Мб Сложность: 57%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |10                  |26                  |
|  | 4 6                |                    |
|  | 2 5                |                    |
|  | 6 4                |                    |
|  | 7 7                |                    |
|1 | 4 4                |                    |
|  | 1 5                |                    |
|  | 3 8                |                    |
|  | 3 2                |                    |
|  | 5 7                |                    |
|  | 7 3                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_117 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}