package acmp;

/* acmp.ru   |   Задание №376
		День рождения - 2
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
Заданы день и месяц рождения, а также текущие день, месяц и год. Определить, сколько дней осталось до дня рождения.

<u>Примечание</u>. Високосные годы - это те, номер которых делится на 400, а также те, номер которых делится на 4, но не делится на 100.

Входные данные
В первой строке входного файла INPUT.TXT находятся, разделённые пробелами, день и месяц рождения, во второй - разделённые пробелами текущие день, месяц и год. Ограничения: год от 1920 до 3000, месяц от 1 до 12, день от 1 до числа дней в месяце.

Выходные данные
В выходной файл OUTPUT.TXT выведите число дней, оставшихся до дня рождения.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |19 04               |0                   |
|1 |19 04 2002          |                    |
|--|--------------------|--------------------|
|  |05 05               |16                  |
|2 |19 04 2002          |                    |
|--|--------------------|--------------------|
|  |29 02               |1096                |
|3 |28 02 2001          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_376 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}