package acmp;

/* acmp.ru   |   Задание №127
		Путь
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
В неориентированном графе требуется найти длину кратчайшего пути между двумя вершинами.

Входные данные
Во входном файле INPUT.TXT записано сначала число N - количество вершин в графе (1 ≤ N ≤ 100). Затем записана матрица смежности (0 обозначает отсутствие ребра, 1 - наличие ребра). Затем записаны номера двух вершин - начальной и конечной.

Выходные данные
В выходной файл OUTPUT.TXT выведите длину кратчайшего пути. Если пути не существует, выведите одно число -1.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |3                   |
|  | 0 1 0 0 1          |                    |
|  | 1 0 1 0 0          |                    |
|1 | 0 1 0 0 0          |                    |
|  | 0 0 0 0 0          |                    |
|  | 1 0 0 0 0          |                    |
|  | 3 5                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_127 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}