package acmp;

/* acmp.ru   |   Задание №542
		Бит-реверс
(Время: 1 сек. Память: 16 Мб Сложность: 25%)
Целое положительное число m записывается в двоичной системе счисления, разряды (в этой записи) переставляются в обратном порядке и число переводится в десятичную систему счисления. Получившееся число принимается за значение функции B(m).

Требуется написать программу, которая для заданного m вычислит B(m).

Входные данные
Входной файл INPUT.TXT содержит натуральное число m (m ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите значение B(m).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4                   |1                   |
|2 |6                   |3                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_542 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}