package acmp;

/* acmp.ru   |   Задание №495
		Двойственная ломаная
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
Пусть задана некоторая замкнутая ломаная P. Двойственной для P ломаной называется ломаная, вершины которой находятся в серединах звеньев P.

Определим понятие двойственной для P ломаной k-ого порядка dual(P, K) следующим образом:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |4                   |
|  | 0 0                |                    |
|  | 1 0                |                    |
|1 | 1 1                |                    |
|  | 0 1                |                    |
|  | 0                  |                    |
|--|--------------------|--------------------|
|  |4                   |2.8284271247        |
|  | 0 0                |                    |
|  | 1 0                |                    |
|2 | 1 1                |                    |
|  | 0 1                |                    |
|  | 1                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_495 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}