package acmp;

/* acmp.ru   |   Задание №924
		Симпатичный узор
(Время: 1 сек. Память: 16 Мб Сложность: 20%)
На днях Иван у себя в прихожей выложил кафель, состоящий из квадратных черных и белых плиток. Прихожая Ивана имеет квадратную форму 4х4, вмещающую 16 плиток. Теперь Иван переживает, что узор из плиток, который у него получился, может быть не симпатичным. С точки зрения дизайна симпатичным узором считается тот, который не содержит в себе квадрата 2х2, состоящего из плиток одного цвета.

Примеры возможных узоров:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |BWBW                |Yes                 |
|  | BBWB               |                    |
|1 | WWBB               |                    |
|  | BWWW               |                    |
|--|--------------------|--------------------|
|  |BBWB                |No                  |
|  | BBWB               |                    |
|2 | WWBW               |                    |
|  | BBWB               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_924 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}