package acmp;

/* acmp.ru   |   Задание №681
		Спички
(Время: 1 сек. Память: 16 Мб Сложность: 43%)
Какое минимальное количество спичек необходимо для того, чтобы выложить на плоскости N квадратов со стороной в одну спичку? Спички нельзя ломать и класть друг на друга. Вершинами квадратов должны быть точки, где сходятся концы спичек, а сторонами – сами спички.

Напишите программу, которая по количеству квадратов N, которые необходимо составить, находит минимальное необходимое для этого количество спичек.

Входные данные
В единственной строке входного файла INPUT.TXT записано одно целое число N (1 ≤ N ≤ 10^9).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число – минимальное количество спичек, требуемых для составления заданного количества квадратов.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4                   |12                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_681 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}