package acmp;

/* acmp.ru   |   Задание №333
		Общие цифры
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Заданы натуральные числа A, B, C. Требуется написать программу, которая найдет общие цифры в этих числах.

Входные данные
Входной файл INPUT.TXT содержит три натуральных числа A, B, C (1 ≤ A, B, C ≤ 10^80). Числа разделены одним пробелом.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать в первой строке количество общих цифр, а во второй строке в порядке возрастания через один пробел общие цифры.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|1 |1 2 3               |0                   |
|--|--------------------|--------------------|
|  |12 13 14            |1                   |
|2 |                    |1                   |
|--|--------------------|--------------------|
|  |1234 2345 3456      |2                   |
|3 |                    |3 4                 |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_333 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}