package acmp;

/* acmp.ru   |   Задание №350
		Перестановки
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
Дана строка, состоящая из N попарно различных символов. Требуется вывести все перестановки символов данной строки.

Входные данные
Входной файл INPUT.TXT содержит строку, состоящую из N символов (1 ≤ N ≤ 8), символы - буквы английского алфавита и цифры.

Выходные данные
В выходной файл OUTPUT.TXT выведите в каждой строке по одной перестановке. Перестановки можно выводить в любом порядке. Повторений и строк, не являющихся перестановками исходной, быть не должно.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |AB                  |AB                  |
|1 |                    |BA                  |
|--|--------------------|--------------------|
|  |IOX                 |XOI                 |
|  |                    | OIX                |
|  |                    | IXO                |
|2 |                    | XIO                |
|  |                    | OXI                |
|  |                    | IOX                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_350 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}