package acmp;

/* acmp.ru   |   Задание №427
		Несоставляемое число
(Время: 1 сек. Память: 16 Мб Сложность: 48%)
Дано N натуральных чисел. Требуется найти минимальное натуральное число, не представимое суммой никаких из этих чисел, если в эту сумму каждое исходное число может входить не более одного раза.

Входные данные
Входной файл INPUT.TXT в первой строке содержит натуральное число N, не превосходящее 10^4, далее следуют N строк, в каждой из которых записано по одному натуральному числу, каждое из которых не превосходит 10^9.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |4                   |
|  |1                   |                    |
|1 |1                   |                    |
|  |1                   |                    |
|  |5                   |                    |
|--|--------------------|--------------------|
|  |4                   |16                  |
|  |1                   |                    |
|2 |2                   |                    |
|  |4                   |                    |
|  |8                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_427 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}