package acmp;

/* acmp.ru   |   Задание №291
		Словарь
(Время: 1 сек. Память: 16 Мб Сложность: 31%)
Дан некоторый набор букв и словарь. Ваша задача - подсчитать, сколько различных слов из словаря можно составить из этих букв.

Входные данные
В первой строке файла INPUT.TXT записано число N - количество слов в словаре (0 ≤ N ≤ 1000). В следующих N строках файла записано по одному слову из словаря. Слова содержат от 1 до 10 маленьких английских букв. Все слова в словаре различны. В последней строке файла записан набор букв (от 1 до 100 букв).

Выходные данные
Запишите в файл OUTPUT.TXT количество различных слов из словаря, которые можно составить из заданного набора букв.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |7                   |0                   |
|  | ant                |                    |
|  | bee                |                    |
|  | cat                |                    |
|1 | dog                |                    |
|  | ewe                |                    |
|  | fly                |                    |
|  | gnu                |                    |
|  | bew                |                    |
|--|--------------------|--------------------|
|  |7                   |3                   |
|  | bee                |                    |
|  | fly                |                    |
|  | cat                |                    |
|2 | dog                |                    |
|  | ant                |                    |
|  | ewe                |                    |
|  | gnu                |                    |
|  | tancugd            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_291 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}