package acmp;

/* acmp.ru   |   Задание №765
		Го
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |9                   |2                   |
|  | .........          |                    |
|  | .........          |                    |
|  | .........          |                    |
|  | ...WW....          |                    |
|1 | ...BW.B..          |                    |
|  | B..W.W...          |                    |
|  | B...WBW..          |                    |
|  | ....WBW..          |                    |
|  | W....BW..          |                    |
|--|--------------------|--------------------|
|  |6                   |1                   |
|  | WB.WBB             |                    |
|  | .B.W.B             |                    |
|2 | ..WW.W             |                    |
|  | WWW..W             |                    |
|  | ..W...             |                    |
|  | BBW...             |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_765 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}