package acmp;

/* acmp.ru   |   Задание №100
		Счастливые билеты
(Время: 1 сек. Память: 16 Мб Сложность: 68%)
Требуется вычислить количество N - значных счастливых билетов. Напомним, что билет называется счастливым, если сумма первой половины его цифр равна сумме другой его половины. Например, билет 064109 счастливый, т.к. 0+6+4=1+0+9.

Входные данные
В единственной строке входного файла INPUT.TXT записано натуральное четное число N (N ≤ 100) – количество цифр в билете.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число – количество N-значных счастливых билетов.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4                   |670                 |
|2 |6                   |55252               |
|3 |12                  |39581170420         |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_100 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}