package acmp;

/* acmp.ru   |   Задание №876
		Оптимизация на окружности
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Найдите максимальное значение функции f(x, y) = Ax + By при условии, что x^2 + y^2 = R^2, и аргументы, при котором оно достигается.

Входные данные
Входной файл INPUT.TXT содержит три вещественных числа: A, B, R (1 ≤ A, B, R ≤ 10), заданные не более чем с тремя знаками после десятичной точки.

Выходные данные
В первой строке выходного файла OUTPUT.TXT выведите максимальное значение, которое достигает функция. Во второй строке выведите значения аргументов x0,y0, при которых это значение достигается. Все числа должны быть выведены с точностью не хуже 10^&#x2212;5.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1 1 1               |1.414213562373      |
|1 |                    | 0.707106781187 0.707106781187|
|--|--------------------|--------------------|
|  |2.0 1.0 1.0         |2.236067977500      |
|2 |                    | 0.894427191000 0.447213595500|
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_876 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}