package acmp;

/* acmp.ru   |   Задание №785
		Автоморфные числа
(Время: 2 сек. Память: 16 Мб Сложность: 26%)
Число называется автоморфным если оно совпадает с последними цифрами своего квадрата. Например, число 25 автоморфно, так как 25^2=625. Напишите программу определения всех автомофных чисел на заданном промежутке [a, b].

Входные данные
Входной файл INPUT.TXT содержит два натуральных числа a и b (a ≤ b ≤ 10^6).

Выходные данные
В выходной файл OUTPUT.TXT выведите через пробел в порядке возрастания все автоморфные числа заданного промежутка.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 10                |1 5 6               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_785 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}