package acmp;

/* acmp.ru   |   Задание №498
		K-перестановки
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
Назовем перестановку из N чисел 1…N <i>K-перестановкой</i>, если любые два соседних в ней элемента отличаются не более, чем на K.

Требуется найти число K-перестановок из N чисел от 1 до N.

Входные данные
Входной файл INPUT.TXT содержит натуральные числа N и K (K ≤ N ≤ 9).

Выходные данные
В выходной файл OUTPUT.TXT выведите целое число - ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 1                 |2                   |
|2 |4 2                 |12                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_498 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}