package acmp;

/* acmp.ru   |   Задание №380
		Площадь прямоугольников
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Дано N прямоугольников со сторонами, параллельными осям координат. Требуется определить площадь фигуры, образованной объединением данных прямоугольников.

Входные данные
В первой строке входного файла INPUT.TXT находится число прямоугольников - N. Затем идут N строк, содержащих по 4 числа: x1, y1, x2, y2 - координаты двух противоположных углов прямоугольника. Все координаты – целые числа, не превосходящие по абсолютной величине 10 000. (1 ≤ N ≤ 100)

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – площадь фигуры.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1                   |36                  |
|1 |1 1 7 7             |                    |
|--|--------------------|--------------------|
|  |2                   |7                   |
|2 |1 1 3 3             |                    |
|  |2 2 4 4             |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_380 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}