package acmp;

/* acmp.ru   |   Задание №918
		График
(Время: 1 сек. Память: 16 Мб Сложность: 58%)
Антон работает курьером. У него много заказов. На выполнение одного заказа у Антона уходит ровно один день. Для каждого заказа определена стоимость и срок его выполнения (количество дней, оставшихся до запланированного дня выполнения заказа). Однажды проснувшись, Антон изучил свой график и понял, что возможно он не сможет выполнить все заказы, и его могут уволить. Поэтому он решил выполнить лишь некоторые из них так, чтобы при этом получить максимальный доход.

Входные данные
Первая строка входного файла INPUT.TXT содержит целое число N (1 ≤ N ≤ 1000) – количество заказов. Затем в N строках описаны данные каждого заказа Ti и Ci (натуральные числа, не превосходящие 10^5). Где Ti – последний день, в который еще можно выполнить заказ, Ci – вознаграждение за выполнение заказа.

Выходные данные
В выходной файл OUTPUT.TXT выведите максимальное вознаграждение, которое можно получить, выполняя заказы.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |22                  |
|1 |1 10                |                    |
|  |2 12                |                    |
|--|--------------------|--------------------|
|  |3                   |44                  |
|  |1 10                |                    |
|2 |1 20                |                    |
|  |3 24                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_918 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}