package acmp;

/* acmp.ru   |   Задание №762
		Взвешивание
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Имеется N монет, не различимых на первый взгляд. Однако, одна из них фальшивая. Фальшивая монета чуть тяжелее, чем настоящая, но во всем остальном полностью идентична настоящим. Кроме того, есть чашечные весы без гирь и шкалы (по таким весам, можно определить, какая чаша тяжелее или легче, но нельзя сказать на сколько). Найти минимальное количество взвешиваний, за которое можно гарантированно определить фальшивку.

Входные данные
Входной файл INPUT.TXT содержит одно натуральное число N – количество монет (2 ≤ N ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите минимальное количество взвешиваний.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |1                   |
|2 |3                   |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_762 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}