package acmp;

/* acmp.ru   |   Задание №813
		Игра в 24
(Время: 1 сек. Память: 16 Мб Сложность: 62%)
«Игра в 24» - это математическая игра, в которой используются специальные карточки. На каждой карточке записаны четыре числа. Задача игроков состоит в том, чтобы получить число 24, используя эти числа и арифметические операции (сложение, вычитание, умножение и деление, скобки при этом можно расставить произвольным образом). «Игра в 24» используется в некоторых школах при изучении математики в начальных классах.

В этой задаче рассматривается упрощенный вариант этой игры, в котором в число разрешенных операций входят только сложение, вычитание и умножение.

Назовем карточку для упрощенной «Игры в 24» правильной, если из указанных на ней чисел с помощью сложения, вычитания, умножения и расстановки скобок произвольным образом можно получить число 24.

Фирма <i>American Card Manufacturer</i> (ACM) занимается выпуском наборов карточек для этой игры. Однако, выпуск таких карточек сопряжен с некоторыми трудностями. Одна из них состоит в том, что не любой набор из четырех чисел задает «правильную» карточку.

По этой причине задача проверки «правильности» данной карточки является весьма актуальной. Ваша задача состоит в написании программы, которая будет осуществлять указанную проверку.

Входные данные
Входной файл INPUT.TXT содержит четыре натуральных числа, не превосходящих 30, которые написаны на исследуемой карточке.

Выходные данные
В выходной файл OUTPUT.TXT выведите слово YES, если карточка является правильной, и слово NO в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 2 3 4             |YES                 |
|2 |1 1 1 1             |NO                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_813 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}