package acmp;

/* acmp.ru   |   Задание №436
		Счастливые цифры
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
Школьнику Васе нравятся числа, которые заканчиваются счастливыми для него цифрами K. Поэтому каждый раз, когда он видит какое-нибудь натуральное число N, он сразу пытается подобрать такое D (D ≥ 2), что число N в системе счисления с основанием D заканчивается как можно большим количеством цифр K.

Требуется написать программу, которая по заданным числам N и K найдет такое D, чтобы число N в системе счисления с основанием D заканчивалось как можно большим количеством цифр K.

Входные данные
Входной файл INPUT.TXT содержит два целых десятичных числа N и K (1 ≤ N ≤ 10^11; 0 ≤ K ≤ 9).

Выходные данные
В выходной файл OUTPUT.TXT выведите два числа: D – искомое основание системы счисления и L – количество цифр K, которым заканчивается запись числа N в этой системе счисления. Если искомых D несколько, выведите любое из них, не превосходящее 10^12 (такое всегда существует).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |49 1                |3 2                 |
|2 |7 5                 |3 0                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_436 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}