package acmp;

/* acmp.ru   |   Задание №668
		Змей Горыныч
(Время: 1 сек. Память: 16 Мб Сложность: 34%)
В некотором царстве жил Змей Горыныч. У него было N голов и M хвостов. Иван-царевич решил уничтожить губителя человеческих душ, для чего ему его кума Баба Яга подарила волшебный меч, так как только им можно убить Змея Горыныча. Если отрубить одну голову, то на её месте вырастает новая, если отрубить хвост, то вместо него вырастет 2 хвоста. Если отрубить два хвоста, то вырастает 1 голова, и только когда отрубить 2 головы, то не вырастет ничего. Змей Горыныч гибнет только в том случае, когда ему отрубать все головы и все хвосты. Определить минимальное количество ударов мечом, нужное для уничтожения Змея Горыныча.

Входные данные
В единственной строке входного файла INPUT.TXT записаны через пробел два числа N, M (0 ≤ N, M ≤ 1000).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно число – минимальное количество ударов мечом, или -1, если уничтожить Змея Горыныча невозможно.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 3                 |9                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_668 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}