package acmp;

/* acmp.ru   |   Задание №721
		Стрелки - 2
(Время: 1 сек. Память: 16 Мб Сложность: 68%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 4                 |RRRD                |
|  | ????               | UUDL               |
|  | ????               | .UL.               |
|1 | .??.               |                    |
|  |                    | RLDD               |
|  |                    | RLUU               |
|  |                    | .RL.               |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_721 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}