package acmp;

/* acmp.ru   |   Задание №239
		Узор
(Время: 1 сек. Память: 16 Мб Сложность: 80%)
В комнате решили сделать паркетный пол. Причем есть задумка выложить на полу некоторый узор. Плитки паркета, которыми выкладывается пол комнаты, состоят из квадратиков 1&times;1, каждый из которых может быть либо белым, либо черным. В свою очередь, комната имеет размеры N&times;M. На плане комнаты указано, какой квадрат комнаты какого цвета должен быть. Существует несколько форм паркетных плиток:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4 3 3               |15                  |
|  | 2 2 2              |                    |
|  | 2 0 0              |                    |
|  | 2 1 2              |                    |
|1 | 2 2 2              |                    |
|  | 2 10 0 0           |                    |
|  | 1 5 1              |                    |
|  | 4 6 0 0 1          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_239 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}