package acmp;

/* acmp.ru   |   Задание №145
		A div B
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
Даны два целых числа A и B. Требуется найти их целую часть от их частного.

Входные данные
Во входном файле INPUT.TXT записаны целые числа A и B по одному в строке (0 ≤ A ≤ 10^100, 0 &lt; B ≤ 10000).

Выходные данные
В выходной файл OUTPUT.TXT выведите единственное число без лидирующих нулей: A div B.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |7                   |2                   |
|1 |3                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_145 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}