package acmp;

/* acmp.ru   |   Задание №322
		Слово
(Время: 1 сек. Память: 16 Мб Сложность: 20%)
Числа Фибоначчи строятся следующим образом: первые два равны единице, а каждое следующее равно сумме двух предыдущих. Например, первые десять чисел Фибоначчи равны: 1, 1, 2, 3, 5, 8, 13, 21, 34, 55. В заданном тексте символы нумеруются слева направо, начиная с единицы.

Требуется написать программу, которая составит слово из символов, номера которых совпадают с числами Фибоначчи.

Входные данные
Входной файл INPUT.TXT содержит в единственной строке текст, состоящий из английских строчных букв. В тексте от 1 до 30000 символов.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать слово из символов, номера которых совпадают с числами Фибоначчи. Символы слова идут в том же порядке, что и в заданном тексте.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |a                   |a                   |
|2 |abc                 |abc                 |
|3 |abcdefghij          |abceh               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_322 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}