package acmp;

/* acmp.ru   |   Задание №359
		Змейка - 2
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
<img src="/asp/article/image.asp?id=256" align="right" vspace="10" hspace="10"> Мальчик Вася на уроке математики, вместо того, чтобы слушать учителя, рисовал числа в тетрадке в клеточку. Да не просто так рисовал, а определенным образом. Сначала он поставил в клетку число 1. Затем справа от нее нарисовал число 2. Затем снизу от числа 2 написал число 3. Затем перешёл на клетку правее и продолжил увлекательное занятие двигаясь по столбцу вверх, пока число в этом столбце не стало выше самого верхнего числа в предыдущем столбце. Затем он перешёл на клетку правее и опять таки продолжил рисование чисел, начиная с 7, но только уже сверху вниз, пока не нарисовал число, которое оказалось на одну клетку ниже самого нижнего числа в предыдущем столбце. И так далее. Вася не любил числа, заканчивающиеся нулем, и пропускал их при рисовании змейки. Первые его шесть заполненных столбцов мы скопировали из его тетрадки и привели здесь на рисунке. Так как Вася очень любопытный, то он очень хочет узнать, какое же число будет у него стоять в N-ом столбце в той строке, где стоит число 1. Первые 6 таких чисел в этой строке видны на рисунке: 1, 2, 5, 8, 14, 19.

Требуется написать программу, которая поможет Васе.

Входные данные
Входной файл INPUT.TXT содержит одно число N (1 ≤ N ≤ 10^6) – номер столбца.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать N-ое число в строке, где стоит число 1.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |5                   |
|2 |5                   |14                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_359 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}