package acmp;

/* acmp.ru   |   Задание №434
		Стеклянный забор
(Время: 1 сек. Память: 16 Мб Сложность: 72%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |8                   |6                   |
|  | 0 0                | 0 0                |
|  | 9 0                | 9 0                |
|  | 9 9                | 9 9                |
|1 | 6 9                | 6 9                |
|  | 6 3                | 6 6                |
|  | 3 3                | 0 6                |
|  | 3 6                |                    |
|  | 0 6                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_434 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}