package acmp;

/* acmp.ru   |   Задание №506
		Игра - 3
(Время: 1 сек. Память: 16 Мб Сложность: 55%)
Петя и Вася увлеклись азартной игрой на деньги. Игра состоит из множества раундов, в каждом из которых бросается монетка и если выпадает «Решка», то побеждает Петя и получает очко, в противном случае очко присуждается Васе. Набранные очки в разных раундах суммируются и тот, кто первым наберет N очков, выигрывает.

Вдруг, посреди игры прозвенел звонок, и ребятам пришлось закончить игру. Помогите Пете и Васе справедливо поделить поставленные на кон монеты между собой в соответствии с математическим ожиданием выигрыша.

Входные данные
Входной файл INPUT.TXT содержит в одной строке 4 целых числа N, K1, K2 и S. Все числа разделены пробелами. N – количество очков, которые необходимо набрать для победы. K1 и K2 – текущие очки Пети (K1) и Васи (K2). S – число монет, которые на кону и которые необходимо поделить между игроками.

Ограничения: 1 ≤ N ≤ 50, 0 ≤ K1, K2 &lt; N, 1 &lt; S &lt; 10^100.

Выходные данные
В выходной файл OUTPUT.TXT через пробел выведите два целых числа: количество монет, которые должны получить Петя и Вася. Не забудьте, что сумма этих чисел в точности должна быть равна S. Гарантируется, что однозначный ответ в целых числах существует.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 1 2 16            |4 12                |
|2 |4 1 1 2             |1 1                 |
|3 |5 1 4 32            |2 30                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_506 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}