package acmp;

/* acmp.ru   |   Задание №828
		Красивые последовательности
(Время: 2 сек. Память: 64 Мб Сложность: 56%)
Математики – люди, весьма ценящие красоту. Они умеют находить ее даже в объектах, к которым, по мнению большинства, это понятие даже не может быть применимо. Например, недавно один математик, занимавшийся изучением последовательностей натуральных чисел, заметил, что некоторые из последовательностей отличаются необычайной красотой. Особенно красивыми он посчитал последовательности a1, ... , an длины n из чисел от 1 до k, обладающие следующими свойствами:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 3                 |5                   |
|2 |7 6                 |876                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_828 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}