package acmp;

/* acmp.ru   |   Задание №169
		Магазин
(Время: 1 сек. Память: 16 Мб Сложность: 34%)
На расстоянии N шагов от магазина стоит человек. Каждую минуту он выбирает, куда сделать шаг: к магазину или в противоположном направлении.

Требуется написать программу, которая определит, сколькими способами он может попасть в магазин, пройдя ровно K шагов и оказавшись в магазине только после выполнения последнего шага.

Входные данные
Входной файл INPUT.TXT содержит два числа N и K, записанные через пробел. Известно, что 1 ≤ N ≤ K ≤ 37.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно число – количество способов попадания в магазин.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 4                 |2                   |
|2 |5 5                 |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_169 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}