package acmp;

/* acmp.ru   |   Задание №188
		День рождения
(Время: 1 сек. Память: 16 Мб Сложность: 65%)
Иван Иванович пригласил на свой день рождения много гостей. Он написал на карточках фамилии всех гостей и разложил эти карточки на столе, полагая, что каждый гость сядет там, где обнаружит карточку со своей фамилией (фамилии у всех гостей различны). Однако гости не обратили внимания на карточки и сели за стол в произвольном порядке. При этом Иван Иванович с удивлением обнаружил, что ни один гость не сел на предназначенное ему место.

Требуется написать программу, которая найдет сколькими способами можно рассадить гостей так, чтобы ни один из них не сидел там, где лежала карточка с его фамилией.

Входные данные
Во входном файле INPUT.TXT задано целое число N – количество гостей (1 ≤ N ≤ 100).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно целое число – количество способов рассадить гостей.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |0                   |
|2 |2                   |1                   |
|3 |5                   |44                  |
|4 |20                  |895014631192902121  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_188 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}