package acmp;

/* acmp.ru   |   Задание №710
		Булева алгебра - 2
(Время: 1 сек. Память: 16 Мб Сложность: 57%)
В каждом языке программирования, даже самом простом, есть оператор ветвления, позволяющий проверить истинность логического выражения и, в зависимости от его результата, выполнить то или иное действие. Условие оператора ветвления представляет собой логическое (булевское) выражение, результатом которого может быть либо истина (TRUE), либо ложь (FALSE). Переменные, которые могут участвовать в логическом выражении, называются булевскими (boolean). Булевские переменные могут объединяться в сложные условия при помощи логических операций (функций):

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |AND(A,NOT(B))       |FALSE               |
|  | 1 2                |                    |
|1 | A=FALSE            |                    |
|  | B=TRUE             |                    |
|--|--------------------|--------------------|
|  |OR(NOT(AND(A,B)),A) |TRUE                |
|  | 3 2                |TRUE                |
|  | A=FALSE            |TRUE                |
|  | B=TRUE             |                    |
|2 | A=TRUE             |                    |
|  | B=TRUE             |                    |
|  | A=FALSE            |                    |
|  | B=FALSE            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_710 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}