package acmp;

/* acmp.ru   |   Задание №508
		Клеверный лист
(Время: 1 сек. Память: 16 Мб Сложность: 36%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |2 4                 |
|1 | B 0 0 2 3          |                    |
|  | B 4 1 0 0          |                    |
|--|--------------------|--------------------|
|  |5                   |9 18 -1 12 8        |
|  | B 0 0 9 9          |                    |
|  | B 0 0 0 0          |                    |
|2 | L 3 3 0 0          |                    |
|  | B 0 0 0 0          |                    |
|  | B 8 4 0 0          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_508 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}