package acmp;

/* acmp.ru   |   Задание №969
		Сверхстепень
(Время: 1 сек. Память: 16 Мб Сложность: 30%)
Назовем значение выражения 2^2^n n-ой сверхстепенью числа 2. Таким образом, например, третья сверхстепень числа 2 равна 2^2^3 = 2^8 = 256.

Ваша задача – вычислить n-ую сверхстепень двойки по модулю m.

Входные данные
Входной файл INPUT.TXT содержит два целых числа: n (0 ≤ n ≤ 10^5) и m (2 ≤ m ≤ 10^4).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 1000              |256                 |
|2 |10 10               |6                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_969 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}