package acmp;

/* acmp.ru   |   Задание №576
		Гадание - 2
(Время: 1 сек. Память: 16 Мб Сложность: 20%)
Маша недавно прочитала в книге «Теория чисел и предсказание будущего» о новом способе гадания. Способ заключается в следующем: надо выбрать целое положительное число N и посчитать количество чисел, меньших N и взаимно простых с ним. Это количество и будет результатом гадания.

Поскольку гадать приходится достаточно часто, а процесс гадания достаточно трудоемок, Маша попросила вас написать программу, считающую результат гадания.

Два числа называются <i>взаимно простыми</i>, если их наибольший общий делитель равен 1. <i>Наибольшим общим делителем</i> двух чисел a и b называется наибольшее целое положительное число, на которое делятся и a, и b.

Входные данные
Входной файл INPUT.TXT содержит целое положительное число N (1 ≤ N ≤ 10^5).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число – результат гадания.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |13                  |12                  |
|2 |6                   |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_576 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}