package acmp;

/* acmp.ru   |   Задание №953
		Дроби
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
В то время, пока другие дети бегали по улицам или гоняли мяч, мальчик Слава сидел дома и решал сложную математическую проблему. Вкратце, проблема выглядела так.</p><p class="text">Каждое натуральное число, начиная с трёх, можно представить в виде суммы различных натуральных чисел, например, 5=3+2=4+1. А возможно ли представить правильную дробь m/n в виде суммы различных членов гармонического ряда 1/2, 1/3, 1/4, …, то есть m/n=1/x+1/y+1/z+…? При этом должно выполняться условие x &lt; y &lt; z &lt; … Если существует несколько решений, то надо найти то из них, у которого значение x минимально. Если неоднозначность не снимается, то надо найти решение с минимальным y, и так далее.

Входные данные
Входной файл INPUT.TXT содержит два натуральных числа m и n (1 ≤ m &lt; n ≤ 32).

Выходные данные
В выходной файл OUTPUT.TXT выведите найденные числа x, y, z, … через пробел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5 6                 |2 3                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_953 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}