package acmp;

/* acmp.ru   |   Задание №224
		Наибольшее произведение
(Время: 1 сек. Память: 128 Мб Сложность: 38%)
Дано N целых чисел. Требуется выбрать из них три таких числа, произведение которых максимально.

Входные данные
Во входном файле INPUT.TXT записано сначала число N — количество чисел в последовательности (3 ≤ N ≤ 10^6). Далее записана сама последовательность: N целых чисел, по модулю не превышающих 30000.

Выходные данные
В выходной файл OUTPUT.TXT выведите значение наибольшего произведения искомых трех чисел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |9                   |810                 |
|1 | 3 5 1 7 9 0 9 -3 10|                    |
|--|--------------------|--------------------|
|  |3                   |-1800000            |
|2 | -5 -30000 -12      |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_224 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}