package acmp;

/* acmp.ru   |   Задание №468
		Числовая последовательность - 2
(Время: 1 сек. Память: 16 Мб Сложность: 66%)
Дана последовательность натуральных чисел 7, 11, 13, 14, 19, 21, 22, 25, ….

Требуется написать программу, которая по заданному N находит N-ый член этой последовательности.

Входные данные
Входной файл INPUT.TXT содержит число N (1 ≤ N ≤ 2147483647).

Выходные данные
В выходной файл OUTPUT.TXT выведите N-ый член последовательности.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |7                   |
|2 |6                   |21                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_468 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}