package acmp;

/* acmp.ru   |   Задание №479
		Муравей и дерево
(Время: 1 сек. Память: 16 Мб Сложность: 63%)
Муравей находится в лесу с плоской поверхностью почвы в точке с координатами (x1, y1) и направляется в точку (x2, y2). В лесу растет дерево, основание ствола которого имеет форму круга с центром в точке (x, y) и радиусом r. Дерево, возможно, помешает муравью дойти до цели по прямой. В таком случае ему придется обойти дерево вокруг ствола.

Требуется написать программу, которая определит длину кратчайшего пути муравья.

Входные данные
Входной файл INPUT.TXT содержит вещественные числа x1, y1, x2, y2, x, y, r. Числа записаны через пробел и находятся в диапазоне от 0 до 1000, r&gt;0. Начальная и конечная точки пути муравья не могут находиться внутри круга.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать единственное вещественное число – длину кратчайшего пути. Ответ следует выводить с точностью не менее трех знаков после запятой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |0 0 4 4 2 2 1       |6.014               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_479 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}