package acmp;

/* acmp.ru   |   Задание №275
		Делимость на 7
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Требуется определить делимость на 7 ряда целых чисел, записанных в двоичной системе счисления.

Входные данные
В первой строке входного файла INPUT.TXT содержится N – количество чисел (N &lt; 50). В следующих N строках содержатся двоичные числа (по одному в каждой строке). Каждое двоичное число состоит не более чем из 1000 цифр.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать N строк. Для каждого теста в отдельной строке надо выдать сообщение “Yes”, если соответствующее число кратно 7 или “No” в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |Yes                 |
|  | 1110               | No                 |
|1 | 1010101            | Yes                |
|  | 111111111111111111111111111|                    |
|--|--------------------|--------------------|
|  |1                   |No                  |
|2 |11                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_275 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}