package acmp;

/* acmp.ru   |   Задание №622
		Прямоугольное деление
(Время: 1 сек. Память: 16 Мб Сложность: 66%)
Дано N прямоугольников со сторонами, параллельными осям координат. Требуется определить, на сколько частей эти прямоугольники разбивают плоскость (внутри частей не должно быть границ прямоугольников).

Входные данные
В первой строке входного файла INPUT.TXT содержится число прямоугольников N (1 ≤ N ≤ 100). Далее идут N строк, содержащих по 4 числа x1, y1, x2, y2 - координаты двух противоположных углов прямоугольника. Координаты представляют собой целые числа и по абсолютной величине не превосходят 10 000.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число - количество частей, на которые разбивается плоскость.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |6                   |
|  | 10 20 50 30        |                    |
|1 | 40 10 50 25        |                    |
|  | 40 25 80 30        |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_622 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}