package acmp;

/* acmp.ru   |   Задание №280
		Количество делителей - 2
(Время: 1 сек. Память: 16 Мб Сложность: 51%)
Пусть х — натуральное число. Назовем у его делителем, если 1 ≤ у ≤ х и остаток от деления х на у равен нулю.

Задано число х. Найдите количество его делителей, делящихся на каждое из простых чисел, на которое делится х.

Входные данные
Входной файл INPUT.TXT содержит целое число x (1 ≤ х ≤ 10^18). Все простые делители числа х не превосходят тысячу.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |12                  |2                   |
|2 |239                 |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_280 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}