package acmp;

/* acmp.ru   |   Задание №258
		Скорая помощь
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Бригада скорой помощи выехала по вызову в один из отделенных районов. К сожалению, когда диспетчер получил вызов, он успел записать только адрес дома и номер квартиры K1, а затем связь прервалась. Однако он вспомнил, что по этому же адресу дома некоторое время назад скорая помощь выезжала в квартиру K2, которая расположена в подъезде P2 на этаже N2. Известно, что в доме M этажей и количество квартир на каждой лестничной площадке одинаково. Напишите программу, которая вычисляет номер подъезда P1 и номер этажа N1 квартиры K1.

Входные данные
Во входном файле INPUT.TXT записаны пять положительных целых чисел K1, M, K2, P2, N2. Все числа не превосходят 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите два числа P1 и N1. Если входные данные не позволяют однозначно определить P1 или N1, вместо соответствующего числа напечатайте 0. Если входные данные противоречивы, то следует вывести два числа –1 (минус один).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |89 20 41 1 11       |2 3                 |
|2 |11 1 1 1 1          |0 1                 |
|3 |3 2 2 2 1           |-1 –1               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_258 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}