package acmp;

/* acmp.ru   |   Задание №343
		Укладка плиток
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4 4                 |9                   |
|  | 4                  |                    |
|  | 4 1 1              |                    |
|1 | 2 2 2              |                    |
|  | 3 1 1              |                    |
|  | 1 3 3              |                    |
|--|--------------------|--------------------|
|  |2 3                 |6                   |
|  | 2                  |                    |
|2 | 2 1 1              |                    |
|  | 3 1 2              |                    |
|--|--------------------|--------------------|
|  |3 2                 |6                   |
|  | 2                  |                    |
|3 | 4 1 1              |                    |
|  | 1 2 1              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_343 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}