package acmp;

/* acmp.ru   |   Задание №911
		Взвешивания
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |L 5                 |L:1 3               |
|1 |                    |R:9                 |
|--|--------------------|--------------------|
|  |R 3                 |L:3                 |
|2 |                    |R:                  |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_911 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}