package acmp;

/* acmp.ru   |   Задание №377
		Закраска прямой
(Время: 0,5 сек. Память: 16 Мб Сложность: 48%)
На числовой прямой окрасили N отрезков. Известны координаты левого и правого концов каждого отрезка (Li и Ri). Найти длину окрашенной части числовой прямой.

Входные данные
Входной файл INPUT.TXT в первой строке содержит число N, в следующих N строках - пары Li и Ri. Ограничения: все числа целые, не превышающие 10^9 по абсолютной величине, 1 ≤ N ≤ 15 000.

Выходные данные
В выходной файл OUTPUT.TXT выведите длину окрашенной части прямой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |3                   |
|1 |1 3                 |                    |
|  |2 4                 |                    |
|--|--------------------|--------------------|
|  |1                   |0                   |
|2 |10 10               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_377 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}