package acmp;

/* acmp.ru   |   Задание №971
		Треугольник - 4
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Пусть на плоскости введена прямоугольная декартова система координат и задан треугольник ABC: A(xA, yA), B(xB, yB), C(xC, yC). Центром масс треугольника назовем точку с координатами ((xA+ xB+ xC)/3, (yA+ yB+ yC)/3).

Заданы координаты центра масс треугольника ABC. Необходимо найти координаты вершин треугольника ABC, удовлетворяющие условиям:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |9 4                 |YES                 |
|  |                    |3 9                 |
|1 |                    |6 3                 |
|  |                    |18 0                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_971 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}