package acmp;

/* acmp.ru   |   Задание №365
		Разложение на слагаемые
(Время: 2 сек. Память: 16 Мб Сложность: 54%)
Требуется вывести все различные представления натурального числа N в виде суммы натуральных чисел. Представления, отличающиеся друг от друга порядком слагаемых, не являются различными.

Входные данные
Входной файл INPUT.TXT содержит целое число N (2 ≤ N ≤ 40).

Выходные данные
В выходной файл OUTPUT.TXT выведите все различные представления числа N без повторов в виде суммы по одному на отдельной строке. Как слагаемые, так и сами суммы могут следовать в произвольном порядке.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |1+1+1+1             |
|  |                    | 1+2+1              |
|1 |                    | 1+3                |
|  |                    | 2+2                |
|--|--------------------|--------------------|
|  |5                   |1+1+1+1+1           |
|  |                    | 1+1+1+2            |
|  |                    | 1+1+3              |
|2 |                    | 1+2+2              |
|  |                    | 2+3                |
|  |                    | 1+4                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_365 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}