package acmp;

/* acmp.ru   |   Задание №58
		Проверка на симпатичность
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Рассмотрим таблицу, содержащую n строк и m столбцов, в каждой клетке которой расположен ноль или единица. Назовем такую таблицу симпатичной, если в ней нет ни одного квадрата 2 на 2, заполненного целиком нулями или целиком единицами.

Так, например, таблица 4 на 4, расположенная слева, является симпатичной, а расположенная справа таблица 3 на 3 - не является.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |YES                 |
|  | 1 1                | YES                |
|  | 0                  | NO                 |
|  | 4 4                |                    |
|  | 1 0 1 0            |                    |
|  | 1 1 1 0            |                    |
|1 | 0 1 0 1            |                    |
|  | 0 0 0 0            |                    |
|  | 3 3                |                    |
|  | 0 0 1              |                    |
|  | 0 0 1              |                    |
|  | 1 1 1              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_058 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}