package acmp;

/* acmp.ru   |   Задание №354
		Разложение на простые множители
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Требуется вывести представление целого числа N в виде произведения простых чисел.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (2 ≤ N ≤ 2^31-1).

Выходные данные
В выходной файл OUTPUT.TXT выведите список простых множителей числа N в порядке неубывания, разделенных знаком «*».

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5                   |5                   |
|2 |30                  |2*3*5               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_354 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}