package acmp;

/* acmp.ru   |   Задание №126
		Издевательство
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |24                  |
|  | 0 20 10 30 40      |                    |
|  | 20 0 30 1 2        |                    |
|1 | 10 30 0 40 1000    |                    |
|  | 30 1 40 0 21       |                    |
|  | 40 2 1000 21 0     |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_126 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}