package acmp;

/* acmp.ru   |   Задание №211
		Игра с фишками
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5 4                 |5                   |
|  | XXXXX              | 6                  |
|  | X...X              | 0                  |
|  | XXX.X              |                    |
|1 | .XXX.              |                    |
|  | 2 3 5 3            |                    |
|  | 1 3 4 4            |                    |
|  | 2 3 3 4            |                    |
|  | 0 0 0 0            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_211 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}