package acmp;

/* acmp.ru   |   Задание №614
		Скобки - 3
(Время: 1 сек. Память: 32 Мб Сложность: 61%)
Рассмотрим скобочные последовательности с одним типом скобок. Для заданной скобочной последовательности найдите количество ее подпоследовательностей, которые являются правильными скобочными последовательностями.

Например, для последовательности "((())())(" таких последовательностей восемь: "((())())", "(())()", "((()))", "(()())", "(())", "()()", "()" и "".

Входные данные
Входной файл INPUT.TXT содержит последовательность, состоящую не более чем из 300 круглых скобок.

Выходные данные
В выходной файл OUTPUT.TXT выведите количество различных правильных скобочных подпоследовательностей заданной последовательности.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |((())())(           |8                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_614 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}