package acmp;

/* acmp.ru   |   Задание №623
		Снова Фибоначчи
(Время: 2 сек. Память: 16 Мб Сложность: 23%)
Вам наверняка знакомы числа Фибоначчи: 1, 1, 2, 3, 5, 8, 13, 21... Они определяются рекуррентным соотношением: Fn = Fn-1 + Fn-2, F0 = F1 = 1.

Требуется найти последнюю цифру n-го числа Фибоначчи.

Входные данные
Во входном файле INPUT.TXT содержится одно целое число n (0 ≤ n ≤ 10^8).

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести одно число - последнюю цифру числа Fn.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |5                   |8                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_623 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}