package acmp;

/* acmp.ru   |   Задание №678
		Напёрстки
(Время: 1 сек. Память: 16 Мб Сложность: 15%)
Шулер показывает следующий трюк. Он имеет три одинаковых наперстка. Под первый (левый) он кладет маленький шарик. Затем он очень быстро выполняет ряд перемещений наперстков, каждое из которых – это одно из трех перемещений - A, B, C:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |CBABCACCC           |1                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_678 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}