package acmp;

/* acmp.ru   |   Задание №149
		Разворот
(Время: 1 сек. Память: 16 Мб Сложность: 9%)
Дано натуральное число N и последовательность из N элементов. Требуется вывести эту последовательность в обратном порядке.

Входные данные
В первой строке входного файла INPUT.TXT записано натуральное число N (N ≤ 10^3). Во второй строке через пробел идут N целых чисел, по модулю не превосходящих 10^3 - элементы последовательности.

Выходные данные
В выходной файл OUTPUT.TXT выведите заданную последовательность в обратном порядке.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |3 2 1               |
|1 |1 2 3               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_149 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}