package acmp;

/* acmp.ru   |   Задание №977
		Поезда
(Время: 1 сек. Память: 16 Мб Сложность: 70%)
Во Флатландии расположено N городов. Недавно король Флатландии побывал в Японии и был поражен скоростными поездами Shinkansen, сеть которых связывает всю страну. Теперь он решил построить сеть высокоскоростных поездов во Флатландии.

Каждый маршрут скоростного поезда будет соединять ровно два города во Флатландии. Хотя реальной необходимости в скоростных поездах во Флатландии нет, король повелел, чтобы хотя бы одна линия скоростного поезда была в каждом городе.

Министр транспорта Флатландии сказал королю, что существует несколько сетей маршрутов поездов, удовлетворяющих данному свойству. Король был поражен этим фактом и попросил министра подсчитать количество возможных сетей. Помогите ему!

Входные данные
Входной файл INPUT.TXT содержит целое число N (2 ≤ N ≤ 100).

Выходные данные
В выходной файл OUTPUT.TXT выведите количество сетей скоростных поездов, которые удовлетворяют требованиям короля.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4                   |41                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_977 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}