package acmp;

/* acmp.ru   |   Задание №654
		Концертный зал
(Время: 1 сек. Память: 32 Мб Сложность: 36%)
Большой концертный зал Байтланда — известное на весь мир место, где мечтают выступать величайшие оперные певцы и певицы. В желающих послушать их выступления, как правило, недостатка нет. Поэтому Министерством культуры Байтланда было принято решение увеличить размеры зала.

Однако это вызвало другую проблему: на задних рядах обновленного концертного зала посетители практически ничего не слышат. Поэтому Инженерный институт предложил проект акустической системы, которая будет состоять из микрофонов, записывающих происходящее на сцене, и динамиков, транслирующих усиленный звук в зал.

В идеальном случае динамики должны достоверно воспроизводить звук, записываемый с микрофонов. На практике этого добиться почти невозможно, так как при текущем уровне развития технологий практически все динамики воспроизводят различные частоты с различной громкостью. Мириться с этим инженеры, однако, не собираются.

В лаборатории удалось измерить АЧХ (амплитудно-частотную характеристику) динамиков и представить ее в следующей форме:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |3                   |
|1 |1 3 2               |                    |
|--|--------------------|--------------------|
|  |4                   |5                   |
|2 |1 2 4 2             |                    |
|--|--------------------|--------------------|
|  |5                   |6                   |
|3 |3 1 4 1 1           |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_654 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}