package acmp;

/* acmp.ru   |   Задание №840
		Шары
(Время: 2 сек. Память: 16 Мб Сложность: 37%)
В пространстве расположен шар, заданный координатами своего центра X,Y,Z и радиусом R. К нему добавляется не более N новых шаров, которые также описываются координатами центров Xi, Yi, Zi и радиусами Ri (1 ≤ i ≤ N).

Шары добавляются до тех пор, пока есть хоть один шар, не пересекающийся с другими шарами. Требуется определить номер шара, после которого процесс добавления шаров можно прекратить.

Примечание:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2 2 1 1             |2                   |
|  | 3                  |                    |
|1 | 5 2 2 1            |                    |
|  | 3 3 3 1.5          |                    |
|  | 8 8 8 1            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_840 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}