package acmp;

/* acmp.ru   |   Задание №363
		Длинное произведение
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
Даны целые неотрицательные числа M и N. Требуется найти произведение этих чисел.

Входные данные
Входной файл INPUT.TXT содержит в первой строке число M, а во второй строке – число N. (0 ≤ M, N ≤ 10^2500)

Выходные данные
В выходной файл OUTPUT.TXT выведите произведение чисел M и N.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |35                  |
|1 |7                   |                    |
|--|--------------------|--------------------|
|  |4134937827592       |3241791256832128    |
|2 |784                 |                    |
|--|--------------------|--------------------|
|  |9876543210          |10108215200126352690|
|3 |1023456789          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_363 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}