package acmp;

/* acmp.ru   |   Задание №679
		Просто простые числа
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
Дано натуральное число N. Представить его в виде суммы простых натуральных чисел так, чтобы произведение этих слагаемых было максимально.

Входные данные
В единственной строке входного файла INPUT.TXT записано одно натуральное число N (2 ≤ N ≤ 2 000 000 000).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести простые числа по возрастанию с указанием их количества при разложении, т.е.: &lt;число&gt; &lt;количество&gt;.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5                   |2 1 3 1             |
|2 |30                  |3 10                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_679 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}