package acmp;

/* acmp.ru   |   Задание №180
		Счастливая страница
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
В новом выпуске Большой Галактической Энциклопедии N страниц. Петя считает страницу счастливой, если произведение цифр, входящих в ее номер, равно K. Например, если N=100, то для K=42 есть счастливая страница (например, с номером 76), а для K=128 счастливой страницы нет.

Требуется написать программу, которая поможет Пете определить, есть ли счастливые страницы в новом выпуске энциклопедии.

Входные данные
Входной текстовый файл INPUT.TXT содержит числа N (1 ≤ N ≤ 10^9) и K (1 ≤ K ≤ 10^9), записанные через пробел.

Выходные данные
Выходной текстовый файл OUTPUT.TXT должен содержать «YES», если счастливые страницы есть, и «NO» иначе.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |100 42              |YES                 |
|2 |100 128             |NO                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_180 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}