package acmp;

/* acmp.ru   |   Задание №590
		Зазеркалье
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Дано множество из N точек в декартовой системе координат. Требуется определить, является ли это множество центрально-симметричным.



Входные данные
В первой строке входного файла INPUT.TXT записано натуральное число N, не превышающее 1000. В следующих N строках записаны по три целых числа x, y, z, обозначающие координаты точки. Все точки попарно различны. Все координаты не превышают по модулю 2&times;10^9.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести Yes, если множество является центрально-симметричным и No в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |Yes                 |
|1 |0 0 0               |                    |
|  |5 7 3               |                    |
|--|--------------------|--------------------|
|  |3                   |No                  |
|  | 0 0 5              |                    |
|2 | 5 0 0              |                    |
|  | 0 5 0              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_590 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}