package acmp;

/* acmp.ru   |   Задание №318
		Следующее число
(Время: 0,5 сек. Память: 16 Мб Сложность: 36%)
Задано натуральное число N.

Требуется написать программу, которая найдет следующее за ним число, в двоичном разложении которого столько же единиц, сколько в двоичном разложении числа N.

Входные данные
Входной файл INPUT.TXT содержит одно натуральное число N (N ≤ 2^30).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |2                   |
|2 |2                   |4                   |
|3 |3                   |5                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_318 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}