package acmp;

/* acmp.ru   |   Задание №788
		Интересная игра c числами
(Время: 1 сек. Память: 16 Мб Сложность: 48%)
Рассмотрим следующую интересную игру для двух игроков. Для этой игры необходима таблица из 2-х строк и N столбцов, в клетках которой записаны натуральные числа, следующего вида:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1                   |1                   |
|1 |1 1                 |                    |
|--|--------------------|--------------------|
|  |2                   |0                   |
|2 |1 1                 |                    |
|  |1 1                 |                    |
|--|--------------------|--------------------|
|  |3                   |2                   |
|  |1 2                 |                    |
|3 |3 4                 |                    |
|  |5 6                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_788 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}