package acmp;

/* acmp.ru   |   Задание №25
		Больше-меньше
(Время: 1 сек. Память: 16 Мб Сложность: 3%)
Одна из основных операций с числами – их сравнение. Мы подозреваем, что вы в совершенстве владеете этой операцией и можете сравнивать любые числа, в том числе и целые. В данной задаче необходимо сравнить два целых числа.

Входные данные
В двух строчках входного файла INPUT.TXT записаны числа A и B, не превосходящие по абсолютной величине 2&times;10^9.

Выходные данные
Запишите в выходной файл OUTPUT.TXT один символ "&lt;", если A &lt; B, "&gt;", если A &gt; B и "=", если A=B.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |&lt;                |
|1 |7                   |                    |
|--|--------------------|--------------------|
|  |-7                  |&gt;                |
|2 |-12                 |                    |
|--|--------------------|--------------------|
|  |13                  |=                   |
|3 |13                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_025 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}