package acmp;

/* acmp.ru   |   Задание №832
		Игра в фишки
(Время: 1 сек. Память: 16 Мб Сложность: 48%)
Вот уже 10 лет дядя Семен работает сторожем на складе, где хранятся старые процессоры. Его работа чрезвычайно скучна, поэтому все рабочее время он играет в увлекательную игру.

Семен берет A фишек красного цвета, B фишек синего цвета и C зеленого цвета. За один ход он может заменить две фишки разных цветов на одну фишку третьего цвета. Считается, что Семен «сыграл» игру, если после некоторого количества ходов осталась одна фишка.

За 10 лет Семен так научился играть в эту игру, что для произвольных неотрицательных A, B, C он сразу может сказать: можно ли «сыграть» игру или нет.

Ваша задача – научиться это делать за более короткий срок.

Входные данные
В первой строке входного файла INPUT.TXT записано натуральное число N – число тестов (1 ≤ N ≤ 1000). В каждой из последующих N строк содержится тест: три целых числа: A, B и C (0 ≤ A, B, C ≤ 2^63 &#x2212; 1).

Выходные данные
В выходной файл OUTPUT.TXT для каждого теста выведите «Yes», если «сыграть» игру можно, иначе выведите «No». Ответ для каждого теста должен располагаться в отдельной строке.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2                   |Yes                 |
|1 |1 0 0               |No                  |
|  |1 1 1               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_832 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}