package acmp;

/* acmp.ru   |   Задание №18
		Факториал
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Требуется вычислить факториал целого числа N. Факториал обозначают как N! и вычисляют по формуле:

N! = 1 * 2 * 3 * … * (N-1) * N, причем 0! = 1.

Так же допустимо рекуррентное соотношение: N! = (N-1)! * N

Входные данные
В единственной строке входного файла INPUT.TXT записано одно целое неотрицательное число N (N &lt; 1000).

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести одно целое число — значение N!.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |3                   |6                   |
|3 |5                   |120                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_018 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}