package acmp;

/* acmp.ru   |   Задание №462
		Числа
(Время: 1 сек. Память: 16 Мб Сложность: 36%)
Задано натуральное число N. Требуется написать программу, которая находит количество натуральных чисел, не превышающих N и не делящихся ни на одно из чисел 2, 3, 5.

Входные данные
Входной файл INPUT.TXT содержит число N (1 ≤ N ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |10                  |2                   |
|2 |20                  |6                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_462 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}