package acmp;

/* acmp.ru   |   Задание №250
		Двоякие числа
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Натуральное число называется двояким, если в его десятичной записи встречается не более двух различных цифр. Например, числа 3, 23, 33, 100, 12121 — двоякие, а числа 123 и 9980 — нет.

Для заданного натурального числа N требуется найти ближайшее к нему двоякое число.

Входные данные
Во входном файле INPUT.TXT записано одно натуральное число N, не превосходящее 30 000.

Выходные данные
В выходной файл OUTPUT.TXT требуется выдать единственное число — ближайшее двоякое к числу N. Если таких чисел несколько, то следует вывести наименьшее.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |123                 |122                 |
|2 |2012                |2020                |
|3 |11111               |11111               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_250 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}