package acmp;

/* acmp.ru   |   Задание №608
		Про любовь
(Время: 1 сек. Память: 16 Мб Сложность: 70%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2 0                 |YES                 |
|  |-2 0                | 0.0 4.0            |
|1 |1                   |                    |
|  |-1 -2 1 2           |                    |
|--|--------------------|--------------------|
|  |2 0                 |NO                  |
|  |-2 0                |                    |
|  |3                   |                    |
|2 |-1 -1 1 1           |                    |
|  |-3 -3 -1 -1         |                    |
|  |-3 1 1 3            |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_608 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}