package acmp;

/* acmp.ru   |   Задание №341
		Числовая последовательность
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
Дима недавно поступил на работу в научно-исследовательский институт «Числовые Последовательности». Как следует из названия этого института, основным направлением его работы является проведение различных исследований в области числовых последовательностей.

Недавно руководитель отдела, где начал работать Дима, при решении одной из проблем столкнулся с весьма интересной последовательностью чисел a1, a2, …, an, …, которая определяется следующим образом: a1 = 0 и каждое последующее число ai (1 &lt; i ≤ n) определяется как наименьшее большее натуральное число, десятичная запись которого не содержит цифр, представленных в десятичной записи ai-1.

Требуется написать программу, которая по значению числа n вычисляет величину an.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (N ≤ 500).

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое число aN.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |0                   |
|2 |28                  |911                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_341 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}