package acmp;

/* acmp.ru   |   Задание №726
		Остатки
(Время: 1 сек. Память: 16 Мб Сложность: 55%)
Саша устроился программистом в одну серьезную компанию. Однажды к нему зашел начальник и сказал: «Саша, что за бред выдает твоя программа? В одном месте у нее получается, что число 3&#x2219;n - нечетное, а в другом - что число 5&#x2219;n делится на 10. Ну и как такое может быть? У тебя что, по математике в школе было?». По математике у Саши была твердая тройка, поэтому, чтобы больше не попадать в такие неприятные ситуации, он просит вас написать программу, проверяющую, может ли число a&#x2219;n давать остаток b по модулю c, и в то же время число d&#x2219;n давать остаток e по модулю f.

Входные данные
Входной файл INPUT.TXT содержит шесть целых чисел: a, b, c, d, e и f (1 ≤ a, c, d, f ≤ 10^9, 0 ≤ b ≤ c, 0 ≤ e ≤ f).

Выходные данные
Выведите в выходной файл OUTPUT.TXT строку «YES», если это возможно и «NO» в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 1 2 5 0 10        |NO                  |
|2 |3 1 2 5 5 10        |YES                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_726 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}