package acmp;

/* acmp.ru   |   Задание №800
		Делители - 2
(Время: 2 сек. Память: 16 Мб Сложность: 55%)
Натуральное число a называется делителем натурального числа b, если b = ac для некоторого натурального числа c. Например, делителями числа 6 являются числа 1, 2, 3 и 6. Два числа называются взаимно простыми, если у них нет общих делителей кроме 1. Например, 16 и 27 взаимно просты, а 18 и 24 – нет.

Будем называть нормальным набор из k чисел (a1, a2, …, ak), если выполнены следующие условия:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |90 3                |16                  |
|2 |10 2                |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_800 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}