package acmp;

/* acmp.ru   |   Задание №567
		Упаковка подарка
(Время: 1 сек. Память: 16 Мб Сложность: 83%)
Для упаковки подарка Роме нужно сделать из фольги конус с нижним основанием радиуса r и длиной образующей l.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 2 2               |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_567 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}