package acmp;

/* acmp.ru   |   Задание №705
		Оценка
(Время: 1 сек. Память: 16 Мб Сложность: 65%)
Вася очень любит программировать. Еще он очень любит научную фантастику. Как-то на каникулах, начитавшись книжек со своим другом Петей, Вася решил вывести формулу, показывающую рост популяции на Марсе. По прикидкам Васи после N лет жизни планеты популяция марсиан должна составлять SN марсиан, где SN определяется по формуле:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1000              |0                   |
|2 |2 1000              |2                   |
|2 |8 427               |328                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_705 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}