package acmp;

/* acmp.ru   |   Задание №36
		Постулат Бертрана
(Время: 1 сек. Память: 16 Мб Сложность: 30%)
Постулат Бертрана (теорема Бертрана-Чебышева, теорема Чебышева) гласит, что для любого n &gt; 1 найдется простое число p в интервале n &lt; p &lt; 2n. Такая гипотеза была выдвинута в 1845 году французским математиком Джозефем Бертраном (проверившим ее до n=3000000) и доказана в 1850 году Пафнутием Чебышевым. Раманужан в 1920 году нашел более простое доказательство, а Эрдеш в 1932 – еще более простое.

Ваша задача состоит в том, чтобы решить несколько более общую задачу – а именно по числу n найти количество простых чисел p из интервала n &lt; p &lt; 2n.

Напомним, что число называется простым, если оно делится только само на себя и на единицу.

Входные данные
Входной файл INPUT.TXT содержит целое число n (2 ≤ n ≤ 50000).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число – ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |1                   |
|2 |239                 |39                  |
|3 |3000                |353                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_036 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}