package acmp;

/* acmp.ru   |   Задание №933
		Телефон
(Время: 1 сек. Память: 16 Мб Сложность: 12%)
Услуги телефонной сети оплачиваются по следующему правилу: за разговоры до А минут в месяц – В рублей за минуту, а разговоры сверх установленной нормы оплачиваются из расчета С рублей за минуту. Требуется написать программу, вычисляющую плату за пользование телефоном для разговоров продолжительностью Т минут в месяц.

Входные данные
Первая строка входного файла INPUT.TXT содержит натуральные числа через пробел A, B, C и T, не превышающие 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите единственное целое число – месячную плату за пользование телефоном.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |30 2 3 30           |60                  |
|2 |20 1 3 30           |50                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_933 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}