package acmp;

/* acmp.ru   |   Задание №465
		Последовательности из 0 и 1
(Время: 1 сек. Память: 16 Мб Сложность: 47%)
Рассмотрим последовательности длины N, состоящие из 0 и 1. Требуется написать программу, которая по заданному натуральному числу N определяет количество тех из них, в которых никакие две единицы не стоят рядом.

Входные данные
Входной файл INPUT.TXT содержит число N (1 ≤ N ≤ 1000).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |3                   |
|2 |3                   |5                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_465 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}