package acmp;

/* acmp.ru   |   Задание №455
		Умножение дроби
(Время: 1 сек. Память: 16 Мб Сложность: 64%)
Задана некоторая правильная периодическая дробь Q и натуральное число N.

Требуется написать программу, которая определяет результат умножения Q на N, то есть непериодическую часть и минимальный период числа Q&times;N. В случае получения результата умножения в виде конечной дроби скобки опускаются.

Входные данные
Входной файл INPUT.TXT в первой строке содержит число Q, во второй строке записано число N. В записи числа Q используется не более 100 цифр. При изображении дроби Q периодическая часть заключается в круглые скобки. N – натуральное число, не превосходящее 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите результат умножения Q на N.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |0.1(6)              |0.5                 |
|1 |3                   |                    |
|--|--------------------|--------------------|
|  |12.(3)              |24.(6)              |
|2 |2                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_455 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}