package acmp;

/* acmp.ru   |   Задание №460
		Пятерки
(Время: 1 сек. Память: 16 Мб Сложность: 57%)
Задано натуральное N. Требуется написать программу, которая определит количество цифр 5 в записи всех натуральных чисел от 1 до N включительно.

Входные данные
Во входном файле INPUT.TXT в единственной строке задается число N ≤ 10^18.

Выходные данные
В выходной файл OUTPUT.TXT записывается найденное число – количество пятерок.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |27                  |3                   |
|2 |120                 |22                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_460 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}