package acmp;

/* acmp.ru   |   Задание №516
		2-простое число
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Число называется 2-простым, если являются простыми числа, составленные из цифр этого числа в возрастающем и убывающем порядках.

Требуется написать программу, которая по заданному числу определит его 2-простоту.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (10 &lt; N &lt; 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите сообщение «Yes», если число N является 2-простым и «No» - иначе.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |13                  |Yes                 |
|2 |23                  |No                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_516 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}