package acmp;

/* acmp.ru   |   Задание №836
		Четно-нечетная задача
(Время: 2 сек. Память: 16 Мб Сложность: 26%)
Задано n чисел a1, a2, ... , an. Выберите из них четные числа, у которых третья справа цифра в их представлении в восьмеричной системе счисления нечетна.

Выбранные числа отсортируйте по неубыванию и выведите в выходной файл.

Входные данные
Первая строка входного файла INPUT.TXT содержит целое число n (1 ≤ n ≤ 10^5). Вторая строка входного файла содержит n целых чисел: a1, a2, ... , an. Они отделены друг от друга пробелами и заданы в десятичной системе счисления. Для всех i (1 ≤ i ≤ n ) верно неравенство 64 ≤ ai ≤ 10^9.

Выходные данные
В первой строке выходного файла OUTPUT.TXT выведите количество k искомых чисел. Во второй строке выведите эти числа в указанном порядке в десятичной системе счисления.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |3                   |
|1 |100 64 64 130       |64 64 100           |
|--|--------------------|--------------------|
|  |3                   |0                   |
|2 |128 129 130         |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_836 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}