package acmp;

/* acmp.ru   |   Задание №753
		Различные слова
(Время: 3 сек. Память: 64 Мб Сложность: 52%)
Дана строка S, состоящая из N символов. Назовем ее подстрокой Sij строку с i-го по j-й символ (i ≤ j). Ваша задача — посчитать количество различных подстрок заданной строки.

Входные данные
Входной файл INPUT.TXT содержит одну непустую строку S, состоящую из маленьких английских букв, длиной не более чем 1024 символа.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число — количество различных подстрок строки S.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |abc                 |6                   |
|2 |aaa                 |3                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_753 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}