package acmp;

/* acmp.ru   |   Задание №337
		Лампочки
(Время: 2 сек. Память: 16 Мб Сложность: 94%)
Имеется ряд из N лампочек, которые пронумерованы от 1 до N. Изначально ни одна из лампочек не горит. Далее происходит K последовательных линейных инверсий этого ряда ламп. Под линейной инверсией понимается инверсия каждой P-й лампочки в ряде. Например, если P=3, то произойдет инверсия 3й, 6й, 9й и т.д. лампочек.

Требуется определить: сколько горящих лампочек останется после реализации всех заданных линейных инверсий?

Входные данные
В первой строке входного файла INPUT.TXT заданы числа N и K – число лампочек и число линейных инверсий. Вторая строка состоит из K целых чисел Pi, задающих период данных инверсий. (1 ≤ N ≤ 10^9, 1 ≤ K ≤ 100, 1 ≤ Pi ≤ 50)

Выходные данные
В выходной файл OUTPUT.TXT следует вывести ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |20 3                |8                   |
|1 |2 3 8               |                    |
|--|--------------------|--------------------|
|  |172 10              |99                  |
|2 |19 2 7 13 40 23 16 1 45 9|                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_337 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}