package acmp;

/* acmp.ru   |   Задание №793
		Числа Смита
(Время: 1 сек. Память: 16 Мб Сложность: 30%)
Число Смита — такое составное число, сумма цифр которого равняется сумме цифр всех его простых сомножителей. Так, примером числа Смита может служить 202, поскольку 2 + 0 + 2 = 4 и 2 + 1 + 0 + 1 = 4 (202 = 2 * 101). Напишите программу, которая для заданной последовательности чисел определяет, какие из них являются числами Смита.

Входные данные
Входной файл INPUT.TXT содержит не более 20 натуральных чисел в пределах от 4 до 10^6.

Выходные данные
В выходной файл OUTPUT.TXT выведите строку из 0 и 1 (1, если соответствующее число является числом Смита и 0 иначе).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 20 17 202         |1001                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_793 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}