package acmp;

/* acmp.ru   |   Задание №40
		2^N
(Время: 1 сек. Память: 16 Мб Сложность: 30%)
Необходимо вычислить значение 2^n.

Входные данные
В единственной строке входного файла INPUT.TXT записано натуральное число n (0 &lt; n &lt; 1000).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести значение 2^n.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |8                   |
|2 |10                  |1024                |
|3 |72                  |4722366482869645213696|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_040 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}