package acmp;

/* acmp.ru   |   Задание №196
		Спираль
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
<img src="/asp/article/image.asp?id=211" align="right" alt="Спираль"> Требуется вывести квадрат, состоящий из N&times;N клеток, заполненных числами от 1 до N^2 по спирали (см. примеры).

Входные данные
Во входном файле INPUT.TXT задано целое число N – размер квадратной матрицы (2 ≤ N ≤ 100).

Выходные данные
В выходной файл OUTPUT.TXT выведите матрицу, заполненную числами от 1 до N^2 по спирали, при этом между числами может быть любое количество пробелов. Не допускается начинать спираль в ином, кроме верхнего левого, углу, закручивать спираль против часовой стрелки или изнутри наружу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |1 2 3               |
|1 |                    | 8 9 4              |
|  |                    | 7 6 5              |
|--|--------------------|--------------------|
|  |4                   |&nbsp;1&nbsp; 2&nbsp; 3&nbsp; 4|
|  |                    | 12 13 14&nbsp; 5   |
|2 |                    | 11 16 15&nbsp; 6   |
|  |                    | 10&nbsp; 9&nbsp; 8&nbsp; 7|
|--|--------------------|--------------------|
|  |5                   |&nbsp;1 &nbsp;2 &nbsp;3 &nbsp;4&nbsp;&nbsp;5|
|  |                    | 16 17 18 19 &nbsp;6|
|3 |                    | 15 24 25 20 &nbsp;7|
|  |                    | 14 23 22 21 &nbsp;8|
|  |                    | 13 12 11 10 &nbsp;9|
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_196 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}