package acmp;

/* acmp.ru   |   Задание №823
		Мусорщик
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |7                   |18                  |
|  |2 1                 |                    |
|  |3 2                 |                    |
|  |5 2                 |                    |
|1 |5 4                 |                    |
|  |1 4                 |                    |
|  |3 6                 |                    |
|  |6 6                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_823 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}