package acmp;

/* acmp.ru   |   Задание №367
		Степень - 2
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
Для натуральных чисел A и N требуется вычислить значение A^N.

Входные данные
Входной файл INPUT.TXT в первой строке содержит числа A и N, разделенные пробелом. (1 ≤ A ≤ 9, 1 ≤ N ≤ 7000)

Выходные данные
В выходной файл OUTPUT.TXT выведите одно число – результат возведения в степень, без лидирующих нулей.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 20                |3486784401          |
|2 |2 16                |65536               |
|3 |5 50                |88817841970012523233890533447265625|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_367 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}