package acmp;

/* acmp.ru   |   Задание №425
		Прямая и квадраты
(Время: 1 сек. Память: 16 Мб Сложность: 49%)
В прямоугольной декартовой системе координат прямая задана двумя принадлежащими ей точками (0, W) и (100•N, E). Также заданы N^2 квадратов со сторонами, параллельными осям координат. Квадрат Si,j имеет координаты углов (100•i, 100•j) и (100•i - 100, 100•j - 100), i, j = 1, 2, ..., N.

Требуется найти количество квадратов, имеющих общую точку с прямой.

Входные данные
Входной файл INPUT.TXT содержит в одной строке числа N, W и E, разделенные пробелами. (1 ≤ N ≤ 100, 0 ≤ W, E ≤ 100•N)

Выходные данные
В выходной файл OUTPUT.TXT выведите количество квадратов, имеющих общую точку с заданной прямой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 150 50            |4                   |
|2 |2 110 120           |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_425 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}