package acmp;

/* acmp.ru   |   Задание №395
		Произведение цифр - 2
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Найдите количество чисел из отрезка [L, R], которые делятся на произведение своих цифр.

Входные данные
Входной файл INPUT.TXT содержит два целых числа L и R. (1 ≤ L ≤ R ≤ 10^9, |R-L| ≤ 10^5)

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 12                |11                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_395 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}