package acmp;

/* acmp.ru   |   Задание №182
		Прямоугольник - 2
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Заданы координаты трех вершин прямоугольника. Необходимо определить координаты четвертой вершины.

Входные данные
Во входном файле INPUT.TXT записаны через пробел координаты трех вершин прямоугольника в произвольном порядке в формате x1 y1 x2 y2 x3 y3. Все числа целые, не превосходящие 1000 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести через пробел координаты четвертой вершины прямоугольника.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |0 3 0 0 5 0         |5 3                 |
|2 |1 4 8 3 7 6         |2 1                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_182 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}