package acmp;

/* acmp.ru   |   Задание №896
		Торт - 2
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
Никифор на день рождения собирается угостить друзей тортом. Известно, что на дне рождения может быть либо M, либо N человек, включая самого именинника. На какое минимальное количество частей ему нужно разрезать торт (не обязательно всех равных), чтобы при любом из указанных количеств собравшихся, все съели торт поровну?

Входные данные
Входной файл INPUT.TXT содержит два натуральных числа M и N через пробел (1 ≤ M, N ≤ 30000).

Выходные данные
В выходной файл OUTPUT.TXT выведите единственное число – искомое минимальное количество кусочков торта.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 3                 |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_896 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}