package acmp;

/* acmp.ru   |   Задание №808
		Про любовь ...
(Время: 1 сек. Память: 16 Мб Сложность: 70%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |0 0 -1 3            |1.6                 |
|  | 4 4 7 7            |                    |
|1 | 3 0                |                    |
|  | 0 -1               |                    |
|--|--------------------|--------------------|
|  |0 0 -1 3            |-1                  |
|  | 4 4 7 7            |                    |
|2 | 1 0                |                    |
|  | 0 -3               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_808 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}