package acmp;

/* acmp.ru   |   Задание №948
		Строки в книге
(Время: 1 сек. Память: 16 Мб Сложность: 13%)
В книге на одной странице помещается K строк. Таким образом, на 1-й странице печатаются строки с 1-й по K-ю, на второй — с (K+1)-й по (2&#x2219;K)-ю и т.д. Напишите программу, которая по номеру строки в тексте определяет номер страницы, на которой будет напечатана эта строка, и порядковый номер этой строки на странице.

Входные данные
Первая строка входного файла INPUT.TXT содержит два числа через пробел: K – количество строк, которое печатается на странице, и число N – номер строки (1 ≤ K ≤ 200, 1 ≤ N ≤ 20000).

Выходные данные
В выходной файл OUTPUT.TXT выведите два числа – номер страницы, на которой будет напечатана эта строка и номер строки на странице.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |50 1                |1 1                 |
|2 |20 25               |2 5                 |
|3 |15 43               |3 13                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_948 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}