package acmp;

/* acmp.ru   |   Задание №604
		Кактусы
(Время: 1 сек. Память: 16 Мб Сложность: 78%)
<i>Вершинный кактус</i> - это связный неориентированный граф, каждая вершина которого лежит не более, чем на одном простом цикле.

Дерево можно превратить в кактус, добавив в него несколько ребер (поскольку дерево само является кактусом, то можно не добавлять ребер вообще). Вообще говоря, может существовать несколько способов превратить дерево в кактус. Количество способов сделать это назовем <i>кактусастостью</i> дерева.

Например, кактусастость дерева, изображенного на картинке слева, равна 12. Двенадцать кактусов, в которые оно может быть превращено, изображены справа.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |6                   |12                  |
|  | 1 3                |                    |
|  | 2 3                |                    |
|1 | 3 4                |                    |
|  | 4 5                |                    |
|  | 4 6                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_604 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}