package acmp;

/* acmp.ru   |   Задание №432
		Грядки
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
Прямоугольный садовый участок шириной N и длиной M метров разбит на квадраты со стороной 1 метр. На этом участке вскопаны грядки. Грядкой называется совокупность квадратов, удовлетворяющая таким условиям:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5 10                |3                   |
|  | ##......#.         |                    |
|  | .#..#...#.         |                    |
|1 | .###....#.         |                    |
|  | ..##....#.         |                    |
|  | ........#.         |                    |
|--|--------------------|--------------------|
|  |5 10                |5                   |
|  | ##..#####.         |                    |
|  | .#.#.#....         |                    |
|2 | ###..##.#.         |                    |
|  | ..##.....#         |                    |
|  | .###.#####         |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_432 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}