package acmp;

/* acmp.ru   |   Задание №115
		Прямоугольник
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Задан целочисленный прямоугольный массив M&times;N. Необходимо определить прямоугольную область данного массива, сумма элементов которого максимальна.

Входные данные
В первой строке входного файла INPUT.TXT записаны два натуральных числа N и M (1 ≤ N, M ≤ 100) – количество строк и столбцов прямоугольной матрицы. Далее идут N строк по M чисел, записанных через пробел – элементы массива, целые числа, не превосходящие 100 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести целое число – сумму элементов найденного прямоугольного подмассива. Подмассив должен содержать хотя бы один элемент.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2 3                 |24                  |
|1 | 5 0 9              |                    |
|  | 1 2 7              |                    |
|--|--------------------|--------------------|
|  |4 5                 |20                  |
|  | -7 8 -1 0 -2       |                    |
|2 | 2 -9 2 4 -6        |                    |
|  | -7 0 6 8 1         |                    |
|  | 4 -8 -1 0 -6       |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_115 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}