package acmp;

/* acmp.ru   |   Задание №847
		Анаграмма-2
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
Катя и Таня играли в слова. Одна из девочек называла слово на английском языке, вторая должна найти анаграмму. Анаграмма – это слово, полученное из другого слова путем перестановки всех без исключения букв первого слова.

Написать программу, которая проверит, правильно ли девочки создают анаграммы.

Входные данные
Входной файл INPUT.TXT содержит два слова на английском языке в нижнем регистре, разделенные пробелом. Каждое слово содержит от 1 до 20 символов.

Выходные данные
В выходной файл OUTPUT.TXT выведите «YES», если анаграмма подобрана правильно, иначе выведите «NO».

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |post stop           |YES                 |
|2 |post pots           |NO                  |
|3 |aabb aabb           |NO                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_847 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}