package acmp;

/* acmp.ru   |   Задание №550
		День программиста
(Время: 1 сек. Память: 16 Мб Сложность: 13%)
День программиста отмечается в 255-й день года (при этом 1 января считается нулевым днем). Требуется написать программу, которая определит дату (месяц и число григорианского календаря), на которую приходится День программиста в заданном году.

В григорианском календаре високосным является:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2000                |12/09/2000          |
|2 |2009                |13/09/2009          |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_550 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}