package acmp;

/* acmp.ru   |   Задание №619
		Бросание кубика
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Кубик, грани которого помечены цифрами от 1 до 6, бросают N раз. Требуется найти вероятность того, что сумма выпавших чисел будет равна Q.

Входные данные
Входной файл INPUT.TXT содержит натуральные числа N и Q (N ≤ 500, Q ≤ 3000).

Выходные данные
В выходной файл OUTPUT.TXT выведите единственное вещественное число – искомую вероятность, которая должна отличаться от истинного значения не более чем на 10^-6.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 6                 |0.166667            |
|2 |1 7                 |0                   |
|3 |4 14                |0.112654            |
|4 |100 100             |1.530647E-78        |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_619 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}