package acmp;

/* acmp.ru   |   Задание №374
		Выпуклая оболочка - 2
(Время: 1 сек. Память: 16 Мб Сложность: 55%)
На плоскости заданы N точек своими декартовыми координатами. Найти минимальный периметр многоугольника, содержащего все эти точки. Гарантируется, что искомый многоугольник имеет ненулевую площадь.

Входные данные
Входной файл INPUT.TXT в первой строке содержит число N, далее - N строк с парами координат (xi, yi). Ограничения: 3 ≤ N ≤ 1000, -10 000 ≤ xi, yi ≤ 10 000, все числа целые, все точки различны.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно вещественное число - длину периметра полученного многоугольника с одним знаком после запятой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |5.7                 |
|  | 1 0                |                    |
|  | 0 1                |                    |
|1 | -1 0               |                    |
|  | 0 -1               |                    |
|  | 0 0                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_374 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}