package acmp;

/* acmp.ru   |   Задание №605
		Дартс
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |7                   |
|  |                    | 1 D1 D1            |
|  |                    | 1 2 D1             |
|  |                    | 1 D2               |
|1 |                    | D1 1 D1            |
|  |                    | T1 D1              |
|  |                    | 2 1 D1             |
|  |                    | 3 D1               |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_605 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}