package acmp;

/* acmp.ru   |   Задание №631
		Отгадай число
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
Двое играют в игру. Первый игрок (ведущий) загадал число от 1 до N. Второй хочет отгадать это число. Для достижения цели он задает вопросы. Каждый вопрос имеет вид: «Содержится ли загаданное число в наборе S?», где S - произвольный набор чисел от 1 до N. В случае положительного ответа второй игрок платит две конфеты ведущему, в противном случае - одну.

Какое наименьшее количество конфет должен иметь второй игрок, чтобы наверняка суметь отгадать число?

Входные данные
Входной файл INPUT.TXT содержит целое число N (1 ≤ N ≤ 10^5).

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое количество конфет.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |6                   |5                   |
|2 |2                   |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_631 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}