package acmp;

/* acmp.ru   |   Задание №447
		Последняя цифра N!
(Время: 1 сек. Память: 16 Мб Сложность: 39%)
Требуется найти последнюю ненулевую цифру числа N! = 1*2*3*…*N.

Входные данные
Входной файл INPUT.TXT содержит единственное натуральное число N (N ≤ 9999).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1                   |1                   |
|2 |5                   |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_447 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}