package acmp;

/* acmp.ru   |   Задание №946
		Полка
(Время: 1 сек. Память: 16 Мб Сложность: 31%)
У Андрея есть младший брат Ванечка, который очень любит смотреть мультики. Ванечка вечно разбрасывал по дому и терял свои DVD с мультиками. Поэтому на день рождения Андрей подарил брату длинную полку для того, чтобы Ванечка ставил на нее свои диски. Чтобы на полке был порядок, Андрей просил Ванечку соблюдать простой порядок:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |3 2                 |
|  |1 1                 |                    |
|  |2 2                 |                    |
|1 |1 3                 |                    |
|  |3                   |                    |
|  |4                   |                    |
|--|--------------------|--------------------|
|  |2                   |1                   |
|2 |1 1                 |                    |
|  |3                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_946 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}