package acmp;

/* acmp.ru   |   Задание №207
		Клад
(Время: 1 сек. Память: 16 Мб Сложность: 28%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |6                   |3.000 2.000         |
|  | 1 3                |                    |
|  | 3 1                |                    |
|1 | 1 1                |                    |
|  | 3 3                |                    |
|  | 5 2                |                    |
|  | 7 1                |                    |
|--|--------------------|--------------------|
|  |1                   |-7.071 7.071        |
|2 | 8 10               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_207 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}