package acmp;

/* acmp.ru   |   Задание №144
		A*B
(Время: 1 сек. Память: 16 Мб Сложность: 37%)
Даны два целых неотрицательных числа A и B. Требуется найти их произведение.

Входные данные
Во входном файле INPUT.TXT записаны целые неотрицательные числа A и B по одному в строке (A &lt; 10^100, B ≤ 10000).

Выходные данные
В выходной файл OUTPUT.TXT выведите единственное число без лидирующих нулей: A*B.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5                   |35                  |
|1 |7                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_144 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}