package acmp;

/* acmp.ru   |   Задание №821
		Пятнашки
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |8 1 3               |
|1 |ULDLURULD           | 0 2 5              |
|  |                    | 4 7 6              |
|--|--------------------|--------------------|
|  |2                   |ERROR 2             |
|2 |URL                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_821 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}