package acmp;

/* acmp.ru   |   Задание №249
		Скобки
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Назовем строку S правильной скобочной последовательностью, если она состоит только из символов '{', '}', '[', ']', '(', ')' и выполнено хотя бы одно из следующих трех условий:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |{(})                |2                   |
|2 |([{}])              |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_249 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}