package acmp;

/* acmp.ru   |   Задание №488
		Праздничный торт
(Время: 1 сек. Память: 16 Мб Сложность: 58%)
На дне рождения Пети на стол подали круглый торт, украшенный разноцветными розочками. Причем, на торте было ровно по две небольших розочки каждого цвета, а различных цветов было ровно K. Тем самым, общее число розочек было равно 2*K.

Одноклассник Пети Вася, славящийся своими математическими способностями, разрезал торт прямолинейными разрезами так, что каждый разрез прошел через две розочки одинакового цвета. (Понятно, что таких разрезов оказалось ровно K.)

При этом оказалось, что:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 1                 |2                   |
|1 |-1 -1 1 1           |                    |
|--|--------------------|--------------------|
|  |5 3                 |6                   |
|  |1 4 1 -3            |                    |
|2 |-3.5 0 4 1.5        |                    |
|  |-3 3 0 -4           |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_488 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}