package acmp;

/* acmp.ru   |   Задание №497
		Индикатор
(Время: 1 сек. Память: 16 Мб Сложность: 52%)
Недавно Вася приобрел настольный калькулятор с жидкокристаллическим индикатором. Этот индикатор отображает N цифр с помощью N одинаковых элементов.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |5 15                |10117               |
|1 |                    |97111               |
|--|--------------------|--------------------|
|2 |10 1                |NO SOLUTION         |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_497 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}