package acmp;

/* acmp.ru   |   Задание №593
		Башни - 2
(Время: 1 сек. Память: 16 Мб Сложность: 53%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |11                  |2                   |
|  | 0 4                | 5                  |
|  | 3 5                | 4                  |
|  | 5 3                | 4                  |
|  | 6 4                | 4                  |
|  | 7 5                | 10                 |
|1 | 8 8                | 4                  |
|  | 10 5               | 4                  |
|  | 12 4               | 5                  |
|  | 14 3               | 3                  |
|  | 17 1               | 5                  |
|  | 19 7               |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_593 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}