package acmp;

/* acmp.ru   |   Задание №494
		Отрезок и окружности
(Время: 1 сек. Память: 16 Мб Сложность: 58%)
На плоскости задана система концентрических окружностей, центры которых находятся в начале координат, а радиусы равны 1, 2, 3, . . . . Также на плоскости задан отрезок, концы которого находятся в точках (x1, y1) и (x2, y2).

Необходимо найти число общих точек этого отрезка и указанной системы окружностей.

Входные данные
Входной файл INPUT.TXT содержит четыре целых числа: x1, y1, x2 и y2. Эти числа не превосходят 10^3 по абсолютной величине. Заданный отрезок имеет ненулевую длину.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – количество общих точек.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1 2 1             |1                   |
|2 |1 2 2 1             |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_494 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}