package acmp;

/* acmp.ru   |   Задание №526
		Уравнение по основанию
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
Запись AX обозначает, что A есть запись числа в системе счисления по основанию X. Если X&gt;10, то для записи числа используются кроме цифр от 0 до 9 заглавные английские буквы от A до Z. При этом условии X не может быть больше 36.

Требуется написать программу, которая по заданным A и B найдет решение уравнения AX = B, либо сообщит об отсутствии у него решений.

Входные данные
Входной файл INPUT.TXT содержит в первой строке число A (непустую последовательность цифр от 0 до 9 и заглавных английских букв от A до Z без ведущих нулей), во второй число B (1 ≤ B ≤ 10^7).

Выходные данные
В выходной файл OUTPUT.TXT выведите либо наименьшее основание системы счисления, удовлетворяющее уравнению, либо 0, если уравнение не имеет решений.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |A1                  |16                  |
|1 |161                 |                    |
|--|--------------------|--------------------|
|  |201                 |0                   |
|2 |26                  |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_526 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}