package acmp;

/* acmp.ru   |   Задание №766
		Орешки
(Время: 1 сек. Память: 16 Мб Сложность: 3%)
Белочка собрала в лесу N шишек c орешками. Белочка очень привередливо выбирала шишки, и брала только те, в которых ровно M орешков. Также известно, что для пропитания зимой ей необходимо не менее K орешков. Определите, хватит ли на зиму орешков белочке.

Входные данные
Первая строка входного файла INPUT.TXT содержит три натуральных числа через пробел: N, M и K (N, M ≤ 100, K ≤ 10 000).

Выходные данные
В выходной файл OUTPUT.TXT выведите «YES» если белочке хватит орешков и «NO» в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 5 20              |YES                 |
|2 |4 5 21              |NO                  |
|3 |3 2 1               |YES                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_766 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}