package acmp;

/* acmp.ru   |   Задание №428
		SMS
(Время: 1 сек. Память: 16 Мб Сложность: 74%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |1                   |
|1 |MAMA                |                    |
|--|--------------------|--------------------|
|  |2                   |2                   |
|2 |WWW                 |                    |
|--|--------------------|--------------------|
|  |80                  |0                   |
|3 |QUARTERFINAL        |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_428 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}