package acmp;

/* acmp.ru   |   Задание №309
		К-удивительные числа
(Время: 3 сек. Память: 16 Мб Сложность: 25%)
Переворотом числа X назовем число, в котором все цифры числа X стоят в обратном порядке. Например, переворотом числа 6372 является число 2736, а числа 7800 - 87. Назовем K-удивительным такое число, которое в сумме со своим переворотом дает число K.

Например, у числа 222 имеется всего два K-удивительных числа: 111 и 210, а у числа 1050 имеется девять K-удивительных числа: 129, 228, 327, 426, 525, 624, 723, 822, 921.

Требуется написать программу, которая по заданному K определит количество K-удивительных чисел.

Входные данные
Входной файл INPUT.TXT содержит одно натуральное число K (1 ≤ K ≤ 10^6).

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно число - количество K-удивительных чисел.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |222                 |2                   |
|2 |1050                |9                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_309 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}