package acmp;

/* acmp.ru   |   Задание №157
		Карточки
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
На день рождения Пете подарили набор карточек с буквами. Теперь Петя с большим интересом составляет из них разные слова. И вот, однажды, составив очередное слово, Петя заинтересовался вопросом: "А сколько различных слов можно составить из тех же карточек, что и данное?".

Помогите ему ответить на этот вопрос.

Входные данные
Во входном файле INPUT.TXT задано слово, составленное Петей - строка из маленьких английских букв не длиннее 15 символов.

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число - ответ на поставленную задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |solo                |12                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_157 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}