package acmp;

/* acmp.ru   |   Задание №520
		Оптовая покупка
(Время: 1 сек. Память: 16 Мб Сложность: 27%)
Пара носков стоит 10 руб. 50 коп., связка (12 пар) стоит 102 руб. 50 коп., а коробка (12 связок) стоит 1140 руб.

Требуется написать программу, которая по числу пар носков, которые хочет купить покупатель, вычисляет количества коробок, связок и пар носков, которые ему следует купить с наибольшей выгодой.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N (N ≤ 10^9) – число пар носков, которые желает купить покупатель.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать три числа (первое – количество коробок, второе – связок, третье – пар носков), разделенные пробелами.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |11                  |0 1 0               |
|2 |500                 |3 5 8               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_520 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}