package acmp;

/* acmp.ru   |   Задание №655
		Кодирование данных
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
В компании «Gold&amp;Silver Soft» разработан новый алгоритм кодирования натуральных чисел. Этот алгоритм основан на операции циклического сдвига числа.

Циклическим сдвигом натурального числа N относительно числа K назовем операцию переноса K крайних слева цифр в десятичной записи числа N к цифре крайней справа. Обозначим через cyclic(N, K) число, получаемое из N посредством циклического сдвига относительно числа K.

Введенное понятие можно проиллюстрировать на примерах:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |512                 |319                 |
|1 |1                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_655 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}