package acmp;

/* acmp.ru   |   Задание №16
		Лесенка
(Время: 1 сек. Память: 16 Мб Сложность: 55%)
<img src="/asp/article/image.asp?id=149" align="right"> Лесенкой называется набор кубиков, в котором каждый более верхний слой содержит кубиков меньше, чем предыдущий. Требуется написать программу, вычисляющую число лесенок, которое можно построить из N кубиков.

Входные данные
Во входном файле INPUT.TXT записано натуральное число N (1 ≤ N ≤ 100) – количество кубиков в лесенке.

Выходные данные
В выходной файл OUTPUT.TXT необходимо вывести число лесенок, которые можно построить из N кубиков.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |2                   |
|2 |6                   |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_16 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}