package acmp;

/* acmp.ru   |   Задание №175
		Наручные часы
(Время: 1 сек. Память: 16 Мб Сложность: 37%)
Вы приобрели новые электронные наручные часы с жидкокристаллическим дисплеем. Дисплей отображает часы и минуты с помощью четырех элементов, каждый из которых отображает одну цифру.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |00:00               |1200                |
|2 |02:39               |1041                |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_175 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}