package acmp;

/* acmp.ru   |   Задание №362
		Открытка и конверт
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Даны размеры прямоугольных открытки и конверта. Требуется определить, поместится ли открытка в конверте.

Входные данные
Входной файл INPUT.TXT содержит в первой строке размеры открытки, во второй строке заданы размеры конверта. Все размеры – натуральные числа, не превосходящие 100.

Выходные данные
В выходной файл OUTPUT.TXT выведите «Possible», если открытку можно разместить в конверте и «Impossible» в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1 10                |Possible            |
|1 |9 9                 |                    |
|--|--------------------|--------------------|
|  |10 15               |Possible            |
|2 |15 10               |                    |
|--|--------------------|--------------------|
|  |3 4                 |Impossible          |
|3 |3 3                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_362 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}