package acmp;

/* acmp.ru   |   Задание №482
		Короткая последовательность
(Время: 1 сек. Память: 16 Мб Сложность: 23%)
Дано целое число N. Рассмотрим последовательность S1S2S3...Sk..., где каждая группа цифр Sk состоит из записанных одно за другим чисел от 1 до k. Например, первые 75 цифр последовательности выглядят так:

112123123412345123456123456712345678123456789123456789101234567891011123456.

Требуется написать программу, которая определит: какая цифра находится на N-ой позиции в построенной последовательности.

Входные данные
Входной файл INPUT.TXT содержит одно число N (0 &lt; N &lt; 32768).

Выходные данные
В выходной файл OUTPUT.TXT выведите цифру, которая стоит на N-ой позиции в последовательности.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |2                   |
|2 |20                  |5                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_482 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}