package acmp;

/* acmp.ru   |   Задание №123
		Восстановление скобок
(Время: 1 сек. Память: 16 Мб Сложность: 54%)
Задан шаблон, состоящий из круглых скобок и знаков вопроса. Требуется определить, сколькими способами можно заменить знаки вопроса круглыми скобками так, чтобы получилось правильное скобочное выражение.

Входные данные
Единственная строка входного файла INPUT.TXT содержит заданный шаблон длиной от 1 до 80 символов.

Выходные данные
Выведите в выходной файл OUTPUT.TXT искомое количество способов. Исходные данные будут таковы, что это количество не превзойдет 2&times;10^9.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |????(?              |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_123 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}