package acmp;

/* acmp.ru   |   Задание №59
		Несложное вычисление
(Время: 1 сек. Память: 16 Мб Сложность: 25%)
Задано натуральное число n. Необходимо перевести его в k-ичную систему счисления и найти разность между произведением и суммой его цифр в этой системе счисления.

Например, пусть n = 239, k = 8. Тогда представление числа n в восьмеричной системе счисления — 357, а ответ на задачу равен 3 &times; 5 &times; 7 &#x2212; (3 + 5 + 7) = 90.

Входные данные
Входной файл INPUT.TXT содержит два натуральных числа: n и k (1 ≤ n ≤ 10^9, 2 ≤ k ≤ 10). Оба этих числа заданы в десятичной системе счисления.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу (в десятичной системе счисления).

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |239 8               |90                  |
|2 |1000000000 7        |-34                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_059 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}