package acmp;

/* acmp.ru   |   Задание №454
		Оставшееся число
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
Задан ряд последовательных натуральных чисел от M до N (M &lt; N), из которого удаляют сначала все числа, стоящие на нечетных местах. Затем, из оставшегося ряда удаляют все числа, стоящие в нем на четных местах. Эти действия повторяют до тех пор, пока не останется одно число.

Требуется написать программу, которая находит оставшееся число.

Входные данные
Входной файл INPUT.TXT содержит число M в первой строке и число N во второй (M &lt; N &lt; 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите оставшееся число.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1                   |2                   |
|1 |4                   |                    |
|--|--------------------|--------------------|
|  |2                   |7                   |
|2 |9                   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_454 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}