package acmp;

/* acmp.ru   |   Задание №610
		Прокладка труб
(Время: 1 сек. Память: 16 Мб Сложность: 82%)
В некоторых районах города строится система центрального отопления. Каждый район города имеет форму прямоугольника и состоит из квадратных кварталов. Система центрального отопления каждого из районов представляет собой замкнутую трубу.

Чтобы сантехникам не приходилось скучать, мэр города хочет, чтобы в каждом районе трубы были уложены по-разному. Труба в каждом районе должна быть уложена таким образом, чтобы она проходила через каждый квартал. При этом существует шесть способов проложить трубу внутри квартала:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4 4                 |6                   |
|2 |5 7                 |0                   |
|3 |2 8                 |1                   |
|4 |12 8                |102283239429        |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_610 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}