package acmp;

/* acmp.ru   |   Задание №458
		Шифровка - 2
(Время: 1 сек. Память: 16 Мб Сложность: 35%)
Для кодирования сообщения используют следующие действия: сообщение записывают, опуская пробелы, в прямоугольник заданной высоты по столбцам, а затем прочитывают строки в заданном порядке.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |ПРОГРАММИРОВАНИЕ    |
|1 | 3 1 2 4            |                    |
|  | ОМОИПРИАРАРНГМВЕ   |                    |
|--|--------------------|--------------------|
|  |2                   |физика              |
|2 | 2 1                |                    |
|  | ииафзк             |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_458 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}