package acmp;

/* acmp.ru   |   Задание №199
		Римские числа
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Необходимо сократить дробь, записанную в римской системе счисления. Напомним, что в римской записи используются символы M, D, C, L, X, V и I. Приведем таблицу с примерами перевода римских чисел в арабскую систему:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |II/IV               |I/II                |
|2 |XXIV/VIII           |III                 |
|3 |12/16               |ERROR               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_199 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}