package acmp;

/* acmp.ru   |   Задание №272
		Сумма максимума и минимума
(Время: 1 сек. Память: 32 Мб Сложность: 26%)
Задана последовательность целых чисел. Числа нумеруются по порядку следования, начиная с единицы.

Требуется написать программу, которая найдет сумму максимума из чисел с четными номерами и минимума из чисел с нечетными номерами – max{a2, a4, …}+min{a1, a3, …}.

Входные данные
Входной текстовый файл INPUT.TXT содержит в единственной строке последовательность от 2 до 2&times;10^5 целых чисел, которые по модулю не превышают 10000.

Выходные данные
Выходной текстовый файл OUTPUT.TXT должен содержать одно целое число - сумму максимума из чисел с четными номерами и минимума из чисел с нечетными номерами.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 2                 |3                   |
|2 |1 -2 3 -4 5         |-1                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_272 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}