package acmp;

/* acmp.ru   |   Задание №204
		Циклическая строка
(Время: 1 сек. Память: 16 Мб Сложность: 53%)
Строка S была записана много раз подряд, после чего из получившейся строки взяли подстроку и дали Вам. Ваша задача определить минимально возможную длину исходной строки S.

Входные данные
В единственной строке входного файла INPUT.TXT записана строка, которая содержит только английские буквы, длина строки не превышает 50000 символов.

Выходные данные
В выходной файл OUTPUT.TXT нужно вывести одно число - ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |abababa             |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_204 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}