package acmp;

/* acmp.ru   |   Задание №671
		Счастливые числа
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Все знают, что счастливые числа – это те числа, которые содержат только счастливые цифры 7 и 4. Вам нужно найти количество счастливых чисел не больших N.

Входные данные
В единственной строке входного файла INPUT.TXT записано натуральное число N, не превышающее 10^32.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число — ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |56                  |4                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_671 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}