package acmp;

/* acmp.ru   |   Задание №789
		Последовательность - 3
(Время: 1 сек. Память: 16 Мб Сложность: 37%)
Найдите n-й элемент строго возрастающей последовательности, которая описывается следующими правилами:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |2                   |
|2 |9                   |10                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_789 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}