package acmp;

/* acmp.ru   |   Задание №279
		Скобочки - 2
(Время: 1 сек. Память: 16 Мб Сложность: 37%)
Напомним, что называется правильной скобочной последовательностью:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |(())[]              |0                   |
|2 |[(])                |2                   |
|3 |((]]]               |-1                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_279 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}