package acmp;

/* acmp.ru   |   Задание №960
		Три буквы
(Время: 1 сек. Память: 16 Мб Сложность: 44%)
Напомним, что cтрока B = b1b2b3...bm, является подпоследовательностью строки A = a1a2a3...an, если существует строго возрастающая последовательность {i1, i2, i3, ... , im} индексов A, такая, что для всех j от 1 до m выполняется Aij=Bj. Например, B = ”aba” является подпоследовательностью строки A = ”abacaba”. Последовательность индексов в этом случае может быть такой: {1, 2, 3}.

Пусть Вам дана строка S, состоящая только из маленьких букв английского алфавита. Ваша задача заключается в том, чтобы посчитать количество ее подпоследовательностей “abc”.

Входные данные
Входной файл INPUT.TXT содержит строку S, длиной не более 10^5 символов.

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |abc                 |1                   |
|2 |ab                  |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_960 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}