package acmp;

/* acmp.ru   |   Задание №889
		Паутина
(Время: 1 сек. Память: 16 Мб Сложность: 38%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 6                 |2                   |
|  | 1 2                |                    |
|  | 3 4                |                    |
|1 | 2 5                |                    |
|  | 3 1                |                    |
|  | 1 4                |                    |
|  | 2 3                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_889 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}