package acmp;

/* acmp.ru   |   Задание №360
		Максимальная тройка
(Время: 3 сек. Память: 16 Мб Сложность: 33%)
В данной двумерной целочисленной таблице размером N &times; N требуется найти три элемента, сумма которых максимальна. При этом первый элемент должен быть соседним по горизонтали или вертикали со вторым, а второй — с третьим.

Входные данные
Входной файл INPUT.TXT содержит в первой строке число N (1 &lt; N ≤ 2000). В следующих N строках записано по N чисел – элементы таблицы. Элементы матрицы по абсолютной величине не превышают 100.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать единственное число — максимальную сумму.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |6                   |
|  | 1 1 1              |                    |
|1 | 2 2 1              |                    |
|  | 2 1 0              |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_360 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}