package acmp;

/* acmp.ru   |   Задание №361
		Подстроки из одинаковых букв
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
В заданной строке, состоящей из малых английских букв, необходимо найти пару самых длинных подстрок, состоящих из одних и тех же букв (возможно, в разном порядке). Например, в строке twotwow это будут подстроки wotwo и otwow.

Входные данные
Входной файл INPUT.TXT содержит исходную строку, длиной от 1 до 100 символов.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать единственное число – длину подстрок в максимальной паре, или 0, если таких подстрок в строке нет.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |abcde               |0                   |
|2 |abcdea              |5                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_361 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}