package acmp;

/* acmp.ru   |   Задание №209
		Целые точки
(Время: 1 сек. Память: 16 Мб Сложность: 64%)
Многоугольник (не обязательно выпуклый) на плоскости задан координатами своих вершин. Требуется подсчитать количество точек с целочисленными координатами, лежащих внутри него (но не на его границе).

Входные данные
В первой строке входного файла INPUT.TXT содержится N (3≤N≤10^3) – число вершин многоугольника. В последующих N строках идут координаты (Xi, Yi) вершин многоугольника в порядке обхода по часовой стрелке. Xi и Yi - целые числа, по модулю не превосходящие 10^6.

Выходные данные
Ваша программа должна вывести в выходной файл OUTPUT.TXT одно целое число - ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |1                   |
|  | -1 -1              |                    |
|1 | -1 1               |                    |
|  | 1 1                |                    |
|  | 1 -1               |                    |
|--|--------------------|--------------------|
|  |3                   |0                   |
|  | 0 0                |                    |
|2 | 0 2                |                    |
|  | 2 0                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_209 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}