package acmp;

/* acmp.ru   |   Задание №988
		Последовательность чисел
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Рассмотрим рекуррентно заданную последовательность чисел Si:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |1                   |
|  |1 1                 |No solution         |
|1 |2 1                 |1                   |
|  |1 2                 |2                   |
|  |2 2                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_988 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}