package acmp;

/* acmp.ru   |   Задание №120
		Минимальный путь в таблице
(Время: 1 сек. Память: 16 Мб Сложность: 32%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 4                 |8                   |
|  | 1 1 1 1            |                    |
|1 | 5 2 2 100          |                    |
|  | 9 4 2 1            |                    |
|--|--------------------|--------------------|
|  |5 5                 |11                  |
|  | 1 1 1 1 1          |                    |
|  | 3 100 100 100 100  |                    |
|2 | 1 1 1 1 1          |                    |
|  | 2 2 2 2 1          |                    |
|  | 1 1 1 1 1          |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_120 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}