package acmp;

/* acmp.ru   |   Задание №346
		Сумма двух чисел
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
Заданы три числа: a, b, c. Необходимо выяснить, можно ли так переставить цифры в числах a и b, чтобы в сумме получилось c.

Входные данные
Входной файл INPUT.TXT содержит три целых числа: a, b, c (0 ≤ a, b, c &lt; 10^9). Числа разделены пробелом.

Выходные данные
В выходной файл OUTPUT.TXT следует вывести YES, если искомая перестановка цифр возможна, в противном случае необходимо вывести NO. При положительном ответе во второй строке следует вывести число x, получаемое перестановкой цифр числа a, и число y, получаемое перестановкой цифр числа b, сумма которых равна c. Числа x и y при выводе не должны содержать ведущих нулей. Числа в строке разделены пробелом. Если решений несколько, то следует вывести ту пару, в которой число x минимально.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |12 31 25            |YES                 |
|1 |                    |12 13               |
|--|--------------------|--------------------|
|2 |12 31 26            |NO                  |
|--|--------------------|--------------------|
|  |101 2 13            |YES                 |
|3 |                    |11 2                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_346 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}