package acmp;

/* acmp.ru   |   Задание №483
		Двоичная машина
(Время: 1 сек. Память: 16 Мб Сложность: 53%)
На вход некоторой двоичной машине подается n-разрядное двоичное число. Машина подвергает поданное число следующим преобразованиям:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |10                  |
|1 |1001                |                    |
|--|--------------------|--------------------|
|  |7                   |101                 |
|2 |1101101             |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_483 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}