package acmp;

/* acmp.ru   |   Задание №46
		Число E
(Время: 1 сек. Память: 16 Мб Сложность: 20%)
Выведите в выходной файл округленное до n знаков после десятичной точки число E. В данной задаче будем считать, что число Е в точности равно 2.7182818284590452353602875.

Входные данные
Входной файл INPUT.TXT содержит целое число n (0 ≤ n ≤ 25).

Выходные данные
В выходной файл OUTPUT.TXT выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |0                   |3                   |
|2 |25                  |2.7182818284590452353602875|
|3 |13                  |2.7182818284590     |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_046 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}