package acmp;

/* acmp.ru   |   Задание №666
		Абракадабра
(Время: 1 сек. Память: 16 Мб Сложность: 41%)
Последовательность из английских букв строится следующим образом. Вначале она пуста. На каждом последующем шаге последовательность удваивается, после чего к ней слева дописывается очередная буква английского алфавита (a, b, c, …). Ниже приведены первые шаги построения по-следовательности:

Шаг 1. a

Шаг 2. baa

Шаг 3. cbaabaa

Шаг 4. dcbaabaacbaabaa

…………………………

Требуется написать программу, которая по заданному числу N находит символ, который стоит на N-ом месте в последовательности, получившейся после 26-го шага.

Входные данные
В единственной строке входного файла INPUT.TXT записано число N (1 ≤ N &lt; 2^26).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести символ, стоящий в N-й позиции получившейся последовательности.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |4                   |w                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_666 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}