package acmp;

/* acmp.ru   |   Задание №859
		Сумма от 1 до N
(Время: 1 сек. Память: 16 Мб Сложность: 50%)
Требуется найти сумму от 1 до N.

Входные данные
В единственной строке входного файла INPUT.TXT записано натуральное число N, не превышающее 10^100.

Выходные данные
В единственную строку выходного файла OUTPUT.TXT выведите одно целое число – ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |5                   |15                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_859 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}