package acmp;

/* acmp.ru   |   Задание №568
		Дороги - 2
(Время: 1 сек. Память: 32 Мб Сложность: 53%)
Мэр города Гадюкино решил проверить состояние дорог после только что проведенного капитального ремонта. Для этого он хочет проехать по каждой дороге в обоих направлениях. Помогите мэру составить кратчайший маршрут, проходящий по каждой дороге в каждом направлении хотя бы один раз.

В городе Гадюкино n перекрестков и m дорог, каждая из которых соединяет два различных перекрестка. Между двумя перекрестками может быть не более одной дороги. Известно, что по дорогам от каждого перекрестка можно доехать до любого другого.

Входные данные
Входной файл INPUT.TXT содержит целые числа n и m (1 ≤ n ≤ 10^4, 1 ≤ m ≤ 10^5), и далее m пар целых чисел ai и bi - номера перекрестков, которые соединяет i-я дорога.

Выходные данные
В выходной файл OUTPUT.TXT выведите число s - минимальную длину пути и далее s+1 число - номера перекрестков в том порядке, в котором их нужно проезжать.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3 3                 |6                   |
|  | 1 2                |1 2 3 1 3 2 1       |
|1 | 2 3                |                    |
|  | 1 3                |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_568 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}