package acmp;

/* acmp.ru   |   Задание №549
		Факториальная система
(Время: 1 сек. Память: 16 Мб Сложность: 58%)
Известно, что любую рациональную дробь вида p/q можно представить в виде (0 &lt; p &lt; q):</p> <img src="/asp/article/image.asp?id=289" alt="Факториальное представление рационального числа" hspace="50"> <p class="text">где 0 ≤ ai &lt; i, i=2, 3, ..., n для некоторого конечного n. Такое представление называется <i>факториальным</i>.

Требуется написать программу, которая по заданной рациональной дроби находит ее факториальное представление.

Входные данные
Во входном файле INPUT.TXT записаны через пробел два натуральных числа p и q (p &lt; q &lt;1000).

Выходные данные
В выходной файл OUTPUT.TXT нужно в первой строке вывести число n - количество значащих разрядов плюс 1 в факториальном представлении дроби. В следующих строках располагаются неотрицательные целые числа a2, a3, ..., an. Известно, что n &lt; 1000.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |1 5                 |5                   |
|  |                    |0                   |
|1 |                    |1                   |
|  |                    |0                   |
|  |                    |4                   |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_549 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}