package acmp;

/* acmp.ru   |   Задание №179
		Последовательность
(Время: 1 сек. Память: 16 Мб Сложность: 47%)
Рассмотрим числовую последовательность, первоначально состоящую из двух единиц: 1, 1. Далее на каждом последующем шаге будем вставлять между соседними элементами их сумму. В примере добавляемые элементы выделены:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |28                  |
|2 |10                  |59050               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_179 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}