package acmp;

/* acmp.ru   |   Задание №830
		Странная таблица
(Время: 1 сек. Память: 16 Мб Сложность: 81%)
Вася нарисовал таблицу из N+1 строки и M+1 столбца и заполнил ее по строкам целыми неотрицательными числами по следующему правилу:

<img src="/asp/article/image.asp?id=417">

Иными словами, Ai,j – минимальное целое неотрицательное число, которое не встречалось или выше или левее в таблице.

Например, при N=1 и M=2 получается следующая таблица:

<img src="/asp/article/image.asp?id=418">

Теперь ему интересно посчитать сумму

<img src="/asp/article/image.asp?id=419">

то есть сумму элементов таблицы. Ваша задача проверить его вычисления и написать программу, вычисляющую эту сумму.

Входные данные
Входной файл INPUT.TXT содержит числа N и M (1 ≤ N, M ≤ 10^9).

Выходные данные
В выходной файл OUTPUT.TXT выведите искомую сумму.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1                 |2                   |
|2 |1 2                 |7                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_830 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}