package acmp;

/* acmp.ru   |   Задание №47
		Наилучший делитель
(Время: 1 сек. Память: 16 Мб Сложность: 26%)
Будем говорить, что число a лучше числа b, если сумма цифр a больше суммы цифр числа b, а в случае равенства сумм их цифр, если число a меньше числа b. Например, число 124 лучше числа 123, так как у первого из них сумма цифр равна семи, а у второго – шести. Также, число 3 лучше числа 111, так как у них равны суммы цифр, но первое из них меньше.

Дано число n. Найдите такой его делитель (само число n и единица считаются делителями числа n), который лучше любого другого делителя числа n.

Входные данные
Первая строка входного файла содержит целое число n (1 ≤ n ≤ 10^5).

Выходные данные
В выходной файл выведите ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |10                  |5                   |
|2 |239                 |239                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_047 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}