package acmp;

/* acmp.ru   |   Задание №319
		Точки отрезка
(Время: 1 сек. Память: 16 Мб Сложность: 42%)
Концы отрезка на плоскости имеют целочисленные координаты.

Требуется написать программу, которая вычислит, сколько всего точек с целочисленными координатами принадлежат этому отрезку.

Входные данные
Входной файл INPUT.TXT содержит четыре числа – координаты концов отрезка (x1, y1) и (x2, y2). Каждая из координат не превышает по абсолютной величине значения 10^9.

Выходные данные
Выходной файл OUTPUT.TXT должен содержать одно число – количество точек на заданном отрезке, имеющих целочисленные координаты.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |1 1 2 2             |2                   |
|2 |0 0 -2 -2           |3                   |
|3 |1 1 1 10            |10                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_319 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}