package acmp;

/* acmp.ru   |   Задание №484
		Трубопровод
(Время: 1 сек. Память: 16 Мб Сложность: 60%)
В некоторой корпорации при производстве различных химических веществ используется сложная система трубопроводов для слива отходов. При монтаже трубопровода использовались стандартные элементы, состоящие из двух задвижек, двух входов и одного выхода (рис. 1).

Такие элементы объединяются вместе, как показано на рисунке 2, где изображен трубопровод до 4 уровня. Здесь обозначение Layer – указывает на слой (уровень) задвижек.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |8                   |8 4 2 1             |
|2 |5                   |5 2 1               |
|3 |6                   |6 3 1               |
|4 |10                  |10 6 3 1            |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_484 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}