package acmp;

/* acmp.ru   |   Задание №510
		Шоколадка
(Время: 1 сек. Память: 16 Мб Сложность: 40%)
Саша, не сделал домашнюю работу, зато купил шоколадку. И, по глупости, начал распечатывать ее прямо на уроке... Шелест золотинки услышала учительница. Она хотела вызвать в школу родителей, но Саша уговорил ее не вызывать их, а дать дополнительное задание.

Учительница внимательно посмотрела на шоколадку (она была размером 3х4 плиток), разделила на кусочки по две плитки и угостила всех, кто сделал домашнюю работу. А Сашу попросила написать программу, которая определяет, сколько существует способов деления шоколадки размером 3&times;N плиток на кусочки по две плитки.

Для выполнения задания Саше нужна помощь.

Входные данные
Входной файл INPUT.TXT содержит натуральное число N – размер плитки, (N &lt; 33).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – количество возможных способов.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2                   |3                   |
|2 |4                   |11                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_510 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}