package acmp;

/* acmp.ru   |   Задание №606
		Треугольник - 3
(Время: 1 сек. Память: 16 Мб Сложность: 12%)
Даны длины трех отрезков. Требуется проверить: могут ли они являться сторонами невырожденного треугольника.

Входные данные
Первая строка входного файла INPUT.TXT содержит 3 натуральных числа X Y Z через пробел – длины заданных отрезков. Длины отрезков не превышают 1000.

Выходные данные
В выходной файл OUTPUT.TXT выведите YES, если отрезки могут быть сторонами треугольника и NO в противном случае.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3 4 5               |YES                 |
|2 |1 1 5               |NO                  |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_606 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}