package acmp;

/* acmp.ru   |   Задание №390
		Треугольная область
(Время: 1 сек. Память: 16 Мб Сложность: 41%)
Одним из субъектов Флатландии является Треугольная область. Как следует из ее названия, она имеет форму треугольника, вершины которого находятся в точках с координатами (x1,y1), (x2,y2), (x3,y3). Административный центр этой области находится в точке с координатами (xc,yc), которая лежит строго внутри указанного треугольника.

Для оценки транспортного и логистического потенциала области, ее руководству понадобилось узнать расстояние от административного центра области до ее границы. Напишите программу, которая вычислит это расстояние.

Входные данные
Первая строка входного файла INPUT.TXT содержит шесть целых чисел – x1, y1, x2, y2, x3, y3. Вторая строка входного файла содержит два целых числа – xc и yc. Все числа во входном файле не превосходят 10000 по абсолютной величине. В заданном треугольнике нет тупых углов.

Выходные данные
В выходной файл OUTPUT.TXT выведите искомое расстояние до границы с точностью не менее 10^-6.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |0 0 1 2 2 0         |0.4472135           |
|1 |1 1                 |                    |
|--|--------------------|--------------------|
|  |0 0 0 3 3 0         |0.7071067           |
|2 |1 1                 |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_390 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}