package acmp;

/* acmp.ru   |   Задание №156
		Шахматы - 2
(Время: 1 сек. Память: 16 Мб Сложность: 46%)
Требуется найти число способов расставить на шахматной доске N&times;N K ладей так, чтобы они не били друг друга. Все ладьи считаются одинаковыми.

Входные данные
Во входном файле INPUT.TXT записаны натуральные числа N и K (N, K ≤ 8).

Выходные данные
В выходной файл OUTPUT.TXT выведите одно целое число – ответ на задачу.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |8 8                 |40320               |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_156 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}