package acmp;

/* acmp.ru   |   Задание №430
		Дуга на сфере
(Время: 1 сек. Память: 16 Мб Сложность: 51%)
На поверхности планеты, являющейся шаром радиусом R, заданы две точки своими широтой и долготой. Требуется найти минимальную длину пути по поверхности этой планеты из одной точки в другую.

Входные данные
В первой строке входного файла INPUT.TXT находится число R, во второй строке заданы широта и долгота первой точки, в третьей строке - широта и долгота второй точки. Широта измеряется в градусах от -90 до 90, долгота – в градусах от -180 до 180. Радиус R меняется в пределах от 100 до 10000. Все числа вещественные.

Выходные данные
В выходной файл OUTPUT.TXT выведите длину пути с двумя знаками после запятой.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4000                |3141.59             |
|1 |45 120              |                    |
|  |0 120               |                    |
|--|--------------------|--------------------|
|  |3437.5              |52.04               |
|2 |41.766666 -50.233333|                    |
|  |41.236388 -51.15    |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_430 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}