package acmp;

/* acmp.ru   |   Задание №674
		Выбор приборов
(Время: 1 сек. Память: 16 Мб Сложность: 37%)
Для проведения эксперимента надо выбрать из N имеющихся приборов только три. Для этого выполняют следующую операцию - если в группе приборов больше трех, то их нумеруют и выбирают одну из групп: с четными или нечетными номерами. Операцию повторяют до тех пор, пока в группе не останется три или менее приборов. Если их остается ровно три, то они и берутся для эксперимента.

Требуется написать программу, которая подсчитает количество способов такого выбора приборов.

Входные данные
В единственной строке входного файла INPUT.TXT записано число N (1 ≤ N ≤ 2147483647).

Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести одно число - найденное количество способов выбора приборов.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |1                   |
|2 |6                   |2                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_674 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}