package acmp;

/* acmp.ru   |   Задание №888
		Карусель
(Время: 1 сек. Память: 16 Мб Сложность: 22%)
Карусель – одна из популярных форм проведения командных соревнований по решению задач. Наибольшую известность в использовании данной модели в России получил ресурс «Интернет-карусели», расположенный в сети Интернет по адресу <a href="http://karusel.desc.ru" target="_blank">http://karusel.desc.ru</a>.

Всем командам, участвующим в карусели, предлагаются в строгом порядке одни и те же задачи, которые необходимо решить в установленное время. Система подсчета баллов такова, что доминирующим фактором является не количество решенных задач, а длины последовательностей правильных решений.

Начисление баллов происходит согласно следующей схеме:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |3                   |12                  |
|1 |1 1 1               |                    |
|--|--------------------|--------------------|
|  |9                   |30                  |
|2 |1 0 1 1 1 1 0 1 1   |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_888 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}