package acmp;

/* acmp.ru   |   Задание №91
		Две последовательности
(Время: 1 сек. Память: 16 Мб Сложность: 29%)
Определим последовательности an и bn следующим образом: a1 = 2, a2 = 3, a3 = 4, a4 = 7, a5 = 13, an = bn&#x2212;1 + bn&#x2212;3, n &gt; 5, bn — последовательность чисел, не входящих в an, записанных в возрастающем порядке.

Таким образом, последовательность an будет выглядеть следующим образом: 2, 3, 4, 7, 13, 15,..., а последовательность bn – 1, 5, 6, 8, 9, 10,....

Ваша задача состоит в том, чтобы найти an и bn.

Входные данные
Входной файл содержит целое число n (1 ≤ n ≤ 10000).

Выходные данные
В первой строке выходного файла выведите an, во второй – bn.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |4                   |7                   |
|1 |                    |8                   |
|--|--------------------|--------------------|
|  |10                  |25                  |
|2 |                    |16                  |
|--|--------------------|--------------------|
|  |6578                |19731               |
|3 |                    |9868                |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_91 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}