package acmp;

/* acmp.ru   |   Задание №651
		Преобразование моноклеточных
(Время: 1 сек. Память: 16 Мб Сложность: 29%)
Как великолепна страна Байтландия! В ней есть цветущие леса, прозрачные реки, кисельные берега… Но речь пойдет не о них. Уже много лет в Байтландии функционирует НИИ “Цитологии и генетики”. В нем выводятся новые формы жизни. Недавно ученым этого НИИ удалось разработать принципиально новый вид организмов. Особенностью этих организмов является то, что они состоят из большого количества однотипных клеток, то есть являются моноклеточными.

Правительство Байтландии заинтересовалось новой разработкой и сделало заказ на производство двух моноклеточных организмов, в каждом из которых должно быть по M клеток. За несколько дней до сдачи проекта было обнаружено, что в одном из организмов получается не M клеток, а N. На какой из стадий разработки была допущена ошибка неизвестно, но положение надо исправлять!

Сотрудниками НИИ было принято решение о преобразовании моноклеточного с N клетками в моноклеточное с M клетками. Для этого в экстренном режиме было разработано два типа вещества:

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 36                |3                   |
|2 |32768 3             |16                  |
|3 |1434 1434           |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_651 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}