package acmp;

/* acmp.ru   |   Задание №255
		Представление чисел
(Время: 0,5 сек. Память: 16 Мб Сложность: 40%)
Дано натуральное число N. Требуется представить его в виде суммы двух натуральных чисел A и B таких, что НОД (наибольший общий делитель) чисел A и B — максимален.

Входные данные
Во входном файле INPUT.TXT записано натуральное число N (2 ≤ N ≤ 10^9)

Выходные данные
В выходной файл OUTPUT.TXT выведите два искомых числа A и B. Если решений несколько, выведите то из них, где A принимает наименьшее возможное значение.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |15                  |5 10                |
|2 |16                  |8 8                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_255 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}