package acmp;

/* acmp.ru   |   Задание №289
		Делители
(Время: 1 сек. Память: 16 Мб Сложность: 76%)
По заданному количеству делителей числа требуется найти само это число.

Входные данные
Во входном файле INPUT.TXT записано количество делителей D некоторого натурального числа N (1 ≤ D ≤ 5000).

Выходные данные
В выходной файл OUTPUT.TXT запишите число N. Если решений несколько, выведите наименьшее из них. Если решения нет, или наименьшее из решений превосходит 10^15+1, запишите в файл число 0.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |3                   |4                   |
|2 |4                   |6                   |
|3 |12                  |60                  |
|4 |60                  |5040                |
|5 |4911                |0                   |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_289 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}