package acmp;

/* acmp.ru   |   Задание №540
		Таблица
(Время: 1 сек. Память: 16 Мб Сложность: 45%)
__EXERCISE__



Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|--|--------------------|--------------------|
|  |2 3 10              |3 6 5               |
|1 |1 2 3               |                    |
|--|--------------------|--------------------|
|  |3 3 10              |8 0 8               |
|2 |1 1 1               |                    |
|--|--------------------|--------------------|
|  |3 4 40              |23 0 4 33           |
|3 |2 3 4 5             |                    |
|--|--------------------|--------------------|
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_540 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}