package acmp;

/* acmp.ru   |   Задание №822
		Площадь треугольника
(Время: 1 сек. Память: 16 Мб Сложность: 15%)
По целочисленным координатам вершин треугольника (x1,y1), (x2,y2) и (x3,y3) требуется вычислить его площадь.

Входные данные
Входной файл INPUT.TXT содержит 6 целых чисел x1,y1,x2,y2,x3,y3 – координаты вершин треугольника. Все числа не превышают 10^6 по абсолютной величине.

Выходные данные
В выходной файл OUTPUT.TXT выведите точное значение площади заданного треугольника.

Пример:
----------------------------------------------
|№ |     INPUT.TXT      |     OUTPUT.TXT     |
|--|--------------------|--------------------|
|1 |2 1 2 4 6 1         |6                   |
|2 |0 0 0 3 3 0         |4.5                 |
----------------------------------------------



Решение.

*/


import java.util.Scanner;

public class acmp_822 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		System.out.print("");
	}
}