/* acmp.ru   |   Задание №

(Ограничения: Время 1 сек. Память 16 Мб)

Входные данные


Выходные данные




Пример:
---------------------------------
|№ |  INPUT.TXT  |  OUTPUT.TXT  |
|-------------------------------|
|1 |2            |19            |
---------------------------------



Решение.

*/

import java.util.Scanner;

public class Ex_ {
    public static void main(String[] args) {
      Scanner in = new Scanner(System.in);
      
      System.out.print("");
    }
}
